{
  "company_name": "Capital_One",
  "sector": "Financial_Services",
  "sample_size": 20,
  "total_jobs_available": 1058,
  "jobs": [
    {
      "id": "in-fbaea3fa3083fd48",
      "title": "Agency Operations Associate - Loan Operations",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=fbaea3fa3083fd48",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/75477539008",
      "location": {
        "country": "US",
        "city": "McLean",
        "state": "VA"
      },
      "description": "Center 1 (19052\\), United States of America, McLean, Virginia\nAgency Operations Associate \\- Loan Operations\nMultifamily Loan Servicing is a division of the Capital One Commercial Bank, this team supports numerous critical processes and transactions. By cultivating innovative solutions and embracing technology, this team creates an unforgettable and unparalleled experience for our associates and customers. One of the most impactful groups in the Loan Servicing team is the Cash Team.\n\n\nThe Multifamily Investor Reporting team supports a total loan portfolio of $50BN and provides ongoing support for the life of the loan. The organization focuses on delivering scale and efficiency, mitigating operational risk, providing a smooth customer experience and enabling talented associates to excel.\n\n**Responsibilities**\n\n\n Maintain \\& encourage positive relationship/partnership with the GSEs, HUD and Ginnie Mae Collaborate across the Agency Finance platform to provide consistent excellence in customer service to borrowers, investor contacts, attorneys, auditors and internal partners.\n\n* Perform critical loan and investor level loan maintenance in the loan servicing system such as payoffs, defeasances, customer auto\\-debits and investor transfers with strong attention to detail and high accuracy.\n* Manage payment of post\\-closing fees to attorneys, investors and third parties\n* Review and analyze loan documents to ensure accurate loan data\n* Craft audit responses utilizing business acumen and knowledge to support various departments within the business\n* Assist and coordinate on various projects, including technology\\-based, data integrity, remediation, and efficiency\\-enhancing\n* Initiate and support internal reporting and metrics tracking, including tracking project performance and remediation activity.\n* Actively manage and seek resolution for payments held in suspense.\n* Assist in initial and ongoing review of departmental procedures.\n* Assist and coordinate on various projects, including technology\\-based, data integrity, remediation, and efficiency\\-enhancing.\n\n **Basic Qualifications**\n\n* Bachelor’s Degree or Military Experience\n* At least 1 year of experience in financial services\n\n**Preferred Qualifications**\n\n* 2\\+ years of Commercial Bank Operations, Loan Servicing, Risk, Compliance or Government Sponsored Entities (GSE) experience\n\n***At this time, Capital One will not sponsor a new applicant for employment authorization for this position.***\n\n**\\#CommOps**\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2025-01-02",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-0691fdf5da66e16c",
      "title": "Principal Associate, Risk Management (Auto Finance)",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=0691fdf5da66e16c",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/72186782016",
      "location": {
        "country": "US",
        "city": "Plano",
        "state": "TX"
      },
      "description": "Plano 5 (31065\\), United States of America, Plano, Texas\nPrincipal Associate, Risk Management (Auto Finance)\nAs a Principal Risk Associate in the Financial Services Business Risk Office, you will provide professional risk judgment that enables business partners to tackle major company challenges. In this role, not only will you lean into your analytical and problem solving skills by developing and deploying innovative solutions to mitigate risks to the Company, but you will also grow your strategic and influencing skills as you create and implement risk strategies that enable the Company to win in the market. You will create order and sense out of complexity and uncertainty and enable confident, data\\-inspired decision making.\n\n\nIn this role, you will thrive in a cross\\-functional and collaborative environment that values unique perspectives, rewards innovation, and challenges the status quo. As an integral member of the team, you will have a high level of exposure across the division partnering closely with senior business and risk office leaders, technology, compliance, legal, and Operational Risk Management.\n\n\nIn your role, you will:\n\n* Develop a deep understanding of business strategies, products, services, and risk profile;\n* Identify and assess the impact of the changing regulatory environment on business objectives and risk appetite;\n* Analyze data to proactively identify risks and trends and provide insights that support internal customers in decision\\-making;\n* Provide guidance and advice to business partners on implementing risk policies and programs;\n* Drive collaboration between the risk, compliance, legal, and other business support functions;\n* Ensure independent escalation of risk management gaps, issues, and concerns to executive management and when appropriate, the Board of Directors, including emerging risks and regulatory focus areas;\n* Identify opportunities to improve risk management practices and develop solutions to perfect risk management, eliminate waste, and deliver an exceptional customer experience\n* Drive containment and remediation of process breakdowns in conjunction with compliance, legal and business process teams\n* Ability to analyze trends, determine root cause, and propose solutions\n\n\nQualities of a Successful Candidate:\n\n* Curious and Analytical \\- You ask why, explore possibilities, and bring your unique perspective to the table. You are comfortable with ambiguity and are a truth seeker. You make it your business to master the data and signals to drive innovative solutions that are grounded in evidence.\n* Communicative and Influential \\- You communicate complex ideas concisely and convincingly. You adjust your communication to your audience and are comfortable with presenting to executive leadership.\n* Discerning and Deliberative \\- You are careful and methodical, navigate uncertainty and risks expertly, and have a knack for steering the team away from impulsive or ill\\-informed decisions.\n* Action\\-Oriented and Results\\-Driven \\- You have a desire to take action, try new things, and sometimes fail. Roadblocks won’t set you back, because you’ll stay focused on your goals. You’re organized, able to juggle multiple deliverables, and prioritize your work while keeping the customer at the forefront of everything you do.\n* Up for a Challenge and Fungible \\- Big, undefined, unfamiliar, and complex problems will be exciting for you as you work to identify well\\-rounded solutions. You have an insatiable appetite for learning, and are constantly seeking out new challenges.\n* Passionate and Customer\\-Focused \\- You are customer obsessed. You make it your business to understand their needs and their goals and are not satisfied with anything less than an exceptional customer experience.\n* Collaborative and Team\\-Oriented \\- You value diverse perspectives and seek insights from others. You bring energy to the group and rally them around a common goal.\n\n**Basic Qualifications:**\n\n* High School Diploma, GED or equivalent certification\n* At least 3 years of experience in project, process, program, or risk management\n\n**Preferred Qualifications:**\n\n* Bachelors, Masters Degree, MBA, or Juris Doctorate\n* 2\\+ years of experience in presenting to senior leadership\n* 2\\+ years analyzing trends, determining root cause, and proposing solutions\n\n\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-10-31",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-9be8dfc53b505d71",
      "title": "Manager, Financial Analysis",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=9be8dfc53b505d71",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/73002086704",
      "location": {
        "country": "US",
        "city": "McLean",
        "state": "VA"
      },
      "description": "Center 1 (19052\\), United States of America, McLean, Virginia\nManager, Financial Analysis\nIt’s an exciting time to join the Upmarket team, as we continue to pursue the top of the market in our Venture franchise and drive growth across our Upmarket product suite. We are looking for a Manager to join the FP\\&A Upmarket Card team, reporting to the FP\\&A Upmarket lead. This individual will be a central work lead, providing financial leadership across Upmarket, FP\\&A and connected teams. From providing deep insights to leadership and effective financial management of operating expenses, to leading analysis into evolving business trends and supporting critical financial planning, this position is key to providing financial leadership to client groups.\n\n\nRoles require strong leadership, problem solving, strategic thinking, and influencing skills in order to effectively:\n\n* Articulate outcomes of analysis and relevant insights\n* Partner with business leadership to assess the financial implications of ongoing efforts to grow the organization\n* Develop presentations to communicate business and analysis results to senior leadership audiences\n\n**General Responsibilities:**\n\n* Financial analysis \\& reporting: Accurately analyze \\& explain key cost drivers and monthly variances, suggest actions to the business, and manage the regular reporting process\n* Budgeting, forecasting, and Profit \\& Loss (P\\&L) management\n* Executive business presentations: Assist in development of presentations to communicate analysis results to senior audiences; clearly articulate outcomes of analysis to leadership teams\n* Ad\\-hoc requests and special projects\n* Independently manage, prioritize, and delegate tasks\n* Manage and develop associates\n\n**Basic Qualifications:**\n\n* Bachelor’s Degree or military experience\n* At least 4 years’ experience in financial analysis\n* At least 4 years’ experience with financial modeling\n* At least 1 year of experience managing a Financial Planning and Analysis (FP\\&A) function\n\n**Preferred Qualifications:**\n\n* Master’s Degree in Business Administration (MBA) or Master’s Degree in Finance\n* Chartered Financial Analyst (CFA) license or Certified Public Accountant (CPA) license\n* 6\\+ years’ experience in financial analysis\n* 6\\+ years’ experience with financial modeling\n* 3\\+ years’ experience managing a Financial Planning \\& Analysis (FP\\&A) function\n* 1\\+ years of people management experience\n* Experience in Microsoft Excel, Microsoft PowerPoint, and Google Workspace\n\n\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-11-15",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-592a14c66f770d9e",
      "title": "Manager, Product Management - Business Cards & Payments",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=592a14c66f770d9e",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/69511021280",
      "location": {
        "country": "US",
        "city": "Richmond",
        "state": "VA"
      },
      "description": "Locations: VA \\- Richmond, United States of America, Richmond, Virginia\nManager, Product Management \\- Business Cards \\& Payments\nThe Business Cards \\& Payments (BC\\&P) organization is committed to fueling the courageous entrepreneurial spirit that's at the heart of America's business owners and offer products and services to help them do more business.\n\n\nWe’ve built an organization that is focused on listening to and learning from the millions of business customers we serve every day to make sure our products, services and experiences work as hard as they do. The name of our organization reflects our current leadership position in Small Business and Commercial Cards \\- as well as our aspiration to serve a wide range of needs for our customers Beyond the Card.\n\n\nWe are a culture that dreams big and embraces an entrepreneurial and ownership spirit \\- just like our business customers.\n\n\nProduct Management at Capital One is a booming, vibrant craft that requires reimagining the status quo, finding value creation opportunities, and driving innovative and sustainable customer experiences through technology.\n\n\nWe believe our portfolio of businesses and investments in growth and transformation will result in a company with the scale, brand, capabilities, talent, and values to succeed as the digital revolution transforms our society and our industry.\n\n\nDo you dream of well\\-designed and intuitive products and customer experiences? Do you want to be the one who introduces change to help tens of millions of customers make smarter financial choices? Do you want to change the way people manage their money? If you answered yes to all of these questions, then product management at Capital One may be a fit for you\n\n***In this role, you’ll be expected to demonstrate proficiency in four key areas***\n\n* *Human Centered*\n\n\n\t+ You’ll define clear and actionable problem statements to help teams deliver results while displaying a comprehensive understanding of iterative software delivery, capable of thin\\-slice MVP grooming\n\t+ You’ll leverage customer insights to influence priorities and roadmap feature development while advocating for and driving alignment between stakeholders in the development of acceptance criteria\n\t+ You’ll obsess over UX/UI patterns and seek to create world class, omni\\-channel experiences\n* *Business Focused*\n\n\n\t+ You’ll own and prioritize the near\\-term product roadmap to deliver on business outcomes, quickly identifying points of leverage in complex problems or systems, and utilizing data effectively to define success metrics and measurable outcomes\n\t+ You’ll utilize balanced judgment in decisions about risks of both actions taken and not taken while innovating on ways to iterate faster in a well\\-managed way for the immediate team\n* *Technology Driven*\n\n\n\t+ You’ll understand and leverage technology and end\\-state architecture vision to partner with technology team to drive comprehensive design decisions out of white space technical problems\n\t+ You’ll share business strategy and roadmap with Tech partners to establish context while also leading and facilitating agile ceremonies alongside Tech Lead\n\t+ You’ll deliver value by creating reusable, extensible and resilient capabilities and proactively identify opportunities when key metrics on security, resilience and performance are not performing\n* Integrated Problem Solving\n\n\n\t+ Develop and champion a bold vision that drives meaningful outcomes by embracing the art of the possible\n\t+ Build frameworks for complex decision making that enable effective debate and accelerate getting to the right answer\n* *Transformational Leadership*\n\n\n\t+ You’ll develop and communicate a 6\\-month vision to senior stakeholders and partner teams with accurate details and transparency on risks and impediments, and proactively build relationships with those outside of your immediate team resulting in horizontal influence\n\t+ You’ll Contribute to team culture and recruiting by leading activities to attract and retain top talent and mentoring and developing junior product associates\n\n**We want you if you are:**\n\n* Intellectually Curious. You ask why, you explore, you're not afraid to blurt out your crazy idea or follow an email chain for weeks to find someone with an answer. Comfortable with ambiguity, a hunger to learn and a seeker of new challenges.\n* Communicator \\& Influencer. You can communicate complex ideas clearly regardless of your audience. Our team knows their priorities and why they’re doing what they’re doing. You always can rally associates to work with you..\n* Do\\-er. You’re biased toward action, you try things and sometimes you fail. You can get around roadblocks and stay focused on your goals. You’re well organized, able to multitask and able to prioritize your work.\n* Passionate \\& Customer Focus. You care about growing others and bringing them together around what’s possible. You get a thrill from the journey of building and shipping products, and you have a desire and ability to connect with our external or internal customers to fully understand their needs.\n* Learner. You have an appetite to learn new things or new technologies all while exhibiting humbleness when the time comes to ask for help.\n* Team Player. You enjoy working with diverse people and driving the team toward a common goal. You have the ability to put the team before yourself and establish long\\-lasting relationships.\n\n**Basic Qualifications:**\n\n* **Bachelor’s Degree or military experience**\n* **At least 3 year of product management experience or at least 3 year of experience in product design, agile delivery, business analysis, data science, or software engineering**\n\n**Preferred Qualifications:**\n\n* **Bachelor’s Degree in Computer Science or Engineering**\n* **MBA or Master’s degree**\n* **2\\+ years of experience in Agile product management**\n\n**At this time, Capital One will not sponsor a new applicant for employment authorization for this position.**\n\n\nThe minimum and maximum full\\-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part\\-time roles will be prorated based upon the agreed upon number of hours to be regularly worked. New York City (Hybrid On\\-Site): $163,300 \\- $186,400 for Manager, Product Management Candidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter. This role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-09-03",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-7c121924c2ac08ad",
      "title": "Senior Software Engineer, Data Use & Horizontal Services",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=7c121924c2ac08ad",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/70491152176",
      "location": {
        "country": "US",
        "city": "Richmond",
        "state": "VA"
      },
      "description": "West Creek 6 (12076\\), United States of America, Richmond, Virginia\nSenior Software Engineer, Data Use \\& Horizontal Services\nDo you love building and pioneering in the technology space? Do you enjoy solving complex business problems in a fast\\-paced, collaborative, inclusive, and iterative delivery environment? At Capital One, you'll be part of a big group of makers, breakers, doers and disruptors, who solve real problems and meet real customer needs. We are seeking a Senior Software Engineer who is passionate about marrying data with emerging technologies. As a Capital One Senior Software Engineer, you’ll have the opportunity to be on the forefront of driving a major transformation within Capital One.\n\n**What You’ll Do:**\n\n* Develop and execute as part of a world\\-class engineering team charged with ensuring our partners can integrate their products and features seamlessly into Capital One’s API external developer portal.\n* Collaborate with and across Agile teams to design, develop, test, implement, and support technical solutions in full\\-stack development tools and technologies\n* Share your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal \\& external technology communities, mentoring other members of the engineering community\n* Collaborate with digital product managers, and deliver robust cloud\\-based solutions that drive powerful experiences to help millions of Americans achieve financial empowerment\n* Utilize programming languages like JavaScript, Java, HTML/CSS, TypeScript, SQL, Python, and Go, Open Source RDBMS and NoSQL databases, Container Orchestration services including Docker and Kubernetes, and a variety of AWS tools and services\n\n**Basic Qualifications:**\n\n* Bachelor’s Degree\n* At least 3 years of experience in software engineering (Internship experience does not apply)\n\n**Preferred Qualifications:**\n\n* 5\\+ years of experience in at least one of the following: JavaScript, Java, TypeScript, SQL, Python, or Go\n* 1\\+ years of experience with Angular\n* 1\\+ years of experience with AWS, GCP, Microsoft Azure, or another cloud service\n* 3\\+ years of experience in open source frameworks\n* 2\\+ years of experience in Agile practices\n\n***At this time, Capital One will not sponsor a new applicant for employment authorization, or offer any immigration related support for this position (i.e. H1B, F\\-1 OPT, F\\-1 STEM OPT, F\\-1 CPT, J\\-1, TN, or another type of work authorization).***\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-09-27",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-7181583810f42dda",
      "title": "Senior Associate, Data Scientist - Card Customer Management",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=7181583810f42dda",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/74278457824",
      "location": {
        "country": "US",
        "city": "McLean",
        "state": "VA"
      },
      "description": "Center 1 (19052\\), United States of America, McLean, Virginia\nSenior Associate, Data Scientist \\- Card Customer Management\nData is at the center of everything we do. As a startup, we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast\\-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data\\-driven decision\\-making.\n\n\nAs a Data Scientist at Capital One, you’ll be part of a team that’s leading the next wave of disruption at a whole new scale, using the latest in computing and machine learning technologies and operating across billions of customer records to unlock the big opportunities that help everyday people save money, time and agony in their financial lives.\n\n**Team Description:**\n\nThe US Card Data Science team builds industry leading machine learning models to empower various customer management decisions for our existing customers. We collaborate closely with a wide range of cross functional partner teams \\- software engineers, managers, credit and business analysts, to deliver the solutions from ideation to implementation. We are a team of model developers, who own the full life cycle of our models \\- infrastructure development, model development, deployment, monitoring, and governance.\n\n**Role Description:**\n\n**In this role, you will:**\n\n* Partner with a cross\\-functional team of data scientists, software engineers, and product managers to deliver a product customers love\n* Leverage a broad stack of technologies — Python, Conda, AWS, H2O, Spark, and more — to reveal the insights hidden within huge volumes of numeric and textual data\n* Build machine learning models through all phases of development, from design through training, evaluation, validation, and implementation\n* Flex your interpersonal skills to translate the complexity of your work into tangible business goals\n\n**The Ideal Candidate is:**\n\n* Customer first. You love the process of analyzing and creating, but also share our passion to do the right thing. You know at the end of the day it’s about making the right decision for our customers.\n* A leader. You challenge conventional thinking and work with stakeholders to identify and improve the status quo. You're passionate about talent development for your own team and beyond.\n* Technical. You’re comfortable with open\\-source languages and are passionate about developing further. You have hands\\-on experience developing data science solutions using open\\-source tools and cloud computing platforms.\n* Statistically\\-minded. You’ve built models, validated them, and backtested them. You know how to interpret a confusion matrix or a ROC curve. You have experience with clustering, classification, sentiment analysis, time series, and deep learning.\n* A data guru. “Big data” doesn’t faze you. You have the skills to retrieve, combine, and analyze data from a variety of sources and structures. You know understanding the data is often the key to great data science.\n\n**Basic Qualifications:**\n\n* Currently has, or is in the process of obtaining a Bachelor’s Degree plus 3 years of experience in data analytics, or currently has, or is in the process of obtaining Master’s Degree plus 1 year of experience in data analytics with an expectation that required degree will be obtained on or before the scheduled start date\n* At least 1 year of experience in open source programming languages for large scale data analysis\n* At least 1 year of experience with machine learning\n* At least 1 year of experience with relational databases\n\n**Preferred Qualifications:**\n\n* Master’s Degree in “STEM” field (Science, Technology, Engineering, or Mathematics), or PhD in “STEM” field (Science, Technology, Engineering, or Mathematics)\n* Experience working with AWS\n* At least 2 years’ experience in Python, Scala, or R\n* At least 2 years’ experience with machine learning\n* At least 2 years’ experience with SQL\n\nThe minimum and maximum full\\-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part\\-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\n\nIllinois (Hybrid On\\-site):  \n\n$129,100 \\- $147,400 for Sr Assoc, Data Science  \n\nNew York City (Hybrid On\\-site):  \n\n$138,500 \\- $158,100 for Sr Assoc, Data Science\n\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter. This role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n\n**Capital One will consider sponsoring a new qualified applicant for employment authorization for this position.**\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-12-09",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-ad5e43af6f1dba93",
      "title": "Lead Data Engineer, Data Mgmt Optimization - Shopping (Remote)",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=ad5e43af6f1dba93",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/74117556960",
      "location": {
        "country": "US",
        "city": "Remote",
        "state": null
      },
      "description": "Locations: US Remote, United States of America\nLead Data Engineer, Data Mgmt Optimization \\- Shopping (Remote)**Interested in joining a dynamic remote first engineering team in a fast\\-paced environment full of greenfield problem\\-solving? Then Capital One Shopping might be the place for you. Join us in supporting a growth\\-stage line of business with a startup mindset as we build technology to save our customers money. Your role will involve working on data platforms that move billions of rows of data a day. You’ll use languages like Java and Go and work with platforms like Hive, Trino, Cassandra, Kafka, and Nomad.**\n\n**This is more than just a job; it's an opportunity to be part of a collaborative and forward\\-thinking community, where your contributions will make a significant impact in an ever\\-dynamic tech landscape. Join us as we push boundaries and redefine the future of our industry.**\n\n**What You’ll Do:**\n\n* **Collaborate with and across Agile teams to design, develop, test, implement, and support technical solutions for data analytics and management at scale**\n* **Work with a team of developers with deep experience in machine learning, distributed microservices, and full stack systems**\n* **Utilize programming languages like Java, Go, and Python and data platforms such as Trino, Hive, and Kafka**\n* **Share your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal \\& external technology communities, and mentoring other members of the engineering community**\n* **Collaborate with digital product managers, and deliver robust cloud\\-based solutions that drive powerful experiences to help millions of Americans achieve financial empowerment**\n\n**Basic Qualifications:**\n\n* **Bachelor’s Degree**\n* **At least 4 years of experience in application development (Internship experience does not apply)**\n* **At least 2 years of experience in big data technologies**\n* **At least 1 year experience with cloud computing (AWS, Microsoft Azure, Google Cloud)**\n\n**Preferred Qualifications:**\n\n* **5\\+ years of experience in application development including Java, Go, or Python**\n* **4\\+ years of experience with a public cloud (AWS, Microsoft Azure, Google Cloud)**\n* **4\\+ years experience with Distributed data/computing tools (MapReduce, Hadoop, Hive, EMR, Kafka, Spark)**\n* **4\\+ year experience working on real\\-time data and streaming applications**\n* **3\\+ years of experience with NoSQL implementation (Mongo, Cassandra)**\n* **3\\+ years of experience with UNIX/Linux including basic commands and shell scripting**\n* **2\\+ years of data warehousing experience (Redshift or Snowflake)**\n* **2\\+ years of experience with Agile engineering practices**\n\n***At this time, Capital One will not sponsor a new applicant for employment authorization, or offer any immigration related support for this position (i.e. H1B, F\\-1 OPT, F\\-1 STEM OPT, F\\-1 CPT, J\\-1, TN, or another type of work authorization).***\n\n\nThe minimum and maximum full\\-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part\\-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\n\nRemote (Regardless of Location): $170,700 \\- $194,800 for Lead Data Engineer\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\n\n\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-12-06",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-1cf655cda4b6518e",
      "title": "Sr. Associate, Risk Management - Card ACT Team",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=1cf655cda4b6518e",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/69791465488",
      "location": {
        "country": "US",
        "city": "Richmond",
        "state": "VA"
      },
      "description": "West Creek 1 (12071\\), United States of America, Richmond, Virginia\nSr. Associate, Risk Management \\- Card ACT Team\nRisk Managers at Capital One are highly motivated Risk Management professionals with excellent organizational and communication skills. They have a high level of exposure across lines of business and have the opportunity to work with Executives to create and implement innovative solutions to identify and mitigate potential risks to the Company. The Card Platforms and Well Managed team provides a strategically positioned defense, designed to strengthen the “well managed” muscle across Card Platforms and Services and fuel sustainable innovation by offering centralized support across multiple dimensions of risk mitigation activities.\n\n\nAs a SA Risk Associate performing Control Execution and supporting Horizontal Services, you will work among a talented team of individuals who provide strategic support for Regulatory controls engaging with both domestic and offshore partners. You’ll have an opportunity to contribute to exciting work that will make a difference, driving sustainable solutions for process excellence and risk mitigation to deliver on our goal to keep 100% of Customer promises.\n\n\nThe ACT Team is responsible for executing controls on behalf of the organizations we support. This varies based on alignment, but as of June 2024, we support 15 L2s and 180\\+ controls. The team is supported by onshore and offshore resources that facilitate the day to day execution of the work. Insights are critical to the overall health of the process and must be gleaned constantly to drive a consistent loop of feedback/improvement.\n\n**Responsibilities:**\n\n* Provides process controls for the department.\n* Identifies trends and produces reports on results each month.\n* Manages a team of associates.\n* Serves as a subject matter expert on projects and provides support for multiple audits\n* May manage audits for a large organization and the relationships between the auditors and the auditee.\n* Leads department in practices, policies and methodologies related to its processes\n* Manages day to day processes for multiple L2s, ensuring that the controls are appropriately documented and approved based on the current process.\n* Consistently Identify and implement process improvements within day to day operations\n* Report on mismatches and overall process help to create visibility into the fulfillment process (ACT)\n* Learn from mismatches to continually improve the quality of the report output\n* Back up for monitoring of all fulfillment validation reports\n* Maintain tracking process/performance monitoring for BAU\n* Maintain process documentation and implement review cycle\n\n**Basic Qualifications:**\n\n* High School Diploma, GED or equivalent certification\n* At least 3 years of Project Management or Process Management experience\n* At least 2 years of Operations, Financial Services Compliance or Risk Management experience\n* At least 2 years of experience with Excel or Google Sheets and PowerPoint or Google Slides\n\n  \n\n\n\n**Preferred Qualifications:**\n\n* 3\\+ years of Operations, Financial Services Compliance or Risk Management experience\n* 3\\+ years of experience in management of multiple projects concurrently in an autonomous environment\n* 3\\+ years of experience in risk methodologies and corporate risk practices\n* 3\\+ years of experience with Excel or Google Sheets and PowerPoint or Google Slides\n\n**At this time, Capital One will not sponsor a new applicant for employment authorization for this position.**\n\n\nThis role is ***hybrid***meaning associates typically spend about half their time (2\\-3 days per week) **in\\-person at one of our offices listed on this job posting**. ***Monday*** and ***Fridays*** are enterprise\\- wide ***virtual work days*****.*****Tuesday, Wednesday and Thursday***are in\\-person days for associates to spend time together working in our beautifully\\-designed team areas.\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-09-10",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-c34aa57c200d1e48",
      "title": "Manager, Data Center Ops (Cloud Operations Resilience Engineering)",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=c34aa57c200d1e48",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/75383840272",
      "location": {
        "country": "US",
        "city": "McLean",
        "state": "VA"
      },
      "description": "Center 3 (19075\\), United States of America, McLean, Virginia\nManager, Data Center Ops (Cloud Operations Resilience Engineering)  \n\nThis role will support all hardware and operating system software from an Operations perspective. The Facility Planner will work closely with various lines of business to support all facility and physical security activities. The Planner will be the first point of contact for internal customers and external vendors seeking support and information. Technical Hardware and Operating System SME (VMWare, AIX, Linux, Windows) to provide day to day support and gain efficiencies via automation. The role involves expertise in platforms and automation skills to simplify maintenance, break/fix, and design for supporting systems in our Data Center.\n\n\nThe Cloud Operations Resilience Engineering (CORE) Technology division is responsible for enabling and evolving Capital One’s foundational cloud infrastructure layer, including observability, connectivity, resilience and availability.\n\n**Primary Responsibilities:**\n\n* Server support coverage for operating systems (VMWare, AIX, Linux, Windows 2008, Windows 2012, Window 2016\\)\n* Hardware maintenance and inventory\n* Work with cross\\-functional teams. Partner with peers to understand areas of opportunity and to provide recommendations and improvements to processes, projects and services\n* Lead a team of technical staff and provide direction as well as leadership\n* Develop reports for audit, security, capacity and design to be shared with upper level management\n* Interact and interface with vendors and negotiate contracts\n* Automate and partner with other teams to resolve incident within the environment\n* Troubleshoot complex environments\n* Deep dive on technical problems and leverage available tools for resolution of complex problems\n* Identify opportunities to improve efficiency and effectiveness\n* Drive automation, self\\-service enablement, operational efficiency\n* On\\-call support when scheduled (24x7\\)\n* An associate whose role requires travel to remote site locations, must be able to drive to site locations within 30 minutes\n\n**Basic Qualifications:**\n\n* High School Diploma, GED or equivalent certification\n* At least 5 years of experience with one of the following: VMWare, AIX, Linux, Windows 2008, Windows 2012, Window 2016\n* At least 3 years of experience in hardware and software support\n\n**Preferred Qualifications:**\n\n* Bachelor’s Degree\n* 5\\+ years of experience in IT Development\n* 1\\+ year of experience with open source or cloud technologies (AWS)\n* 1\\+ year of experience with PHP, Python, Perl or Ruby\n* 1\\+ year of experience with automation/configuration management (Puppet, Chef)\n* Ability to read and interpret Red Hat crash dumps\n* 3\\+ years’ experience supporting Agile delivery organizations\n* 3\\+ years’ experience with white box\n* 3\\+ years’ experience with software defined servers\n* 3\\+ years’ experience with network defined servers\n\n**At this time, Capital One will not sponsor a new applicant for employment authorization, or offer any immigration related support for this position (i.e. H1B, F\\-1 OPT, F\\-1 STEM OPT, F\\-1 CPT, J\\-1, TN, or another type of work authorization)**\n\n  \n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-12-31",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-a01219cf8cc5b21a",
      "title": "Senior Director, Enterprise Risk Management",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=a01219cf8cc5b21a",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/72134148544",
      "location": {
        "country": "US",
        "city": "Richmond",
        "state": "VA"
      },
      "description": "West Creek 3 (12073\\), United States of America, Richmond, Virginia\nSenior Director, Enterprise Risk Management\nDo you want to be part of an organization that’s dedicated to helping Capital One identify, manage and effectively mitigate risk – for our customers, our communities and our associates? As part of Enterprise Risk Management (ERM), you’ll work with talented associates to provide oversight and guidance for our risk assessment programs and our risk and risk mitigation methodology that ensure our businesses effectively manage risk.\n\n\nEnterprise Risk Management is a critical function within the firm’s second line of defense that establishes the bank’s approach to risk management and ensures adherence to strong risk management practices across the organizations. We are seeking a senior leader within our ERM team to lead our Issue and Event Management Program. This leader will ensure that our core capabilities to identify, manage, and resolve Issues and Loss Events are well managed, continuously improving, and identifying insights to improve Risk Management across the Enterprise.\n\n\nThe Senior Director, Enterprise Risk Management will report to the Vice President, Enterprise Risk Management. The leader will be responsible for ongoing management and continuous improvement of the programs within their scope. This includes ensuring that the issue and event management program establishes the appropriate risk management expectations across the firm in alignment with risk management best practices and regulatory expectations. This leader will also develop a vision for future enhancements, particularly in the space of data analysis and root cause analysis, and ensure that this critical work continues to adapt to the changing needs of the organization over time.\n\n\nThe ideal candidate for this role will have strong experience in Risk Management within the financial services industry, ideally with experience across the lines of defense. Top notch problem solving, communication and analytical skills as well as the ability to drive decision\\-making with senior executives across all three lines of defense will be critical to success. Additionally, this candidate will possess significant leadership experience, including leadership of direct teams, program delivery, change management, and influence/collaboration with multiple stakeholders across the organization.\n\n**Responsibilities**\n\n* Ensure effective management and enhancement of the bank’s Issues and Events Programs in alignment with business objectives and stakeholder expectations (including applicable regulatory frameworks)\n* Drive cross\\-functional improvement efforts to the Issue and Event Management Program, including enhancements to enterprise\\-wide practices around Root Cause Analysis\n* Drive proactive analysis and reporting around issues and events to identify enterprise\\-wide themes, trends, and opportunities for improvement\n* Develop and deliver appropriate reporting to senior management and the Board of Directors\n\n**Competencies**\n\n\nThe ideal candidate will be a seasoned risk management professional with strategic leadership skills, and a proven ability to operate effectively in a complex, highly\\-regulated environment. Candidates should have a passion for leading risk management frameworks that improve our ability to be well managed and ensure we have a best in class enterprise risk strategy.\n\n* **Leadership:**\n\n\n\t+ Able to lead a team through change to drive a culture of strong risk management.\n\t+ Highly collaborative, energetic, results\\-oriented, and entrepreneurial in nature.\n\t+ Approaches risk management with a forward lean and an orientation towards innovation.\n\t+ Understands and embraces the power of technology, analytics, and automation to drive error\\-free execution from a second line perspective.\n\n  \n\n\n\n* **Strong Business Judgment:**\n\n\n\t+ Able to employ judgment and experience to make rapid and complex decisions.\n\t+ Able to influence and build consensus among peers and senior leaders leveraging sound logic and intellectual horsepower.\n\t+ Able to identify critical issues and to resolve them quickly.\n\n  \n\n\n\n* **Communication:**\n\n\n\t+ Able to identify critical issues and to resolve them quickly.\n\t+ Exhibits leadership presence with highly developed interpersonal, presentation, and communications skills (written and oral).\n\t+ Communicates easily at all levels of the organization, as well as with external parties including regulators and consultants.\n\t+ Has good knowledge of the regulatory landscape in the financial industry and an ability to interact regularly with the multiple Federal banking regulators with jurisdiction over Capital One.\n\n**Basic Q****ualifications:**\n\n* Bachelor's degree or military experience\n* At least 5 years of risk management experience\n* At least 5 years of experience in financial service\n* At least 5 years of experience in people management\n* At least 5 years experience working with regulatory requirements governing risk management in Financial Services\n\n**Preferred Qualifications:**\n\n* At least 6 years of experience leading risk programs, projects, or initiatives across an organization\n* At least 10 years of experience in financial services / banking\n* At least 8 years of experience in people management\n\n\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-10-30",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-a70cb6e06abea22e",
      "title": "Senior Associate, Experience Design",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=a70cb6e06abea22e",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/69872802784",
      "location": {
        "country": "US",
        "city": "Plano",
        "state": "TX"
      },
      "description": "Plano Town Center (31064\\), United States of America, Plano, Texas\nSenior Associate, Experience Design\nThis is a Hybrid position located in Plano, TX. Relocation to Plano, TX is required if you're not located in the Dallas, TX area.\n\n\nThe Design team at Capital One is at the forefront of enriching our customers’ digital and physical experiences. We champion a thriving environment of collaboration, authenticity and healthy critique, in which we honor diversity of thought, create a culture of belonging, and elevate one another. If you’re an innovator and storyteller who embraces an environment where you can experiment, learn, and change banking for good, we would love to hear from you.\n\n\nWe are currently seeking Experience Designers to closely collaborate with groups of technical software architects, engineers, product managers, and customer success teams to thoughtfully translate complex flows or processes into simple solutions that are easy to use.\n\n\nThese roles could be focused on internal and external users to Capital One.\n\n**Example of Internal User focused work:**\n\n\nBuilding a web application that helps developers create new software to solve complex customer and business needs. Our tool helps teams setup environments, design the infrastructure of their application, automate builds, releases, and testing, and adhere to complex security, legal and risk requirements. All while building not just for new developers but creating a tool powerful enough for a seasoned veteran. It’s a big, complex project that will have very positive impacts on the daily lives of our engineering teams across the company.\n\n**Example of External User focused work:**\n\n\nBuilding applications and products that are focused on the many different stages of the Car Ownership journey. Applications (Native and Web) are focused on supporting Car Dealerships, their customers, those that are either paying off their vehicle loan with Capital One, or someone that is looking to refinance with Capital One.\n\n\nRegardless of the project you would be working on, our ideal candidate has designed apps and/or software \\- at scale \\- and understands the different approach and mindset required to create applications compared to simple websites. Extra points to someone who understands what it takes to develop applications, and has had some experience writing code themselves.\n\n**What You’ll Do:**\n===================\n\n\nYou’ll be asked to handle a variety of responsibilities, including:\n\n**Key Responsibilities**\n------------------------\n\n* Simplifying and translating complex business and software development workflows into easy\\-to\\-use experiences for a technical audience\n* Collaborating with enterprise partners to create new interface and interactions patterns\n* Creating consistent visual conventions across the application\n* Working closely with product and customer success teams to gather and incorporate user feedback and feature requests into the interface\n* Identifying and establishing design needs, requirements, and acceptance criteria\n\n**Collaboration \\& Connection**\n-------------------------------\n\n* Collaborating with software architects and engineers, product managers, and research teams to uncover customer and business needs \\- then translating them into intuitive and engaging digital experiences\n* Participating in translating complex ideas into understandable concepts that evolve and enhance the product interface\n* Advocating for the customer through human centered design methodologies, including: discovery, ideation, sketch sessions, and user testing\n* Supporting design led workshops to engage and build alignment across different partners and teams\n* Championing prioritization of design centered product enhancements grounded in research and analysis\n* Connecting with design community peers by learning, sharing, and teaching\n* Participating in hiring by reviewing resumes, conducting interviews and attending consensus\n\n**Discovery \\& Delivery**\n-------------------------\n\n* Supporting early product definition by working with partners to facilitate discovery sessions that uncover customer pain points and opportunities\n* Demonstrating familiarity with design tools to deliver concepts and enable successful collaboration across teams\n* Contributing to style guides, iconography, and infographics that can be leveraged by teams\n* Participating in end\\-to\\-end product design by:\n\n\n\t+ Working with researchers to understand customer needs and interpreting information into visual forms that are impactful and intuitive\n\t+ Framing problems, determining insights, and defining visual designs to serve customer needs\n\t+ Ideating, sketching, and delivering low to high fidelity prototypes\n\t+ Designing within existing \\- and creating new \\- standards to contribute to our internal design system, best practices, and guidelines\n\t+ Storytelling and presenting visual concepts to various stakeholders\n\t+ Creating high fidelity design assets for acceptance, development, and delivery to market in partnership with technology colleagues\n\n**Basic Qualifications**\n========================\n\n* At least 2 years of experience in User Interface design\n\n**Preferred Qualifications**\n============================\n\n* Bachelor’s degree or military experience\n* Experience designing software or mobile applications, enterprise applications a bonus\n* Experience creating responsive web layouts\n* Experience designing for cross channel experiences\n* Experience creating components and interactive prototypes in Figma\n* Comfortable working with a variety of business partners and delivering outcomes\n* Familiarity with design and prototyping tools, such as Sketch and/or Figma\n* Familiarity with working in an established design system\n* Familiarity with the software development lifecycle and writing code\n* Familiarity with product development from inception to release\n\n\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-09-12",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-961c99dc026c51c8",
      "title": "Audit Manager, Corporate Compliance Audits (Hybrid)",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=961c99dc026c51c8",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/75635702976",
      "location": {
        "country": "US",
        "city": "McLean",
        "state": "VA"
      },
      "description": "Center 1 (19052\\), United States of America, McLean, Virginia\nAudit Manager, Corporate Compliance Audits (Hybrid)**Capital One’s Audit function is a dedicated group of professionals focused on delivering top\\-quality assurance services to the organization’s Audit Committee. Audit professionals are experienced, well\\-trained and credentialed, and operate within a collaborative, agile environment to deliver value\\-added opinions and recommendations. Audit's vision to provide high value, independent, proactive insights, to innovate with technology, and to be a top\\-notch talent destination, creates a dynamic and challenging atmosphere for both personal growth and professional opportunity.**\n\n **Capital One is seeking an energetic, self\\-motivated Audit Manager interested in becoming part of our Dynamic Audit Resourcing Team (DART), an internal staff augmentation team that consists of experienced auditors who are available for rapid deployment on various audit assignments across the department. As a member of DART, the candidate will focus performing professional internal auditing work that involves conducting operational, financial, and compliance audit projects and providing input to the annual audit plan.**\n\n**Responsibilities include:**\n\n* **Plan, perform, and lead large/complex audits at the enterprise level as well as other diverse lines of business and specialty areas.**\n* **Help to implement the team's strategic imperatives/priorities.**\n* **Establish and build working relationships with internal and external management.**\n* **Provide significant input into the development of the annual audit plan.**\n* **Design and perform compliance audit procedures, including identifying and defining issues, reviewing and analyzing evidence, and documenting processes.**\n* **Leverage available data and analytical tools during the planning, fieldwork, and reporting phases of audit delivery.**\n* **Communicate the results of audit projects to management (written reports/oral presentations).**\n* **Manage staff during audit engagements and provide feedback on work performed.**\n\n **Here's what we're looking for in an ideal teammate:**\n\n* **You adapt to change, embrace bold ideas, and are intellectually curious. You like to ask questions and test assumptions.**\n* **You seek to deepen relationships and shared objectives with your business partners to deliver an elevated value proposition and outstanding business results.**\n* **You’re a firm believer that data will only make you a better Auditor. This part will require looking at some data, so you’ll want to ensure that analytics doesn’t scare you off.**\n* **You're a teacher. You have a passion for coaching and investing in the development of your team.**\n* **Lastly, you create energy and an environment that makes it easy to attract, hire, and retain top talent.**\n\n **Basic Qualifications:**\n\n* **Bachelor’s Degree or military experience**\n* **At least 5 years of experience in audit, compliance or risk management in banking, financial services, or consulting industries.**\n* **At least 2 years of experience in leading audit engagements or in project management**\n\n**Preferred Qualifications:**\n\n* **Master’s Degree in Accounting, Master’s Degree in Finance, Master’s Degree in Economics, or Master of Business Administration**\n* **Certified Internal Auditor (CIA), Certified Public Accountant (CPA), Certified Risk Compliance Manager (CRCM) or a relevant certification**\n* **At least 5 years of experience in auditing one of the following areas: consumer compliance, banking or financial services industry, risk management.**\n* **6\\+ years of experience in banking or the financial services industry**\n* **1\\+ years of experience with data analytics tools in support of internal audit**\n* **1\\+ years of experience with privacy compliance in the financial services industry**\n\n **At this time, Capital One will not sponsor a new applicant for employment authorization for this position.**\n\n**This role is hybrid****meaning associates typically spend (3 days per week) in\\-person at one of our offices listed on this job posting.**\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2025-01-06",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-b42347060d875eca",
      "title": "Lead Software Engineer, Full Stack",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=b42347060d875eca",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/72025059984",
      "location": {
        "country": "US",
        "city": "Richmond",
        "state": "VA"
      },
      "description": "West Creek 3 (12073\\), United States of America, Richmond, Virginia\nLead Software Engineer, Full Stack\nDo you love building and pioneering in the technology space? Do you enjoy solving complex business problems in a fast\\-paced, collaborative, inclusive, and iterative delivery environment? At Capital One, you'll be part of a big group of makers, breakers, doers and disruptors, who solve real problems and meet real customer needs. We are seeking **Full Stack Software Engineers**who are passionate about marrying data with emerging technologies. As a Capital One Lead Software Engineer, you’ll have the opportunity to be on the forefront of driving a major transformation within Capital One.\n\n**About the Team:**\n\n\nThis role involves building and supporting Fuse, our in\\-house risk management system. Fuse empowers associates to own and manage risks, controls, issues, and events, seamlessly integrated into processes and tools. The team is a cross\\-functional group of full\\-stack engineers, designers, and product managers, all dedicated to delivering high\\-quality software solutions through close collaboration and innovation.\n\n**What You’ll Do:**\n\n* Lead a portfolio of diverse technology projects and a team of developers with deep experience in distributed microservices, and full stack systems to create solutions that help meet regulatory needs for the company\n* Share your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal \\& external technology communities, mentoring other members of the engineering community\n* Collaborate with digital product managers, and deliver robust cloud\\-based solutions that drive powerful experiences to help millions of Americans achieve financial empowerment\n* Utilize programming languages like **Javascript, Typescript, HTML,CSS, Java, SQL, NgRx, NodeJs, Angular, Open Source RDBMS and NoSQL databases, Splunk, Open Telemetry, Container Orchestration services including Docker and Kubernetes, and a variety of AWS tools and service****s**\n\n**Basic Qualifications:**\n\n* Bachelor’s Degree\n* At least 4 years of experience in software engineering (Internship experience does not apply)\n* At least 1 year experience with cloud computing (AWS, Microsoft Azure, Google Cloud)\n\n**Preferred Qualifications:**\n\n* Master's Degree\n* 7\\+ years of experience in at least one of the following: JavaScript, Java, TypeScript, SQL, Python, or Go\n* 3\\+ years of experience with AWS, GCP, Microsoft Azure, or another cloud service\n* 4\\+ years of experience in open source frameworks\n* 1\\+ years of people management experience\n* 2\\+ years of experience in Agile practices\n\n***At this time, Capital One will not sponsor a new applicant for employment authorization, or offer any immigration related support for this position (i.e. H1B, F\\-1 OPT, F\\-1 STEM OPT, F\\-1 CPT, J\\-1, TN, or another type of work authorization).***\n\n\nThe minimum and maximum full\\-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part\\-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\n\nNew York City (Hybrid On\\-Site): $201,400 \\- $229,900 for Lead Software Engineer\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\n\n\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-10-28",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-7903c99e1a2b0f68",
      "title": "Director, FP&A: Auto Finance Revenue Team",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=7903c99e1a2b0f68",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/68475318032",
      "location": {
        "country": "US",
        "city": "Plano",
        "state": "TX"
      },
      "description": "Locations: TX \\- Plano, United States of America, Plano, Texas\nDirector, FP\\&A: Auto Finance Revenue Team**Director, FP\\&A: Auto Finance Revenue Team**\n----------------------------------------------\n\n\nAs a Director, Financial Analysis in the Auto Finance division, you will work for a forward leaning organization that is actively disrupting the Auto lending industry. The Auto Finance Revenue team helps shape the long\\-term financial trajectory of Capital One’s Auto Finance business. This role will allow you to see all aspects of the business, challenge you to analyze complex data and identify meaningful trends and insights, influence senior executives, and help tell the story of Capital One Auto Finance \\- both internally and externally.\n\n\nYou will be a great fit if you’re looking for a fast\\-paced, dynamic work environment with plenty of exposure to senior leadership. You will manage a team (3\\-4 people) to provide finance oversight for the total division outlook and actuals, present monthly and quarterly financial results to senior finance leadership, and play a critical role during the quarterly earnings calls process for the division.\n\n**Key Responsibilities:**\n\n* Lead a team of associates to develop and manage complex financial forecasting models, analyze \\& explain key drivers of variances compared to expectations.\n* Synthesize and communicate data\\-driven insights to advise finance and business leadership teams on investments, ensuring alignment with strategic plans.\n* Partner cross\\-functionally with the business and analytical functions to assess opportunities.\n* Perform ad\\-hoc analysis to investigate and assess any industry related topics and strategic options.\n* Communicate and influence effectively at the highest levels of the organization.\n\n**A successful candidate will have the following experience and skills:**\n\n* Demonstrated ability to manage and develop a team of 3\\-4 analysts, coaching and mentoring associates with a goal of developing and retaining top talent.\n* Ability to build financial models for forecasting\n* Distilling complex ideas and financial models into actionable insights and recommendations.\n* Capable of setting the right agenda, balancing competing priorities and interfacing with senior leadership.\n* Strong interpersonal skills and ability to lead and operate in a matrixed environment.\n* Balancing analytics and judgment and influencing corporate decision making.\n* Delivering results through sustainable and well\\-managed execution proces**ses.**\n\n**Basic Qualifications:**\n\n* Bachelor's Degree or military experience\n* At least 10 years of experience in financial analysis \\& modeling\n* At least 5 years of experience managing a Financial Planning and Analysis (FP\\&A) team\n\n**Preferred Qualifications:**\n\n* Master’s Degree in Business Administration (MBA), Finance or similar quantitative discipline\n* Chartered Financial Analyst (CFA) license or Certified Public Accountant (CPA) license\n* 3\\+ years of experience building and managing robust financial models within modern infrastructure\n* 3\\+ years of experience managing a Data Analytics or Financial Planning \\& Analysis (FP\\&A) team\n* 2\\+ years of FP\\&A experience managing a full P\\&L in a Lending busine**ss**\n\n**At this time, Capital One will not sponsor a new applicant for employment authorization for this position**\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-08-07",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-a354faf4df0367b9",
      "title": "Principal Associate, Technical Recruiter (Hybrid)",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=a354faf4df0367b9",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/73606939728",
      "location": {
        "country": "US",
        "city": "McLean",
        "state": "VA"
      },
      "description": "Center 3 (19075\\), United States of America, McLean, Virginia\nPrincipal Associate, Technical Recruiter (Hybrid)\nOur Talent Acquisition team is at the forefront of attracting, engaging and retaining great talent that is passionate about changing banking for good. We provide a best\\-in\\-class experience for candidates and hiring teams, and we have fun along the way. Our culture and people are integral to our growth and success. We’re looking for team members with a knack for finding the best of the best – join us and find out how you can help change the way our millions of customers are interacting with their money.\n\n\nCapital One is looking for a Principal Associate to join our Tech Recruiting Team. This is an exciting opportunity to infuse the organization with talent brokers for Capital One. In partnership with your team, you will effectively manage candidates through the recruiting and selection process, provide consulting and guidance to our Talent Acquisition teams and participate in projects that enhance the recruiting experience. You will be passionate about keeping abreast of trends and innovative recruiting techniques that enable us to be a best\\-in\\-class recruitment shop.\n\n**Roles and Responsibilities**\n\n* Partner with hiring managers and business , group or organization leads, and key stakeholders to understand unique talent needs\n* Manage the full lifecycle recruiting process and hiring deliverables. This will include creating compelling position descriptions, sourcing diverse candidate pipelines, marketing Capital One’s talent brand to attract top talent, screening candidates, advising business partners on the recruiting process, and negotiating job offers\n* Candidate management \\- develop and execute sourcing plans to identify and recruit top talent, owning the candidate development process from identification and engagement to offer extension and closing\n* Work cross\\-functionally across a team of high performing recruiters and promote a culture of inspiration, empowerment and inclusion\n* Leverage recruiting data to proactively provide status updates and hiring results to leadership and HR partners\n* Source stellar candidates. Look beyond direct applications and leverage search engines, career sites, recruiting events, and other innovative sourcing techniques to find the best talent in the market\n\n*We recognize that many life paths can contribute to interest in this role. We value all experience, whether gained in a classroom or through other paths, and invite everyone who meets the qualifications**to apply for this role.*\n\n**Basic Qualifications**\n\n* High School Diploma, GED, or equivalent certification\n* At least 3 years of experience in recruiting OR 3 years of experience in human resources OR 3 years of client consulting experience OR a combination of the three\n\n**Preferred Qualifications**\n\n* Professional Human Resources (PHR) certification\n* 4\\+ years of experience in Corporate Recruiting – full life cycle, research, and sourcing\n* 2\\+ years experience consulting with multiple hiring managers at once while developing and enhancing excellent working relationships with those managers and their teams\n* Ability to influence and drive results in a fast\\-paced environment\n* Ability to use innovative techniques to attract and recruit diverse talent\n* Experience in compensation and general HR requirements as related to hiring\n\n*At this time, Capital One will not sponsor a new applicant for employment authorization for this position.*\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-11-26",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-9ef2fb7c37c29e70",
      "title": "DART -Senior Audit Manager, Technology Audit (Hybrid)",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=9ef2fb7c37c29e70",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/72855878496",
      "location": {
        "country": "US",
        "city": "Plano",
        "state": "TX"
      },
      "description": "Plano 3 (31063\\), United States of America, Plano, Texas\nDART \\-Senior Audit Manager, Technology Audit (Hybrid)**Capital One’s Audit function is a dedicated group of professionals focused on delivering top\\-quality assurance services to the organization’s Audit Committee. Audit professionals are experienced, well\\-trained and credentialed, and operate within a collaborative, agile environment to deliver value\\-added opinions and recommendations. Audit's vision to provide high value, independent, proactive insights, to innovate with technology, and to be a top\\-notch talent destination, creates a dynamic and challenging atmosphere for both personal growth and professional opportunity.**\n\n**Capital One is seeking an energetic, self\\-motivated Audit Sr. Manager interested in becoming part of our Dynamic Audit Resourcing Team (DART), an internal staff augmentation team that consists of experienced auditors who are available for rapid deployment on various audit assignments across the department. As a member of DART, the candidate will focus on audits of critical technology functions including cloud\\-based technology implementations, emerging technology, application controls, and cybersecurity risks.**\n\n**Responsibilities:**\n\n* **Proactively monitor assigned audit universe for changing risks and needed updates. Lead continuous monitoring activities and updates to risk assessments, audit universe, and audit plan.**\n* **Direct business unit and project audits across assigned portfolios.**\n* **Review engagement planning documentation and audit programs to ensure adequate coverage of risk and sufficient rationale for audit scope.**\n* **Supervise and coordinate work assignments amongst audit team members. Provide timely feedback, on\\-the\\-job training, and coaching to audit staff and direct reports.**\n* **Establish and maintain good relationships with key business and audit partners. Leverage specialized knowledge and skills, providing management with insight into their area of subject\\-matter focus. Effectively represent internal audit at management meetings, internal forums, and to external organizations.**\n* **Assess relevance of audit findings, potential exposures, materiality, improving or deteriorating trends, and demonstrate awareness of big picture issues. Interpret business priorities, anticipate issues and obstacles, and apply to scope of role.**\n* **Deliver appropriate, succinct and organized information, tailoring communication style to audience. Effectively review and compile relevant, material findings and recommendations into readable and concise audit reports. Communicate complex results and implications, incorporating different perspectives into deliverables.**\n* **Manage timely and quality delivery of multiple tasks, including audits, projects, special assignments, and administrative activities. Self\\-prioritize and independently complete multiple tasks across the team and department. Demonstrate the ability to successfully meet deadlines.**\n\n **Here's what we're looking for in an ideal teammate:**\n\n* **You are a critical thinker who seeks to understand the business and its control environment.**\n* **You believe insight and objectivity are core elements to providing assurance on the effectiveness and efficiency of Capital One’s governance, risk management, and internal control processes.**\n* **You possess a relentless focus on quality and timeliness.**\n* **You adapt to change, embrace bold ideas, and are intellectually curious. You like to ask questions, test assumptions, and challenge conventional thinking.**\n* **You develop influential relationships based upon shared risk objectives and trust to deliver outstanding business impact and elevate Audit’s value proposition.**\n* **You’re a firm believer that a rich understanding of data, innovation, and technology will only make you a better auditor. This will require leveraging the power of data analytics and furthering your technical expertise.**\n* **You're a teacher. You do the right thing and lead by example. You have a passion for coaching and investing in the betterment of your team. You lead through change with candor and optimism.**\n* **You create energy and an environment that fosters trust, collaboration, and belonging, making it easy to attract, hire, and retain top talent.**\n\n**Basic Qualifications:**\n\n* **Bachelor’s Degree or military experience**\n* **At Least 7 years of experience in information technology (operations, software delivery, access management, information security, cloud computing) or technology audit**\n* **At Least 4 years of experience in managing audit engagements, project management or a combination**\n* **At least 1 year experience of people management**\n\n**Preferred Qualifications:**\n\n* **Certified Internal Auditor (CIA), or Certified Information Systems Auditor (CISA)**\n* **9\\+ years of experience in internal or external auditing or risk management or a combination**\n* **4\\+ years of experience in cyber or information security (application security, network security, cyber security, data protection)**\n* **4\\+ years of experience in Banking and/or Financial Services**\n* **2\\+ years of experience in cloud computing and controls (design, operation, risk management, or auditing)**\n* **2\\+ years of experience in analyzing data extracts to identify trends, patterns, and anomalies, including experience in test scripting, coding (writing, reviewing, or assessing) or performing data analysis in support of internal auditing**\n\n **At this time, Capital One will not sponsor a new applicant for employment authorization for this position.**\n\n**This role is hybrid****meaning associates typically spend about half their time (2\\-3 days per week) in\\-person at one of our offices listed on this job posting.**\n\n**Monday and Fridays are enterprise\\- wide virtual work days. Tuesday, Wednesday and Thursday are in\\-person days for associates to spend time together working in our beautifully\\-designed team areas.**\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-11-12",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-d10f9cb543d7ce77",
      "title": "Lead Software Engineer, Full Stack (Python, JavaScript, AWS)",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=d10f9cb543d7ce77",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/74848913936",
      "location": {
        "country": "US",
        "city": "Plano",
        "state": "TX"
      },
      "description": "Plano 1 (31061\\), United States of America, Plano, Texas\nLead Software Engineer, Full Stack (Python, JavaScript, AWS)\nDo you love building and pioneering in the technology space? Do you enjoy solving complex business problems in a fast\\-paced, collaborative, inclusive, and iterative delivery environment? At Capital One, you'll be part of a big group of makers, breakers, doers and disruptors, who solve real problems and meet real customer needs. We are seeking Full Stack Software Engineers who are passionate about marrying data with emerging technologies. As a Capital One Lead Software Engineer, you’ll have the opportunity to be on the forefront of driving a major transformation within Capital One.\n\n\nWhat You’ll Do:\n\n* Lead a portfolio of diverse technology projects and a team of developers with deep experience in distributed microservices, and full stack systems to create solutions that help meet regulatory needs for the company\n* Share your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal \\& external technology communities, mentoring other members of the engineering community\n* Collaborate with digital product managers, and deliver robust cloud\\-based solutions that drive powerful experiences to help millions of Americans achieve financial empowerment\n* Utilize programming languages like JavaScript, Java, HTML/CSS, TypeScript, SQL, Python, and Go, Open Source RDBMS and NoSQL databases, Container Orchestration services including Docker and Kubernetes, and a variety of AWS tools and services\n\n\nBasic Qualifications:\n\n* Bachelor’s Degree\n* At least 4 years of experience in software engineering (Internship experience does not apply)\n* At least 1 year experience with cloud computing (AWS, Microsoft Azure, Google Cloud)\n\n\nPreferred Qualifications:\n\n* Master's Degree\n* 7\\+ years of experience in at least one of the following: JavaScript, Java, TypeScript, SQL, Python, or Go\n* 3\\+ years of experience with AWS, GCP, Microsoft Azure, or another cloud service\n* 4\\+ years of experience in open source frameworks\n* 1\\+ years of people management experience\n* 2\\+ years of experience in Agile practices\n\n*At this time, Capital One will not sponsor a new applicant for employment authorization, or offer any immigration related support for this position (i.e. H1B, F\\-1 OPT, F\\-1 STEM OPT, F\\-1 CPT, J\\-1, TN, or another type of work authorization).*\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-12-20",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-a9544174cc0c130c",
      "title": "Applied Researcher I",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=a9544174cc0c130c",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/73014458592",
      "location": {
        "country": "US",
        "city": "New York",
        "state": "NY"
      },
      "description": "NYC 299 Park Avenue (22957\\), United States of America, New York, New York\nApplied Researcher I\nAt Capital One, we are creating trustworthy and reliable AI systems, changing banking for good. For years, Capital One has been leading the industry in using machine learning to create real\\-time, intelligent, automated customer experiences. From informing customers about unusual charges to answering their questions in real time, our applications of AI \\& ML are bringing humanity and simplicity to banking. We are committed to building world\\-class applied science and engineering teams and continue our industry leading capabilities with breakthrough product experiences and scalable, high\\-performance AI infrastructure. At Capital One, you will help bring the transformative power of emerging AI capabilities to reimagine how we serve our customers and businesses who have come to love the products and services we build.\n\n**Team Description:**\n\n\nThe AI Foundations team is at the center of bringing our vision for AI at Capital One to life. Our work touches every aspect of the research life cycle, from partnering with Academia to building production systems. We work with product, technology and business leaders to apply the state of the art in AI to our business.\n\n **In this role, you will:**\n\n* Partner with a cross\\-functional team of data scientists, software engineers, machine learning engineers and product managers to deliver AI\\-powered products that change how customers interact with their money.\n* Leverage a broad stack of technologies — Pytorch, AWS Ultraclusters, Huggingface, Lightning, VectorDBs, and more — to reveal the insights hidden within huge volumes of numeric and textual data.\n* Build AI foundation models through all phases of development, from design through training, evaluation, validation, and implementation.\n* Engage in high impact applied research to take the latest AI developments and push them into the next generation of customer experiences.\n* Flex your interpersonal skills to translate the complexity of your work into tangible business goals.\n\n**The Ideal Candidate:**\n\n* You love the process of analyzing and creating, but also share our passion to do the right thing. You know at the end of the day it’s about making the right decision for our customers.\n* Innovative. You continually research and evaluate emerging technologies. You stay current on published state\\-of\\-the\\-art methods, technologies, and applications and seek out opportunities to apply them.\n* Creative. You thrive on bringing definition to big, undefined problems. You love asking questions and pushing hard to find answers. You’re not afraid to share a new idea.\n* A leader. You challenge conventional thinking and work with stakeholders to identify and improve the status quo. You’re passionate about talent development for your own team and beyond.\n* Technical. You’re comfortable with open\\-source languages and are passionate about developing further. You have hands\\-on experience developing AI foundation models and solutions using open\\-source tools and cloud computing platforms.\n* Has a deep understanding of the foundations of AI methodologies.\n* Experience building large deep learning models, whether on language, images, events, or graphs, as well as expertise in one or more of the following: training optimization, self\\-supervised learning, robustness, explainability, RLHF.\n* An engineering mindset as shown by a track record of delivering models at scale both in terms of training data and inference volumes.\n* Experience in delivering libraries, platform level code or solution level code to existing products.\n* A professional with a track record of coming up with high quality ideas or improving upon existing ideas in machine learning, demonstrated by accomplishments such as first author publications or projects.\n* Possess the ability to own and pursue a research agenda, including choosing impactful research problems and autonomously carrying out long\\-running projects.\n\n**Basic Qualifications:**\n\n* Currently has, or is in the process of obtaining, a PhD, with an expectation that required degree will be obtained on or before the scheduled start date or M.S. with at least 2 years of experience in Applied Research\n\n **Preferred Qualifications:**\n\n* PhD in Computer Science, Machine Learning, Computer Engineering, Applied Mathematics, Electrical Engineering or related fields\n* LLM\n\n\n\t+ PhD focus on NLP or Masters with 5 years of industrial NLP research experience\n\t+ Multiple publications on topics related to the pre\\-training of large language models (e.g. technical reports of pre\\-trained LLMs, SSL techniques, model pre\\-training optimization)\n\t+ Member of team that has trained a large language model from scratch (10B \\+ parameters, 500B\\+ tokens)\n\t+ Publications in deep learning theory\n\t+ Publications at ACL, NAACL and EMNLP, Neurips, ICML or ICLR\n* Optimization (Training \\& Inference)\n\n\n\t+ PhD focused on topics related to optimizing training of very large deep learning models\n\t+ Multiple years of experience and/or publications on one of the following topics: Model Sparsification, Quantization, Training Parallelism/Partitioning Design, Gradient Checkpointing, Model Compression\n\t+ Experience optimizing training for a 10B\\+ model\n\t+ Deep knowledge of deep learning algorithmic and/or optimizer design\n\t+ Experience with compiler design\n* Finetuning\n\n\n\t+ PhD focused on topics related to guiding LLMs with further tasks (Supervised Finetuning, Instruction\\-Tuning, Dialogue\\-Finetuning, Parameter Tuning)\n\t+ Demonstrated knowledge of principles of transfer learning, model adaptation and model guidance\n\t+ Experience deploying a fine\\-tuned large language model\n\n***Capital One will consider sponsoring a new qualified applicant for employment authorization for this position***\n\n\nThe minimum and maximum full\\-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part\\-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\n\nSan Francisco, California (Hybrid On\\-site):  \n\n$243,700 \\- $278,100 for Applied Researcher I  \n\nSan Jose, California (Hybrid On\\-site):  \n\n$243,700 \\- $278,100 for Applied Researcher I  \n\nNew York City (Hybrid On\\-site):  \n\n$230,000 \\- $262,500 for Applied Researcher I\n\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\n\n\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-11-15",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-b9c30f38d9a2a075",
      "title": "Sr. Manager Data Analyst - Enterprise Supplier Management",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=b9c30f38d9a2a075",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/71804793824",
      "location": {
        "country": "US",
        "city": "Richmond",
        "state": "VA"
      },
      "description": "West Creek 7 (12077\\), United States of America, Richmond, Virginia\nSr. Manager Data Analyst \\- Enterprise Supplier Management\nAt Capital One, data is at the center of everything we do. When we launched as a startup we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast\\-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data\\-driven decision\\-making.\n\n\nCapital One spends over $10B annually, and the ESM organization is critical to managing the impact, risk, and cost savings associated with all of it. The Data Analytics team within the Enterprise Supplier Management (ESM) organization is invested in unifying and publishing Party data (suppliers and other entities) from across Capital One, and we are seeking a Senior Manager of Data Analytics to blend deep analysis, master data management, and stratetic thinking to deliver authoritative Party data to be used across the ESM organization and beyond.\n\n\nAs a Senior Manager, you will partner cross\\-functionally with teams throughout the company to validate business impacting analytical tools. You will enhance your technical and analytical skills, while also working with leaders to influence business strategies. With a network of hundreds of Data Analysts, Quants, and Data Scientists, challenging projects with an eye on the bottom line and a focus on work/life balance, we’ve created a dynamic environment with plenty of room for you to learn, grow, and realize your full potential.\n\n  \n\nOn a given day you will be:\n\n* Refining a new Enterprise\\-wide analytical tools validation framework\n* Planning and executing validation projects\n* Assessing the quality and risk of analytical tool methodologies across Capital One, and the nature of tools usage within those processes\n* Understanding technical issues in analytical tools and assessing tools risks and opportunities\n* Independently researching, identifying, and prototyping industry best practices for emerging analytical tools\n* Communicating results clearly and concisely both verbally and through written communications via validation reports and presentations\n* Leveraging education, colleagues and training opportunities to develop solutions to business problems\n* Coaching and mentoring junior staff\n\n  \n\nAn ideal candidate will possess strong problem solving and conceptual thinking abilities in addition to communication, interpersonal and leadership skills. This position will be in a fast\\-paced and entrepreneurial environment where you will be handling multiple concurrent projects while working independently and in teams.\n\n  \n\nBasic Qualifications:\n\n* Currently has, or is in the process of obtaining a Bachelor's Degree plus at least 7 years of experience in data analytics, or currently has, or is in the process of obtaining a Master’s Degree plus at least 5 years of experience in data analytics, or currently has, or is in the process of obtaining a PhD plus at least 2 years of experience in data analytics with an expectation that required degree will be obtained on or before the scheduled start date.\n* At least 5 years of experience with professional data analysis work experience\n* At least 2 years leading and developing with open source data technologies\n* At least 2 years of experience in people management\n\n  \n\nPreferred Qualifications:\n\n* Master’s Degree or PhD in a Finance, Economics, Statistics, Mathematics, Industrial Engineering, Operations Research, or a related field\n* At least 7 years of experience in statistical or econometrics hands\\-on work\n* At least 5 years of experience manipulating and performing analysis with large data sets\n* At least 5 years of experience in financial services industry\n* At least 5 years of experience in developing statistical or econometric models\n* At least 5 years of experience in validating statistical or econometric models\n* At least 2 years of experience with data governance\n* At least 2 years of experience with predictive analytics\n\n  \n\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position.\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-10-24",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-58000abaf9a3e4c4",
      "title": "Relationship Manager, Business Cards & Payments - Acquisitions (Syracuse)",
      "company_name": "Capital One",
      "job_url": "https://www.indeed.com/viewjob?jk=58000abaf9a3e4c4",
      "job_url_direct": "https://www.capitalonecareers.com/job/-/-/1732/74778941632",
      "location": {
        "country": "US",
        "city": "Syracuse",
        "state": "NY"
      },
      "description": "Locations: Sales \\- NY \\- Syracuse, United States of America, Syracuse, New York\nRelationship Manager, Business Cards \\& Payments \\- Acquisitions (Syracuse)**Relationship Manager, Business Cards \\& Payments (Acquisitions)**\n\n**Territory****:** Syracuse, NY\n\n\nAre you a self\\-starter, a go\\-getter, and a deal maker? Are you disciplined and autonomous? In **Capital One’s Business Cards \\& Payments** group, you will find a culture that expects and rewards excellence. We believe in unlocking the power of people and equipping them to do great things! We are looking for like\\-minded people who can share our passion for success and a high sense of urgency to deliver on customer needs.\n\n\nOur **Field Sales teams** works with Small and Mid\\-Sized Business owners to create long term, meaningful relationships to better understand their business and their entire B2B wallet. Through a consultative approach, we are able to help small and mid\\-sized business owners identify the right products to optimize the rewards and benefits they receive.\n\n\nWe are committed to helping customers leverage our tools to lower the stress of financial management and increase the profitability of the bottom line. We aspire to become a trusted advisor, an informed teacher, and a concierge to guide and improve the confusing experience of owning, managing, and growing a small and mid\\-sized business.\n\n\nTo do this we must be accessible, we must be as dynamic and adaptive as their lifestyle is, and we must be present in the lives of these customers. So we have committed to building field\\-based regional teams that engage small and mid sized businesses in their own communities and on their terms.\n\n\nYou will be instrumental in assisting small and mid\\-size businesses to thrive and to grow. The ideal candidate will have an entrepreneurial spirit and serve as an advocate for our customers. They will be innovative, highly organized, and have a measurable, demonstrated ability to drive business results while delivering superior service to our customers. Independent, results\\-driven, goal\\-oriented, self\\-starters will thrive within our organization. You will be responsible for identifying and building new business opportunities in your assigned territory. This individual will be responsible for multiple aspects of the sales cycle: building a go\\-to\\-market business plan, identifying and qualifying leads, cold\\-calling c\\-suite executives to set new appointments, assessing the needs of potential customers using a consultative approach, working with underwriting to evaluate risk, and driving new account engagement. This person needs to be process\\-oriented and highly organized. You will be expected to disrupt prospects’ thinking and deliver solutions that transform their businesses.\n\n**General Responsibilities:**\n\n* Use insight and consultative selling techniques to teach prospective customers how they can leverage payment solutions (purchasing, travel, and electronic account payable) to positively impact their business\n* Learn about local small and mid\\-sized businesses and their purchasing needs and behavior\n* Analyze the small and mid\\-sized business’s total business spend to identify additional opportunities to leverage our products and services\n* Build broad and technical product knowledge and an understanding of how client\\-side processes should work with our products and services\n* Assist the business with incorporating our products into their purchasing platform and bookkeeping software\n* Maintain and update CRM systems regarding sales calls, pipelines and closed sales to ensure data compliance\n* Acquire net new customers by **cold call prospecting**; this is not a referral sales model\n* Initiate and participate in educational and/or networking events\n* Establish relationships with “Centers of Influence” in order to engage with the local small and mid\\-sized business community\n* Drive incremental charge volume on the card with new clients\n\n**Competencies:**\n\n* Project and process management, interpersonal influence, networking, project ownership, and workflow management skills\n* Excellent needs\\-based oral presentation skills\n* Ability to secure appointments directly with clients and new prospects\n* Strong organizational, interpersonal, telephone and PC Skills\n* Proven experience **hunting** for **net new business selling** in the field\n\n**Basic Qualifications:**\n\n* At least 3 years of sales experience\n\n**Preferred Qualifications:**\n\n* Bachelor's Degree\n* 5 years of outside customer sales experience as an individual contributor, driving new acquisition as well as managing a client portfolio\n* 1 year of experience working with small and mid\\-sized business Customers\n* 1 year of experience in the financial industry\n* Proficiency using Salesforce.com\n* Proficiency using Google Suite (Docs, Sheets, Slides, Gmail)\n\n**At this time, Capital One will not sponsor a new applicant for employment authorization for this position.**\n\n\nThe minimum and maximum full\\-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part\\-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\n\nSales Territory: $105,000 \\- $105,000 for Relationship Manager\n\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\n\n\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well\\-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part\\-time status, exempt or non\\-exempt status, and management level.\n\n\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug\\-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23\\-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901\\-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1\\-800\\-304\\-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n\nCapital One does not provide, endorse nor guarantee and is not liable for third\\-party products, services, educational tools or other information available through this site.\n\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "company_url": "https://www.indeed.com/cmp/Capital-One",
      "company_url_direct": "https://www.capitalonecareers.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-12-19",
      "emails": [
        "RecruitingAccommodation@capitalone.com",
        "Careers@capitalone.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Mc Lean, VA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Help change banking for good while getting opportunities, support and benefits you need.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/231e72fed9b08e7f098ab59080cc2dd6",
      "banner_photo_url": null,
      "job_function": null
    }
  ]
}