{
  "company_name": "Intermountain_Health",
  "sector": "Healthcare",
  "sample_size": 20,
  "total_jobs_available": 1267,
  "jobs": [
    {
      "id": "in-86c7b401e127cde5",
      "title": "Population Health Network Manager",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=86c7b401e127cde5",
      "job_url_direct": "https://click.appcast.io/track/lkckqna-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Broomfield",
        "state": "CO"
      },
      "description": "**Job Description:**\n\n\nThe Population Health Network Manager provides a lead role in overseeing the development and management of our population health network. Responsible for building relationships with clinic organization leaders, healthcare providers, payers, and community organizations to improve patient outcomes and reduce healthcare costs through execution of population health management strategies. Oversees and coordinates the work of various groups throughout the network. Ensures access to data, resolves client concerns, holds clinic organizations accountable, and builds engagement and loyalty.**Position Details:**  \n\n  \n\nThis Position is within Trinsic, a joint venture ACO between UCHealth and Intermountain Health. This role will work Monday\\-Friday during regular business hours. This is a remote/hybrid position, with some travel up and down the Colorado front range to Steamboat required.  \n\n\n\n\n  \n\n**Essential Functions:**\n\n* Builds and maintains effective business relationships with network partners to facilitate timely and accurate exchange of information and data necessary for effective population health management and meeting network partner needs\n* Facilitates deployment of new and existing payer contracts with network partners. Recruits new community partners to risk arrangements.\n* Educate groups about population health products, strategies, and how to be successful in various payment models, including education about risk adjustment, cost, and quality topics\n* Reviews performance reports with clinic leaders and providers relevant to their practices and identify areas of opportunity and navigate data tools to monitor and analyze population health data to identify trends, develop strategies to address gaps in care, and provide solutions for actionable clinic and provider opportunities.\n* Leads and facilitates implementation of Population Health services in collaboration with team members and partnerships.\n* Manages the development, maintenance, and distribution of materials that assist clinicians and their teams to interface more efficiently with the administrative processes.\n* Collaborates with internal stakeholders to identify and implement population health initiatives that align with the organization's goals and objectives.\n\n **Minimum Qualifications:**\n\n* Bachelor's degree in a business\\-related field. Degree must be obtained through an accredited institution. Education is verified OR Five years of experience in a management or a professional level position..\n* Demonstrated experience managing a program or team in a professional level position.\n* Excellent communication and interpersonal skills, with the ability to build and maintain relationships with internal and external stakeholders.\n* Demonstrated ability to manage projects and teams, with a focus on achieving goals and objectives within established timelines and budgets.\n* Knowledge of healthcare regulations and compliance requirements related to population health management.\n* Outpatient clinic experience either as front office or clinical preferred.\n**Physical Requirements:**\n\n**Location:**\n\n\nPeaks Regional Office**Work City:**\n\n\nBroomfield**Work State:**\n\n\nColorado**Scheduled Weekly Hours:**\n\n\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$37\\.98 \\- $58\\.61\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 37.0,
        "max_amount": 58.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-09",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-0e7c4815eff28d49",
      "title": "Urologist (Urology)",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=0e7c4815eff28d49",
      "job_url_direct": "https://click.appcast.io/track/kv27m45-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Richfield",
        "state": "UT"
      },
      "description": "**Job Description:**\n\n\nIntermountain Medical Group\n  \n\nUrology  \n\nSevier Valley Hospital  \n\nIntermountain Health is a team of caregivers who serve the healthcare needs of people across the Intermountain West, primarily in Utah, Idaho, Montana, Colorado, Kansas and Nevada. We are an integrated, not\\-for\\-profit health system based in Salt Lake City, Utah, with clinics, three medical groups, affiliate networks, hospitals, homecare, telehealth, health insurance plans, and other services, along with wholly owned subsidiaries including SelectHealth, SCL, and Intermountain Health in Nevada.  \n\n* 33 Hospitals (including 1 virtual hospital), 4,700 licensed beds\n* 385 Clinics\n* Telehealth in 7\\+ states\n\n\n  \n\nWhat does it mean to be a part of Intermountain Health? It means that the quest for clinical excellence is not just a goal, but a given. It means building an environment where physicians and employees can deliver the best in healthcare. And it’s realizing each employee or volunteer is vital to the healing process, because we can only achieve the extraordinary together. Being a part of Intermountain Health means joining with a world\\-class team of over 3,800 clinicians and 60,000 employees and embarking on a career filled with opportunities, strength, innovation, and fulfillment.\n  \n\n  \n\nIntermountain is viewed as a leader in transforming healthcare through high quality and sustainable costs. According to Becker’s ASC Review, “Utah is in the top 5 best places for physicians to work.” (May 24, 2021 Print \\| Email).  \n\n  \n\nOur mission is: Helping people live the healthiest lives possible®\n(Urology)\n\n**Practice Information**\n\n* We are seeking a urologist to replace a retiring physician and join a team of five surgeons. Candidates must be board\\-certified or board\\-eligible in urology.\n* Employment is with the Intermountain Health Medical Group\n\n**Requirements**\n\n* Board Certified/ Board Eligible in Urology\n* Unrestricted Utah MD or DO license or the ability to obtain an unrestricted license\n* U.S. ACGME Residency\n\n**Benefits:**\n\n* Competitive salary and additional income for meeting system quality goals\n* CME allowance\n* Relocation assistance provided, up to 20K\n* 401(k) with up to 6% employer contribution\n* Various insurance options through Select Health, Intermountain’s insurance company\n* Onsite fitness centers and discounts to local gyms\n* LiVe Well caregiver incentive program – up to $300 per year\n* Employee Assistance Program (EAP) – including free counseling for caregivers and their immediate family\n* Over 302,000 discount offers across 10,000 cities on everything from movie tickets, pizza and the zoo to car rentals and hotels\n* A 501c3 company; Joint Commission accredited\n\n**Community Information:**\n\n\nRichfield is a city full of vitality and vigor! With a population of just over 7,000 people and a drawing area of 38,000 the community has all the benefits of a small town, yet continues to grow and progress with time. It lies in a valley surrounded by beautiful red rock mountains and snow covered peaks. With great schools, access to skiing, fishing, rock climbing, horseback riding, camping, mountain biking, ATV riding and golfing the area has something for everyone. Within a 3 hours’ drive you can visit any of 5 national parks or be in Salt Lake City to attend a Utah Jazz basketball game or Utah Symphony performance. Office space is located on the Sevier Valley Medical Center campus that provides the county with 24\\-hour Emergency service. The hospital's medical staff consists of eight doctors in Family Practice, 2 in General Surgery, and 1 in Radiology. The 3 OR’s (with the ability to add a fourth one) are equipped for laparoscopic, lasers and open procedures. The hospital is financially secure and ready to grow.\n\n**Physical Requirements:**\n\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. Women, minorities, individuals with disabilities, and veterans are encouraged to apply.\n\n**Anticipated job posting close date:**\n\n\n02/11/2026**Location:**\n\n\nSevier Valley Hospital**Work City:**\n\n\nRichfield**Work State:**\n\n\nUtah**Scheduled Weekly Hours:**\n\n\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$7\\.25 \\- $999\\.99\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-12-05",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-918275fd99cb5afc",
      "title": "Advanced Practice Provider Hospitalist",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=918275fd99cb5afc",
      "job_url_direct": "https://click.appcast.io/track/lf12cdj-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Provo",
        "state": "UT"
      },
      "description": "**Job Description:**\n\n\nThis position is accountable for the provision of patient care and other activities as permitted by licensure and defined within Credentialing and Privileging documentation (hospital), Credentialing and Scope of Practice (Medical Group), Consultation and Referral Plan (DOPL) or other similar documentation as appropriate. As part of that patient care, this position is accountable to: deliver optimal patient care through effective clinical practice; education of the patient, patient's family, clinical staff, and others; consultation with other healthcare providers; and maintain current knowledge regarding options for optimal patient care and outcomes.**Advanced Practice Provider\\- Part Time Hospitalist**\n\n**Position Title:** Hospitalist Advanced Practice Provider (APP)\n\n**Location:** Utah Valley Hospital\n\n**Department:** UVH Hospitalist\n\n**Position Type:** 0\\.5 FTE\n\n**Work Schedule:** swing shifts, including weekends and holidays\n\n **Job Description Summary**\n\n  \n\nWe are a rapidly expanding team of Hospitalist physicians and advanced practice providers committed to clinical quality improvement and ensuring patients receive the highest quality care at an affordable cost.\n\n\nThe Hospitalist Advanced Practice Provider (APP) will play a critical role in the management of hospitalized patients, with a primary focus on those on general medicine floors. The APP will work collaboratively with attending physicians, tele\\-critical care, nursing staff, and other healthcare professionals to provide comprehensive care to adult patients, ensuring high\\-quality, patient\\-centered outcomes.\n\n\nAs an Intermountain Health Advanced Practice Provider, you will be eligible for the following benefits prorated for a part time FTE:\n\n* Health benefits including medical, dental, vision, HSA or FSA, etc.\n* 401K\n* Paid Time Off\n* Shift differential Pay\n* CME Time and Stipend\n\n **Key Responsibilities:**\n\n* Manage acute and chronic medical conditions, including initiating appropriate diagnostic and therapeutic interventions while practicing efficient and judicious use of hospital and healthcare resources.\n* Conduct comprehensive assessments, including history and physical examinations, review of labs, vitals and medication reconciliations.\n* Develop, implement, and evaluate treatment plans with collaborating physicians.\n* Attend Multidisciplinary Rounds; work with multidisciplinary teams, including consulting physicians, nurses, case management, respiratory therapists, and pharmacists, to ensure coordinated patient care, provide input on patient management, care plans and discharge planning.\n* Promote effective communication among patients, families, and healthcare teams, ensuring that patients and their families are well\\-informed and actively involved in care decisions. Offer education and support to patients, families, and healthcare staff on disease processes, treatment plans, and care transitions.\n* Maintain accurate and timely documentation of patient encounters, including history and physical, progress notes and discharge summaries in the electronic health record (EHR) system. Ensure that records are detailed, complete and comply with hospital policies, regulatory requirements, and best practice standards.\n* Engage in quality improvement initiatives within the hospitalist program and the hospital. Participate in hospital committees, task forces, and meetings as required.\n* Using quality and process improvement techniques and practices to make the hospital a safer place and improve patient outcomes. Stay abreast of current trends in healthcare practice and participate in continuing medical education to ensure optimal clinical knowledge and effective patient care skill. Knowledge of core competencies of clinical conditions.\n\n**Physical Requirements:**\n\n**Qualifications**\n\n* **Education:**\n\t+ Master's or Doctorate degree in Nursing (MSN, DNP) or Physician Assistant Studies from an accredited program.\n* **Licensure/Certification:**\n\t+ Current licensure as a Nurse Practitioner (NP) or Physician Assistant (PA) in Utah\n\t+ Board certification as an Acute Care Nurse Practitioner (ACNP), Adult\\-Gerontology Acute Care Nurse Practitioner (AG\\-ACNP), or Physician Assistant (PA\\-C).\n\t+ DEA Certificate II through V \\- DOJ Drug Enforcement Division\n\t+ ACLS and BLS certification required; additional critical care certifications (e.g., FCCS, CCRN) preferred.\n* **Experience:**\n\t+ Prior Hospital based experience as an APP preferred.\n* **Skills and Abilities:**\n\t+ Strong clinical decision\\-making and critical thinking skills.\n\t+ Ability to work independently and as part of a team in a fast\\-paced, high\\-acuity environment.\n\t+ Excellent communication, interpersonal, and organizational skills.\n\t+ Commitment to patient\\-centered care and continuous improvement.\n\t+ Proficiency in handling acute and emergent medical situations.\n\n**Physical Requirements:**\n\n* Ability to work in a hospital environment, which may involve exposure to infectious diseases and high\\-stress situations.\n* Ongoing need for employee to see and read information, labels, assess patient needs, operate monitors, identify equipment and supplies.\n* Frequent interactions with patient care providers, patients, and visitors that require employee to verbally communicate as well as hear and understand spoken information, alarms, needs, and issues quickly and accurately, particularly during emergency situations.\n* Manual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use and typing for documenting patient care, accessing needed information, medication preparation, etc.\n* May be expected to stand in a stationary position for an extended period of time.\n\n**Location:**\n\n\nIntermountain Health Utah Valley Hospital**Work City:**\n\n\nProvo**Work State:**\n\n\nUtah**Scheduled Weekly Hours:**\n\n\n20\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$49\\.86 \\- $76\\.93\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "parttime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 49.0,
        "max_amount": 76.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-17",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-4054ee18d574cc4a",
      "title": "Supervisor Pharmacy Inpatient",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=4054ee18d574cc4a",
      "job_url_direct": "https://click.appcast.io/track/lh1sviu-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Billings",
        "state": "MT"
      },
      "description": "**Job Description:**\n\n\nResponsible for the leadership and direction of a specific operational team. Facilitates efforts to ensure excellent customer service on the team including the removal of barriers that impede excellent customer service as well as develop best practices in the department.**Scope**\n\n*Initially, 4 x 10s (variable shifts), occasional weekends and nights*\n\n  \n\nAs a Pharmacy Supervisor you need to know how to\n\n* Supervise the patient care and operations of the department. Collaborates with the department leadership team to evaluate service needs and volumes and adjust staffing levels accordingly. Assigns daily work schedules. Acts as a resource in the daily operations and activities of the department. Performs pharmacist duties as required.\\-\n* Develop, direct, and coordinate training of new and existing associates. Ensures associate competency. Oversees supply and equipment inventory to maintain optimal supply levels and ensure equipment repairs and preventative maintenance occur in a timely manner.\\-\n* Support the department leadership team in problem solving to address issues relating to patient safety, care and service. Promotes effective working relations and works effectively as part of a department/unit team and interdepartmentally to facilitate that departments ability to meet its goals and objective. Ensures coordination of care with other departments to promote the highest level of patient care and satisfaction.\n* Assist with Human Resource management functions including interviewing, selection, orientation, education/training, feedback, performance evaluation, and policy and procedure development. Assists in updating and maintaining personnel files. Maintains and monitors Kronos records for employees. Presents and documents staff meetings as required. Assists in development of capital planning and operating budgets.\\-\n* Collaborate with the care site leadership team to identify and drive quality and performance improvement initiatives. Ensures compliance with applicable regulatory guidelines and established departmental policies and procedures, objectives, quality assurance program, safety, environmental and infection control standards.\n* Maintain competency to practice as a clinical pharmacist and provides staffing or clinical care as required to support department operations for up to 80% of scheduled hours.\n\n\n.  \n\n**Minimum Qualifications**\n\n* Graduate of an accredited College of Pharmacy with a five\\-year Bachelor of Science Degree or Pharm D\n* Current Licensure by the state of practice in Pharmacy\\- Board certification in pharmacy practice or other recognized BPS, informatics, or other pertinent specialty.\n\n**Preferred:**\n\n* MTM (Medication Therapy Management) certification\\- Current BLS and ACLS certification endorsed by the American Heart Association\\- Immunization certification\\- Previous leadership experience\n\n**Physical Requirements:**\n\n\nHearing/listening, lifting, manual dexterity, pulling/pushing, seeing, sitting, speaking, squatting/kneeling, standing, and walking.**Location:**\n\n\nIntermountain Health St Vincent Regional Hospital**Work City:**\n\n**Work State:**\n\n**Scheduled Weekly Hours:**\n\n\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-12-26",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-9330034ea26475f3",
      "title": "Lactation Registered Nurse Specialist PRN",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=9330034ea26475f3",
      "job_url_direct": "https://click.appcast.io/track/liyug2n-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Lafayette",
        "state": "CO"
      },
      "description": "**Job Description:**\n\n\nThe Registered Nurse (RN) is a professional caregiver who assumes responsibility and accountability for assessing, planning, implementing and evaluating care of patients. The staff RN utilizes the nursing process by use of technology, therapeutic intervention, evidence\\-based practice and coordination of care with other health team members.\nScope  \n\n  \n\n1\\.Assesses, plans, implements and evaluates breastfeeding management for patients ininpatient and outpatient settings by utilizing the nursing process. Provides holistic, evidence\\-based breastfeeding support and care from preconception to weaning for women and their families. Acts as advocate for breastfeeding as the child\\-feeding norm.  \n\n2\\. Provides support for patients, proactively suggests strategies for breastfeeding, and addresses patient issues and concerns.  \n\n3\\. Conducts prenatal breastfeeding classes and evaluates educational outcomes. Delivers appropriate education for patient and patient support/family.  \n\n4\\. Provides outpatient care, consultation and home visits for families experiencing breastfeeding difficulties.  \n\n5\\. Acts as clinical expert/resource for staff on subjects related to lactation including the current standards of practice. Facilitates the development of policies which protect, promote, and support breastfeeding.  \n\n6\\. Participate in the development of educational programs and assess the educational needs of health care providers.  \n\n7\\. Promotes mission, vision, and values of SCL Health, and abides by service behavior standards.  \n\n8\\. Performs other duties as assigned.  \n\n9\\. May be required to float to other departments (within scope of competency and qualifications) based on business need.  \n\n10\\. May be required to be placed on\\-call during a regularly scheduled shift.  \n\n  \n\nMinimum Qualifications\n\n**Education**\n\n\nRequired:\n\n\nGraduation from an accredited School of Nursing is required.\n\n\nA Registered Nurse with an ASN/ADN degree must complete a BSN degree within four (4\\) years from the Registered Nurse’s date of hire unless the Registered Nurse has a minimum of fifteen (15\\) years of proven continuous Registered Nurse experience in an acute care setting. Failure to obtain a BSN degree within that time frame may result in suspension or termination of employment. Any Registered Nurse who takes legally protected leave during the Four (4\\) year completion period may have the period extended by a comparable amount of time.\n\n\nRegistered Nurses employed by St Vincent, Good Samaritan, St. Joseph, or Lutheran Medical Centers as of September 1, 2014 with only an ASN/ADN will be exempt from this requirement. Registered Nurses employed by Holy Rosary, Platte Valley, St. Mary’s, Home Health, and TSFP as of December 31, 2017 with only an ASN/ADN will be exempt from this requirement.\n\n**Certification**\n\n\nRequired:\n\n\nCurrent license as a Registered Nurse in the state of practice is required.\n\n\nCurrent American Heart Association Basic Life Support for Healthcare Providers (BLS\\-HCP) certification upon hire or obtained within 60 days of hire with prior approval. (ACLS/NRP/PALS as appropriate for unit or service.)\n\n  \n\nPreferred  \n\nBachelor's degree of Nursing is preferred  \n\nIBCLC certification is preferred  \n\nTwo years of recent maternal/child nursing experience is preferred  \n\n  \n\nTo perform this job successfully, an individual must be able to perform each essential dutysatisfactorily. The requirements list must be representative of the knowledge, skills, minimum education, training, licensure, experience, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  \n\n1\\. Regular attendance to perform work on site during regularly scheduled business hours or scheduled shifts is required.  \n\n2\\. Ability to work nights and/or weekends is required for identified positions.\n\n**Physical Requirements:**\n\n\nOngoing need for employee to see and read information, labels, assess patient needs, operate monitors, identify equipment and supplies.\\- and \\-Frequent interactions with patient care providers, patients, and visitors that require employee to verbally communicate as well as hear and understand spoken information, alarms, needs, and issues quickly and accurately, particularly during emergency situations.\\- and \\-Manual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use and typing for documenting patient care, accessing needed information, medication preparation, etc.\\- and \\-Expected to lift and utilize full range of movement to transfer patients. Will also bend to retrieve, lift, and carry supplies and equipment. Typically includes items of varying weights, up to and including heavy items.\\- and \\-Need to walk and assist with transporting/ambulating patients and obtaining and distributing supplies and equipment. This includes pushing/pulling gurneys and portable equipment, including heavy items. Often required to navigate crowded and busy rooms (full of equipment, power cords on the floor, etc).\\- and \\-May be expected to stand in a stationary position for an extended period of time.**Location:**\n\n\nGood Samaritan Hospital**Work City:**\n\n\nLafayette**Work State:**\n\n\nColorado**Scheduled Weekly Hours:**\n\n\n0\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$34\\.19 \\- $50\\.73\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "parttime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 34.0,
        "max_amount": 50.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-04",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-686316074bcea7fc",
      "title": "Culinary Diet Tech",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=686316074bcea7fc",
      "job_url_direct": "https://click.appcast.io/track/lko4zt3-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Saint George",
        "state": "UT"
      },
      "description": "**Job Description:**\n\n\nThe Culinary Diet Tech provides nutrition services to patients under. This position interacts with clinical caregivers, patients, and patient’s family members to explain the meal process.\nJob Essentials\n\n* Assists in meal selection for patients as established by standard guidelines\n* Records and modifies patient meal orders based on physician diet orders and Intermountain Modified Diet Guideline\n* Works with the clinical team to provide excellent patient care\n* Uses technology and meal ordering platform to facilitate the nutrition care process and needed departmental reports\n* Communicates patient needs to room service assembly area\n* Collects and inputs nutrition screening information\n* Performs functions of room service call center and Bedside Connect\n* Provides exceptional customer service in all customer and patient interactions\n* May complete calorie count and nutrition analysis as dictated by facility\n* May check and verify that patients receive appropriate meal selections on the room service line\n* May deliver patient trays according to department policy to provide safe and efficient meal service\n* Other duties as assigned\n\n  \n\nMinimum Qualifications\n\n* Food handler's permit (as required by facility. Remote workers may be exempt from this requirement).\n* Demonstrated good communication and interpersonal skills.\n* Demonstrated decision making and problem\\-solving skills.\n* Demonstrated basic computer skills and keyboarding proficiency.\n* Demonstrated math skills.\n* Demonstrated ability to transcribe information quickly and accurately.\n\n  \n\nPreferred Qualifications\n\n* Food service or healthcare experience.\n* Coursework in Nutrition\n\n**Physical Requirements:**\n\n\nPhysical Requirements\n\n* Interact with patients and co\\-workers requiring the employee to verbally communicate information, as well as understand spoken information.\n* Operate food service equipment or computer requiring the ability to move fingers and hands.\n* See and read labels, monitors, and documents.\n* Carry, push/pull, and walk while transporting food, supplies, and service equipment.\n* Climb, squat, kneel, and lift to clean equipment and reach and retrieve food and supplies.\n* Remain standing for long periods of time to perform work.\n* Tolerate extremes in temperature such as performing work at a grill or in a refrigerator.\n\n**Location:**\n\n\nIntermountain Health St George Regional Hospital**Work City:**\n\n\nSt George**Work State:**\n\n\nUtah**Scheduled Weekly Hours:**\n\n\n36\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$17\\.60 \\- $22\\.88\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 17.0,
        "max_amount": 22.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-09",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-63a456d2d114bde1",
      "title": "Medical Assistant WorkMed PRN",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=63a456d2d114bde1",
      "job_url_direct": "https://click.appcast.io/track/le9z1lx-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Cedar City",
        "state": "UT"
      },
      "description": "**Job Description:**\n\n\nA Medical assistant has accountability for providing care to patients in an ambulatory clinic setting. This will involve caring for patients with acute and chronic needs\nAre you interested in advancing your career while helping people live the healthiest lives possible? Do you want to have a job where the work you do matters? At Intermountain Health, we are looking for Medical Assistants who are patient\\-focused and engaged.\n\n*What does it mean to be a Medical Assistant with Intermountain Health?* *Check out this video* *to learn more.*\n\n**Scope**  \n\n  \n\nThe Medical Assistant (MA) functions under the supervision and licensure of the Physician or Advanced Practice Clinician within the clinical setting.\n\n**Posting Specifics**\n\n* Shift Details: PRN (as needed once trained, clinic hours are 8AM to 4PM Monday to Friday)\n* Unit/Location: Cedar City WorkMed\n\n**Benefits**\n\n* Medical, Dental, Vision, Life\n* Paid Time Off\n* Education Assistance\n* Tuition Reimbursement\n* 401(k) 2% for all caregivers with additional matching up to 4%\n* Health and Wellness Programs including a Live Well Incentive Program\n* Access to on\\-site fitness gyms\n* Over 302,000 discount offers across 10,000 cities on everything from pizza, the zoo, movie tickets, car rentals, and hotels\n* Cell Phone Discounts (AT\\&T, Verizon, Sprint, T\\-Mobile)\n* Click here for more details\n\n**Job Essentials**\n\n**Performs basic clerical and office duties including:**  \n\nAssembles necessary documents and supplies.  \n\nEffectively uses computer applications in the office setting.  \n\nSchedules, coordinates, and monitors appointments, inpatient and outpatient admissions, tests, treatments, and procedures.  \n\nMaintains medical records and other information.  \n\nMaintains inventory of supplies. Orders and restocks as needed to ensure availability for patient care.  \n\nAccurately documents patient history, physical, and vital information into the medical record.  \n\n  \n\n**Performs business and financial duties including:**  \n\nUnder the direction of the provider, assigns procedural and diagnostic coding to encounter forms.  \n\nConducts pre\\-authorizations and referrals in accordance with third party insurer requirements.  \n\nFacilitates timely billing by completing necessary documentation.  \n\n  \n\n**Performs clinical functions within acceptable standards of care including:**  \n\nPrioritizes (triage) patient needs identified through phone, electronic, and walk\\-in communication in accordance with established guidelines, standing orders, and protocols.  \n\nRecognizes and appropriately responds to emergency situations.  \n\nPrepares and maintains examination and treatment areas.  \n\nPerforms complete intake process as specified by physician or other providers (chief complaint, history, vital signs, height, weight, OFC, care process model data, etc.).  \n\nAdministers screening tests to patients (e.g., visual tests, audiology, spirometry, EKGs) within practice type.  \n\nAssists provider with examinations, procedures, treatments, and interventions.  \n\nProvides patient education as directed (content reflects specific MA training, guidelines, care process models, protocols).  \n\nReports significant changes in patient condition or other pertinent patient information to the Physician.  \n\nFollowing provider instructions, demonstrates accurate, timely, and efficient follow through with pharmacy refills, scheduling out of clinic procedures, obtaining, reporting and tracking of lab results, leaving phone messages, and distributing faxes.  \n\nActively participates in quality improvement initiatives (i.e. CQI, TQM, Lean, 100% participation, etc.).  \n\n  \n\n**Minimum Qualifications**\n\n*Entry Pay: $19\\.20\\+ (Pay is dependent on years of Medical Assistant experience)*\n\n* Current Basic Life Support Certification (BLS) for healthcare providers. Must be obtained prior to start date.\n* Successful completion of a Medical Assistant Program\n* Or 1 year of Medical Assistant Experience\n* Or current RN/LPN license\n\n\n**Preferred Qualifications**\n\n* Current national MA certification from one of the following national MA certifications or registrations: Registered Medical Assistant (RMA) of AMT, National Certified Medical Assistant (NCMA), Certified Clinical Medical Assistant (CCMA), or Certified Medical Assistant (CMA) of the AAMA.\n* Experience in an outpatient clinic or other healthcare setting.\n\n**Physical Requirements:**\n\n\nOngoing need for employee to see and read information, labels, assess patient needs, operate monitors, identify equipment and supplies.\n\n\n\\- and \\-\n\n\nFrequent interactions with patient care providers, patients, and visitors that require employee to verbally communicate as well as hear and understand spoken information, alarms, needs, and issues quickly and accurately, particularly during emergency situations.\n\n\n\\- and \\-\n\n\nManual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use and typing for documenting patient care, accessing needed information, medication preparation, etc.\n\n\n\\- and \\-\n\n\nExpected to lift and utilize full range of movement to transfer patients. Will also bend to retrieve, lift, and carry supplies and equipment. Typically includes items of varying weights, up to and including heavy items.\n\n\n\\- and \\-\n\n\nNeed to walk and assist with transporting/ambulating patients and obtaining and distributing supplies and equipment. This includes pushing/pulling gurneys and portable equipment, including heavy items. Often required to navigate crowded and busy rooms (full of equipment, power cords on the floor, etc).\n\n\n\\- and \\-\n\n\nMay be expected to stand in a stationary position for an extended period of time.\n\n**Location:**\n\n\nCedar City Instacare/Workmed**Work City:**\n\n\nCedar City**Work State:**\n\n\nUtah**Scheduled Weekly Hours:**\n\n\n0\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$19\\.20 \\- $27\\.35\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "parttime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 19.0,
        "max_amount": 27.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-13",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-6d9b0c54473be1a1",
      "title": "Radiation Therapist",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=6d9b0c54473be1a1",
      "job_url_direct": "https://click.appcast.io/track/kv27lyt-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Golden",
        "state": "CO"
      },
      "description": "**Job Description:**\n\n\nThe Radiation Therapist is responsible for administration of ionizing radiation for therapeutic purposes in accordance with the prescription of the Radiation Oncologist and is accountable for the simulation of patients in preparation of radiation therapy, basic patient care and education.\n To show our commitment to you and to assist with your transition into our organization, we will also offer up to a $7,500 sign\\-on bonus, if applicable.\n\n\nPosting Specifics:\n\n* Benefits Eligible: Yes\n* Hours: Full time (40 hours)\n* Shift Details: Variable\n\n\nScope\n\n* Checks prescription, diagnosis, chart and patient identification. Explains procedures to the patients, reinforcing the radiation oncologists and/or nurses instructions regarding reactions to the treatment and their care.\n* Prepares room and equipment for the patient according to the prescription, i.e., immobilization devices, blocks, field sizes etc. Transfers patients as needed.\n* Verifies the treatment Mus and beam energy in the treatment chart noting any prescribed adjustments. Documents treatment Mus cumulative dose, site specific doses, treatment parameters, instructions, diagrams, photos, and all billing information.\n* Performs treatment simulation and all that it requires for procedure (including cerrobend block fabrication). Develops x\\-rays and port films as needed, filing as needed. Observes and inquires of the patient any unusual reactions or events.\n* Assists in maintaining order and cleanliness of the unit. Maintains appropriate stock levels.\n* Completes daily, progress and discharge documentation according to departmental standards. Accurately documents productivity information.\n* Participates in quality and patient safety initiatives. Identifies potential areas for improvement including processes that could be streamlined or revised to improve patient satisfaction. Identifies potential safety hazards that may create problems for patients and/or staff, and takes appropriate actions. Documents patient plan(s) of care, tests and examination results in the medical record as directed by the provider. Escalates non\\-routine issues, questions and/or concerns to the practice manager or healthcare provider(s). Ensures safety checklists/quality controls are completed as required.\n\n  \n\nMinimum Qualifications\n\n* Graduation from an accredited radiation therapy program\n* ARRT and RT(T) certifications in radiation therapy and current license in state of practice\n* Current BLS certification\n**Physical Requirements:**\n\n\nOngoing need for employee to see and read information, labels, assess patient needs, operate monitors, identify equipment and supplies.\\- and \\-Frequent interactions with patient care providers, patients, and visitors that require employee to verbally communicate as well as hear and understand spoken information, alarms, needs, and issues quickly and accurately, particularly during emergency situations.\\- and \\-Manual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use and typing for documenting patient care, accessing needed information, medication preparation, etc.\\- and \\-Expected to lift and utilize full range of movement to transfer patients. Will also bend to retrieve, lift, and carry supplies and equipment. Typically includes items of varying weights, up to and including heavy items.\\- and \\-Need to walk and assist with transporting/ambulating patients and obtaining and distributing supplies and equipment. This includes pushing/pulling gurneys and portable equipment, including heavy items. Often required to navigate crowded and busy rooms (full of equipment, power cords on the floor, etc).\\- and \\-May be expected to stand in a stationary position for an extended period of time.**Location:**\n\n\nLutheran Medical Center Radiation Oncology**Work City:**\n\n\nGolden**Work State:**\n\n\nColorado**Scheduled Weekly Hours:**\n\n\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$37\\.46 \\- $57\\.80\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 37.0,
        "max_amount": 57.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-05",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-e13a8b3da5057c9f",
      "title": "Registered Nurse Infusion PRN",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=e13a8b3da5057c9f",
      "job_url_direct": "https://click.appcast.io/track/lkajyls-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Ogden",
        "state": "UT"
      },
      "description": "**Job Description:**\n\n\nThe Registered Nurse (RN) is a professional caregiver who assumes responsibility and accountability for assessing, planning, implementing and evaluating care of patients. The staff RN utilizes the nursing process by use of technology, therapeutic intervention, evidence\\-based practice and coordination of care with other health team members.**Job Essentials**  \n\n  \n\n**Assess:**\n\n* Performs appropriate assessment of physical, social, and psychological status (including cognitive, communicative and developmental skills as appropriate).\n* Seeks and evaluates information acquired from other members of interdisciplinary team: patient, family, physician, non\\-nursing disciplines, support staff, others.\n\n **Plan:**\n\n* Uses assessment information and critical thinking skills to collaboratively develop individualized plan of care.\n* Actively seeks patient, family, team, and physician involvement to develop plan of care including needed education.\n* Collaboratively plans and prepares patients for further support needs once the current episode of care outcomes are met (i.e., teaching, referrals, and follow\\-up).\n\n **Implement:**\n\n* Directs the interdisciplinary care team via delegation, coordination and collaboration as appropriate.\n* Provides or delegates care consistent with plan of care, guidelines of care and professional licensure provisions.\n* Demonstrates the ability to set priorities and to coordinate and organize patient care delivery through effectively managing time, supplies, and resources.\n\n **Evaluate:**\n\n* Evaluates patient response to interventions through review of achievement of goals, clinical outcomes, patient and family satisfaction.\n* Revises plan of care as indicated, and reassesses changes as appropriate.\n\n **Professionalism:**\n\n* Promotes nursing profession and participate in development of others.\n* Integrates legal and ethical standards into practice: complies with regulatory standards, practices within scope of licensure, provides accurate \\& timely documentation, and understands legal implications of care delivery.\n\n **Minimum Qualifications:**\n\n* Current RN License in state of practice.\n* Basic Life Support Certification (BLS) for healthcare providers.\n* Ability to communicate effectively both verbally and in writing.\n* RNs with less than 12 months of working experience as an RN prior to joining Intermountain must obtain their BSN within five years of their start date.\n\n **Preferred Qualifications:**\n\n* Bachelor's Degree in Nursing (BSN).\n* Education must be obtained from an accredited institution.\n* Degree will be verified.\n\n**Physical Requirements:**\n\n* Ongoing need for employee to see and read information, labels, assess patient needs, operate monitors, identify equipment and supplies.\n* Frequent interactions with patient care providers, patients, and visitors that require employee to verbally communicate as well as hear and understand spoken information, alarms, needs, and issues quickly and accurately, particularly during emergency situations.\n* Manual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use and typing for documenting patient care, accessing needed information, medication preparation, etc.\n* Expected to lift and utilize full range of movement to transfer patients. Will also bend to retrieve, lift, and carry supplies and equipment. Typically includes items of varying weights, up to and including heavy items.\n* Need to walk and assist with transporting/ambulating patients and obtaining and distributing supplies and equipment. This includes pushing/pulling gurneys and portable equipment, including heavy items. Often required to navigate crowded and busy rooms (full of equipment, power cords on the floor, etc).\n* Expected to stand in a stationary position for an extended period of time.\n\n**Location:**\n\n\nIntermountain Health McKay\\-Dee Hospital**Work City:**\n\n\nOgden**Work State:**\n\n\nUtah**Scheduled Weekly Hours:**\n\n\n0\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$34\\.19 \\- $50\\.73\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "parttime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 34.0,
        "max_amount": 50.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-08",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-8fefaa9041c88459",
      "title": "St George Volunteer Hospice",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=8fefaa9041c88459",
      "job_url_direct": "https://click.appcast.io/track/lf9ppgi-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Saint George",
        "state": "UT"
      },
      "description": "**Job Description:**\n\n\nHospice volunteers are needed to provide patient/ family assistance. Volunteers will interact directly with patients and families to offer support and will visit patient homes and run errands in the community\nEssential job responsibilities:\n\n\nPotential responsibilities include including companionship, running errands, helping to compete unfinished business, other household tasks, contacting surviving family members to provide bereavement support, contacting social workers or bereavement coordinators if concerns are identified, etc. Office support responsibilities include general office, clerical assistance, participating in public relations activities and fundraising activities. Volunteers are expected to utilize effective communication skills with all patients, families, and staff. Maintain ongoing communication with the Volunteer Coordinator regarding patient/family needs, frequency of patient/family contact and services provided. Volunteers provide respite for primary caregiver and family members.\n\n\nHospice volunteers are expected to complete their assignment until the patient death or discharge.\n\n\nQualifications\n\n* Must be 18 years of age or older\n* Able to work alone and independent (within scope of assigned duties)\n* Able to work well with diverse populations\n* Excellent communication and interpersonal skills\n* Good listening skills. Active listener\n* Maintain and respect professional relationships\n* Sound mental and emotional health\n* Sensitive to patient and family situations / dynamics\n* Able to stay calm in stressful situations\n* Self\\-motivated, flexible, and adaptable\n* Must be able to commit for a minimum of 6\\-month\n\n**Physical Requirements:**\n\n\nNo Additional Description Available\n\n**Location:**\n\n\nHomecare \\- St George**Work City:**\n\n\nSt George**Work State:**\n\n\nUtah**Scheduled Weekly Hours:**\n\n\n0\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "parttime"
      ],
      "compensation": null,
      "date_posted": "2024-12-18",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-fb2abe68410ff5e4",
      "title": "Adult Primary Care Physician",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=fb2abe68410ff5e4",
      "job_url_direct": "https://click.appcast.io/track/kxlf4ea-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Burley",
        "state": "ID"
      },
      "description": "**Job Description:**\n\n\nThis position has been allocated for a board certified or eligible physician.  \n\n  \n\n  \n\n  \n\nOur mission is: Helping people live the healthiest lives possible®**Adult Primary Care (Internal Medicine or Family Medicine)**\n\nWhen you join us, you’ll become a part of a nationally recognized health system dedicated to our mission of “helping people live the healthiest lives possible.”\n\n**About this role:**\n\n\nWe are searching for a physician to join our collaborative Primary Care medicine team at Cassia Regional Hospital. This position includes a competitive **s**tarting bonus, relocation assistance (determined by distance), with additional compensation based on a combination of w/RVU production and meeting quality goals, thoughtful stewardship of our healthcare system, and achieving high standards in performance reviews as they relate to citizenship. You will practice in an office space located on the hospital campus in our Primary Care clinic.\n\n**How we'll support you:**\n\n\nWe care about your well\\-being which is why we provide our caregivers a generous benefits package. In addition, we offer paid time off, license reimbursement, malpractice insurance coverage, and an annual CME allowance to support your continuous growth and development. Learn more about our comprehensive benefits package and our commitment to diversity, equity, and inclusion.\n\n **What you’ll bring:**\n\n* MD or DO degree from a fully accredited medical or osteopathic school of medicine\n* Residency training Internal Medicine or Family Medicine\n* Board certification or eligibility in Internal Medicine or Family Medicine\n* Active, unobstructed Idaho medical license, or the ability to obtain one\n* Ability to successfully complete Intermountain Health’s credentialing process\n* Current BLS Certification is required before the first day of employment\n\n* While we invite all qualified candidates to apply for this role in most cases we are not able to consider candidates requiring Visa sponsorship at this time\n\n**About us:**\n\n\nIntermountain Health is a model health system by providing extraordinary care and superior service at an affordable cost. We are an integrated not\\-for\\-profit system of 33 hospitals, 385 clinics, and a medical group with more than 5,000 employed physicians and advanced practice providers across seven states in the mountain west.\n\n\nOur value statements are core to our culture. They reflect the behavior and attitudes that are important to us, are an agreement for how we treat each other, help us make decisions on how to act, and are a promise of what people can expect from us. Learn more about our Mission, Vision, and Values at: About Intermountain!\n\n**What does it mean to be a part of Intermountain Health?**\n\n\nIt means joining the Power of We, building an environment where providers and caregivers can deliver the best in healthcare. Realizing each caregiver and volunteer is vital to providing care to our patients, because WE can only achieve the extraordinary together. Committed to the best in research and most advanced technology, the results are better clinical patient outcomes\n\n**Life in the Mountain West**\n\n\nBurley is a riverfront community nestled along the banks and cliffs of the beautiful Snake River in Cassia County. It offers an ideal setting for family living with clean air, a relaxed pace, lower cost of living and plenty of \"breathing space\". The population is 11,000 with a service area of \\~50,000\\. Tertiary care centers are just 2 1/2 hours north to Boise or 2 hours and 45 minutes south to Salt Lake City, Utah. The great outdoors is just minutes away. Fishing and water recreation activities abound in the Snake River and nearby Lake Walcott. The Albion Mountain Range and Sawtooth National Forest provide unparalleled outdoor recreation possibilities; including skiing, backpacking, camping and mountain biking. Burley also offers a local’s favorite ski resort, Pomerelle, which caters specifically to families enjoying and learning to ski or board, and features 24 expertly groomed slopes, advanced to beginner runs, \\& 2 terrain parks. Sun Valley ski resort, world famous vacation destination, is less than two hours away. You will find a four\\-season climate, low humidity and mild winters. With a strong economy, Burley offers not only an outstanding professional opportunity but an ideal setting for life away from work as well.\n\n**Physical Requirements:**\n\n\nNo Additional Description Available\n\n**Location:**\n\n\nIntermountain Health Cassia Regional Hospital**Work City:**\n\n\nBurley**Work State:**\n\n\nIdaho**Scheduled Weekly Hours:**\n\n\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$7\\.25 \\- $999\\.99\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "fulltime"
      ],
      "compensation": null,
      "date_posted": "2024-12-05",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-0f6804c114a8fd6b",
      "title": "Enhanced Specialty Scheduler",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=0f6804c114a8fd6b",
      "job_url_direct": "https://click.appcast.io/track/liyug2m-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Saint George",
        "state": "UT"
      },
      "description": "**Job Description:**\n\n\nThe Enhanced Scheduler is responsible for registering and scheduling patients at Intermountain Healthcare facilities system\\-wide ensuring that processes and procedures exceed customer expectations. This position enhances the patient experience with one telephone call to schedule and register for services. The Enhanced Scheduler reviews insurance benefit information, estimated costs, and payment options with the patient. Also obtains or reviews all necessary demographic, clinical, procedural, and prep information with the patient or representative. This position also enhances the Provider experience by offering a single point of contact for the referring offices. The Enhanced Scheduler acts as a liaison between the physician office and facility departments across multiple service lines within the enterprise.**Schedule \\- There is potential for working some holidays and weekends.**  \n\n  \n\nThe Enhanced Schedulers may be located in a central call center and have accountability to coordinate and schedule patients for multiple facilities and departiments and to work closely with multiple locations.\n\n* Accountable to verify accuracy of EMPI link. Identifies and reports possible Compromised Records or Identity Theft.\n* Interacts with customer to gather and verify needed registration and scheduling information.\n* Accurately inputs patient demographic, insurance, and essential scheduling and admission information into the appropriate database so that billing, reporting, and analysis by facility, corporate, state, and federal agencies can be performed.\n* Comprehends and provides explanation of legal documents in accordance to regulatory requirements.\n* Holds financial discussion with patient or representative which includes insurance benefits, cost estimation, financial obligation, and identifying financial assistance needs.\n* Articulates billing process information and maintains the stats determined reasonable for position\n* Interacts between physicians, physician's office staff, and ancillary departments as needed in the interest of the patient to obtain orders and diagnosis for patients.\n* Provides customers with information concerning examination content and pre\\-examination instructions including preps and timetables providing way\\-finding as needed.\n* Coordinates appointments for patients between multiple locations in the system.\n* Documents discussions with patients by entering detailed notes in the appropriate software, and ensures accurate record keeping for any follow up needed.\n* Satisfies all Intermountain requirements regarding procedural, operational, and compliance training and updates.\n* Greets patient/clients in person and on the phone while upholding Intermountin's mission, vision, and values, responding with empathy and positive interpersonal skills.\n* Maintains expected productivity, quality, and department standards.\n* Tactfully handles difficult situations with unhappy customers applying Healing Commitment principles to achieve positive service recovery.\n* May lead, mentor, and/or train new employees.\n\n  \n\nMinimum Qualifications\n\n* Associate's degree. Education must be obtained through an accredited institution. Degree will be verified. **\\- Or \\-** Two years of medical admitting, billing, collection, scheduling, or insurance experience,\n* Demonstrated excellent communication and interpersonal skills\n* Experience managing multiple tasks or priorities.\n* Demonstrated working knowledge of word processing, spreadsheet, email, and calendaring programs.\n* Demonstrated typing proficiency.\n* Demonstrated ability to work effectively in time sensitive situations.\n* Demonstrated independent and critical decision making skills.\n\n  \n\nPreferred Qualifications\n\n* Associate's Degree. Degree must be obtained through an accredited institution. Education is verified.\n* Bi\\-lingual \\- Spanish speaking\n* Knowledge of medical terminology\n* Versed in CPT/ICD codes\n* Two years of experience working with patient access or two years of experience in and extensive knowledge in the health insurance industry (Commercial Insurances, Medicare, and Medicaid); health claims billing or Third Party contracts.\n\n**Physical Requirements:**\n\n* Interact with others requiring the employee to communicate information.\n* Operate computers and other office equipment requiring the ability to move fingers and hands.\n* See and read computer monitors and documents.\n* Remain sitting or standing for long periods of time to perform work on a computer, telephone, or other equipment.\n\n**Location:**\n\n\nIntermountain Health St George Regional Hospital**Work City:**\n\n\nSt George**Work State:**\n\n\nUtah**Scheduled Weekly Hours:**\n\n\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$19\\.27 \\- $29\\.33\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 19.0,
        "max_amount": 29.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-04",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-0f322cdc7b0076b4",
      "title": "Registered Nurse Trauma Program Coordinator",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=0f322cdc7b0076b4",
      "job_url_direct": "https://click.appcast.io/track/kzzv0u6-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Wheat Ridge",
        "state": "CO"
      },
      "description": "**Job Description:**\n\n\nThe Clinical Program Coordinator assesses, plans, implements and coordinates treatment processes from diagnosis through follow up, specifically guides patients through the collaborative process with all medical care providers and ancillary support programs and provides educational support along the continuum.**Position Details**\n\n* **Benefits Eligible:** Yes\n* **Shift Details:** Full time, 40 hours/week, Monday \\- Friday, occasional weekends based on business needs, no holidays\n* **Department:** Trauma\n* **Primary Location:** Lutheran Medical Center\n* **Required Certifications:** BLS, TNCC upon hire; ACLS, PALS, ENPC within 1 year of hire\n* **Additional Details:** 3 years of trauma experience required with trauma program specific experience.\n\nScope\n\n\n1\\.Serves as a coordinator for assigned program. Discusses program with physicians andnurses and concurrently reviews that all care meets evidence\\-based guidelines. Provides education to patients and family members during the hospital stay and serves as a resource and contact for patients and their families after they are discharged.\n\n\n2\\. Actively participates in patient care rounds.\n\n\n3\\. Collaborates with the director to oversee and ensure that the program meets the regulatory requirements. Performs chart reviews and collects data. Performs analysis of this data for performance improvement activity, planning and evaluation within the program.\n\n\n4\\. Collaborates with the director to develop and implement evidence\\-based policies and standards for the program. Assesses plans, develops, implements and evaluates activities that promote professional development and continuing competence of care site providers and students.\n\n\n5\\. Maintains and/or analyzes data collected on assigned program. Serves as the subject matter expert for the program. Creates and maintains a Quality Assurance program.\n\n\n6\\. Promotes mission, vision, and values of SCL Health, and abides by service behavior standards.\n\n\n7\\. Performs other duties as assigned.\n\n\n8\\. May be required to float to other departments (within scope of competency and qualifications) based on business need.\n\n\n9\\. May be required to be placed on\\-call during a regularly scheduled shift.\n\n\nMinimum Qualifications\n\n\nBachelors Degree in Nursing\n\n\nCurrent license as a Registered Nurse in the state of practice\n\n\nCurrent American Heart Association Basic Life Support for Healthcare Providers (BLS\\-HCP)certification upon hire or obtained within 60 days of hire with prior approval (ACLS/NRP/PALS as appropriate for unit or service )\n\n\nThree years relevant RN experience\n\n\nPreferred Qualifications\n\n\nMaster's degree in Nursing\n\n\nCertification as appropriate for unit or service\n\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements list must be representative of the knowledge, skills, minimum education, training, licensure, experience, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\n1\\. Regular attendance to perform work on site during regularly scheduled business hours or scheduled shifts is required.\n\n\n2\\. Ability to work nights and/or weekends is required for identified positions\n\n**Physical Requirements:**\n\n**Location:**\n\n\nLutheran Medical Center**Work City:**\n\n\nWheat Ridge**Work State:**\n\n\nColorado**Scheduled Weekly Hours:**\n\n\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$39\\.99 \\- $59\\.18\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 39.0,
        "max_amount": 59.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-10",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-3850817f0fae013a",
      "title": "PRN Pharmacy Technician",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=3850817f0fae013a",
      "job_url_direct": "https://click.appcast.io/track/kv27msb-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Grand Junction",
        "state": "CO"
      },
      "description": "**Job Description:**\n\n\nThis incumbent demonstrates consistent application of knowledge and skills in assisting the pharmacist in the execution of appropriate, safe, efficacious, efficient, and cost\\-effective pharmaceutical care. The incumbent participates in many procedural aspects of pharmacy practice under the supervision of a licensed pharmacist or technician supervisor and is an integral part of the pharmacy team.\nScope  \n\n  \n\n1\\.Assists with all phases of pharmacy services while under the supervision of a pharmacist.  \n\n2\\. Answers phones.\n  \n\n3\\. Prepares and delivers medications for dispensing.\n  \n\n4\\. Utilizes pharmacy technology effectively to distribute medications.\n  \n\n5\\. Accurately fills and maintains medications supplies in the automatic dispensing system including verifying and monitoring controlled substance inventories as required. Packages and labels medications accurately and appropriately to minimize waste. Verifies and monitors controlled substance inventories as required by daily shift assignment.\n  \n\n6\\. Compounds medications in accordance with state law and policy. Performs calculations as necessary for accurate compounding. Prepares medication orders (i.e., chemotherapy, IV admixtures, compounding) according to established policies, procedures, and protocols. Prepares complex sterile compounded IV products, including daily batch orders, stat and other emergency medications and TPN formulations.\n  \n\n7\\. Maintains appropriate records as required by regulation and policy.\n  \n\n8\\. Ensures pharmacy cleanliness and orderliness.\n  \n\n9\\. Assists the pharmacist in collecting clinical and other patient information as required.\n  \n\n10\\. Effectively manages pharmacy inventory to ensure security, accuracy, cost. effectiveness, and 340B/Charging management as required.\n  \n\n11\\. Escalates items to the pharmacist for review as appropriate based on urgency, regulations, and scope.\n  \n\n12\\. Completes advanced tasks consistent with scope as assigned by management.\n  \n\n13\\. Participates in quality and patient safety initiatives. Identifies potential areas for improvement including processes that could be streamlined or revised to improve patient satisfaction. Identifies potential safety hazards that may create problems for patients and/or staff, and takes appropriate actions. Participates in departmental meetings, contributing ideas or feedback.\n  \n\n14\\. Promotes mission, vision, and values of SCL Health, and abides by service behavior standards.\n  \n\n15\\. Performs other duties as assigned.  \n\n  \n\nMinimum Qualifications  \n\n  \n\nRequired  \n\nHigh School or equivalent is required  \n\nPharmacy technician certification (CPhT) through PTCB or EXcPT or other certifying board andsuccessful registration/certification/licensure with the state of practice as a Certified PharmacyTechnician (not \"in\\-training\" or \"provisional\") is required Any lapse or failure to meet these requirements will result in immediate termination At the discretion of the hiring manager,applicants who are not yet certified may be hired as Level I technicians for a limited time while they are pursing their certification  \n\n  \n\n  \n\nPreferred  \n\nAssociates or bachelors degree is desirable Technician training is preferred  \n\nBLS  \n\nTwo (2\\) years working as a certified pharmacy tech in a hospital or infusion pharmacy setting is preferred  \n\n  \n\nTo perform this job successfully, an individual must be able to perform each essential dutysatisfactorily. The requirements list must be representative of the knowledge, skills, minimum education, training, licensure, experience, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Regular attendance to perform work on site during regularly scheduled business hours ..... or scheduled shifts is required Ability to communicate effectively and diplomatically within a multi\\-functional team Strong organizational skills and attention to detail Ability to successfully function in a fast paced, service oriented environment Competent in understanding and usage of computers and software programs, including the Microsoft Office Suite and Google. Ability to learn new applications relevant to the position. **Physical Requirements:**\n\n\nPhysical RequirementsCarrying, hearing/listening, lifting, manual dexterity, pulling/pushing, seeing.**Location:**\n\n\nSt. Marys Regional Hospital**Work City:**\n\n\nGrand Junction**Work State:**\n\n\nColorado**Scheduled Weekly Hours:**\n\n\n0\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$17\\.95 \\- $27\\.32\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "parttime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 17.0,
        "max_amount": 27.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-05",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-a72b2dd8b05c455d",
      "title": "Medical Assistant Urogynecology",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=a72b2dd8b05c455d",
      "job_url_direct": "https://click.appcast.io/track/lgjuxnf-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Denver",
        "state": "CO"
      },
      "description": "**Job Description:**\n\n\nA Medical assistant has accountability for providing care to patients in an ambulatory clinic setting. This will involve caring for patients with acute and chronic needs*Recently Updated Pay Range: $19\\.97 \\- $29\\.74*\n\n**External Candidates:** *To show our commitment to you and to assist with your transition into our organization, we will also offer up to a* *$1,000\\.00 Sign\\-on Bonus* *when applicable.*\n\n **Additional Details:** Please review Minimum Qualifications listed below before applying.\n\n **Are you interested in advancing your career while helping people live the healthiest lives possible?** As a Medical Assistant at Intermountain Health, you will play a vital role in supporting our clinical team, ensuring our patients receive the best care. At Intermountain, you will be part of a team that values career advancement, innovation and collaboration, where your skills are valued, and your contributions make a lasting impact.\n\n  \n\n\n\n**What does it mean to be a caregiver with Intermountain?** Check out this video and learn more and discover the “Power of We.”\n\n **As a Medical Assistant at Intermountain Health, you will play a vital role in supporting our clinical team, ensuring our patients receive the best care by:**\n\n  \n\n\n\n* **Providing Patient Care:** Under the direction of the Clinician, providing care to patients by assisting the provider to gather information that is relative to the patient’s visit and condition.\n* **Effective Communication:** Communicating clearly with patients seeking care through different modalities including telephone and in\\-person interactions.\n* **Team Collaboration:** Working with cross functional teams to collaborate on patient care. Attention to detail and follow\\-through are key components in helping to provide the care that is needed.\n\n**Minimum Qualifications**\n\n* Successful completion of a Medical Assistant Program (certification must be provided upon hire)\n* Or at least one year of Medical Assistant experience (verified upon hire)\n* Or current RN/LPN license to practice nursing in the state\n* Current Basic Life Support Certification (BLS) for healthcare providers. Must be obtained prior to start date\n* Demonstrated basic computer skills involving word processing and data entry.\n* Professional manner and strong interpersonal and communication skills.\n* Ability to work collaboratively with patients and fellow caregivers to deliver the highest level of customer/patient satisfaction.\n* Ability to protect privacy, confidentiality, and Protected Health Information (PHI) of patients, members, and caregivers.\n\n**Preferred Qualifications**\n\n* Experience in an outpatient clinic or other healthcare setting.\n* Computer literacy in using electronic medical records (EMR) systems and other relevant software.\n* Current national MA certification from one of the following national MA certifications or registrations: Registered Medical Assistant (RMA) of AMT, National Certified Medical Assistant (NCMA), Certified Clinical Medical Assistant (CCMA) or Certified Medical Assistant (CMA) of the AAMA\n\n**Physical Requirements:**\n\n\nOngoing need for employee to see and read information, labels, assess patient needs, operate monitors, identify equipment and supplies.\n\n\nManual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use and typing for documenting patient care, accessing needed information, medication preparation, etc.\n\n\nExpected to lift and utilize full range of movement to transfer patients. Will also bend to retrieve, lift, and carry supplies and equipment. Typically includes items of varying weights, up to and including heavy items.\n\n\nNeed to walk and assist with transporting/ambulating patients and obtaining and distributing supplies and equipment. This includes pushing/pulling gurneys and portable equipment, including heavy items.\n\n\nOften required to navigate crowded and busy rooms (full of equipment, power cords on the floor, etc.)\n\n\nMay be expected to stand in a stationary position for an extended period of time.\n\n\nFor roles requiring driving: Expected to drive a vehicle which requires sitting, seeing and reading signs, traffic signals, and other vehicles.\n\n\nFrequent interactions with patient care providers, patients, and visitors that require employee to verbally communicate as well as hear and understand spoken information, alarms, needs, and issues quickly and accurately, particularly during emergency situations.\n\n**Location:**\n\n\nDenver Midtown Clinic, Lafayette Clinic**Work City:**\n\n\nDenver**Work State:**\n\n\nColorado**Scheduled Weekly Hours:**\n\n\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$19\\.97 \\- $29\\.74\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 19.0,
        "max_amount": 29.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-23",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-7b1804dbf19e7efb",
      "title": "Sonographer",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=7b1804dbf19e7efb",
      "job_url_direct": "https://click.appcast.io/track/kv27lg2-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Grand Junction",
        "state": "CO"
      },
      "description": "**Job Description:**\n\n\nThis position performs a variety of diagnostic general, OB \\& vascular exams under the direction of a physician for identification of abnormalities leading to patient diagnosis.**To show our commitment to you and to assist with your transition into our organization, we will also offer up to a $8,000 sign\\-on bonus, if applicable.**\n\n\nScope\n\n* Ensures proper patient identification, verifies orders, and prepares patients for exams.\n* Uses proper imaging techniques to ensure timely, safe, and high quality diagnostic exams.\n* Demonstrates the ability to perform any exam on all ages of patients (neonates, pediatrics, adolescents, adults and geriatrics) using appropriate protocol and following ACR guidelines.\n* Demonstrates proficiency on all clinical equipment within the department.\n* Completes and annotates a medically acceptable exam, following ACR guidelines while producing the maximum diagnostic information in a minimal amount of time.\n* Follows appropriate protocol for medical necessity, coding and charging, obtaining consents if necessary, documenting any events that may occur, for quality, maintaining a current QC program for ACR and reporting any equipment failures or problems.\n* Exhibits good safety practices in body substance protection, cleaning of equipment, using proper sterile techniques, and removing any expired materials.\n* Thoroughly and accurately completes all required documentation, including time stamps and image storage.\n\n\nQualifications\n\n* ARRT Registry or ARDMS Registry. The ARDMS must include successful completion of one registry pertinent to the department beyond physics (options include OB, abdominal, neuro, breast, and, vascular), required\n* Basic life support (BLS) certification for healthcare providers, required.\n* Ultrasound experience, preferred.\n\n**Physical Requirements:**\n\n\nOngoing need for employee to see and read information, labels, assess patient needs, operate monitors, identify equipment and supplies.\\- and \\-Frequent interactions with patient care providers, patients, and visitors that require employee to verbally communicate as well as hear and understand spoken information, alarms, needs, and issues quickly and accurately, particularly during emergency situations.\\- and \\-Manual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use and typing for documenting patient care, accessing needed information, medication preparation, etc.\\- and \\-Expected to lift and utilize full range of movement to transfer patients. Will also bend to retrieve, lift, and carry supplies and equipment. Typically includes items of varying weights, up to and including heavy items.\\- and \\-Need to walk and assist with transporting/ambulating patients and obtaining and distributing supplies and equipment. This includes pushing/pulling gurneys and portable equipment, including heavy items. Often required to navigate crowded and busy rooms (full of equipment, power cords on the floor, etc).\\- and \\-May be expected to stand in a stationary position for an extended period of time.**Location:**\n\n\nSt. Marys Regional Hospital**Work City:**\n\n\nGrand Junction**Work State:**\n\n\nColorado**Scheduled Weekly Hours:**\n\n\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$34\\.06 \\- $52\\.55\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 34.0,
        "max_amount": 52.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-05",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-203941cd5238e6b8",
      "title": "Cook PRN",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=203941cd5238e6b8",
      "job_url_direct": "https://click.appcast.io/track/l8bhqs1-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Tremonton",
        "state": "UT"
      },
      "description": "**Job Description:**\n\n\nPRN position.  \n\n  \n\nCOOKS, healthcare has changed! At our Intermountain hospital, we don’t serve hospital food, we serve world class cuisine! Pay rate is based on professional cooking experience. We offer flexible schedules and awesome benefits! Want to become a Certified Chef? Intermountain Healthcare offers education assistance for those who are benefits eligible.  \n\n  \n\nThis position provide a great work\\-life balance with high quality benefits. Intermountain offers generous paid time off accruals and encourages caregivers to use it on a regular basis. There are opportunities to cook in following areas: retail, room service, catering, grill cook, or display cook.  \n\n  \n\nWe not only serve our caregivers and patients, but we also cater to high profile guests and special events. There are opportunities to learn from experienced classically trained Chefs while on the line in the banquet or production kitchens**Posting Specifics*** **Pay Rate: Based** **on Experience**\n* **Shift Details:****Weekdays will vary and will include Rotating Weekends.**  \n\nThe main shifts needing covered will be 6:00 a.m. \\-2:30 p.m., rotating weekends and holidays.  \n\n**Most PRN caregivers work 2\\-3 shifts per week.**\n* **Department:** Culinary Services at Bear River Valley Hospital\n* Additional Details:**Knowledge of cooking basics is a plus.**\n**Job Essentials**\n\n* Understands work flow, prioritizes, uses timelines, understands deadlines\n* Follows recipes and/or instructions in the preparation of food items\n* Appropriately utilizes commercial cooking equipment\n* Understands and prepares modified diets using appropriate techniques\n* Follows HACCP food safety standards\n* Maintains an organized and sanitary working environment\n* Maintains proper quantities of production with appropriate rotation of product\n* Safe food handling techniques are handled in all applications\n* Interacts with customers in any venue\\-catering, retail outlets or patient care\n* May prepare: bulk food items, large scale production, line cook or complete assembly of specialty meals and catered items\n* May be required to deliver patient meals, cashier, stock, use automatic and manual ware\\-washing machines\n\n **Minimum Qualifications**\n\n* **Food Handler's Permit**as required by county.\n* Demonstrated ability to read, write, and communicate effectively.\n* Demonstrated customer service skills.\n* Demonstrated ability to work independently and part of a team.\n* Demonstrated ability to follow instructions.\n\n **Preferred Qualifications**\n\n* Experience in hotels, large\\-scale production facilities, education or business dining, one year of food service experience.\n**Physical Requirements:**\n\n* Interact with patients and co\\-workers requiring the employee to verbally communicate information, as well as understand spoken information.\n* Operate food service equipment or computer requiring the ability to move fingers and hands.\n* See and read labels, monitors, and documents.\n* Carry, push/pull, and walk while transporting food, supplies, and service equipment\n* Climb, squat, kneel, and lift to clean equipment and reach and retrieve food and supplies.\n* Remain standing for long periods of time to perform work.\n* Tolerate extremes in temperature such as performing work at a grill or in a refrigerator, and tolerate exposure to cleaning chemicals.\n\n**Location:**\n\n\nIntermountain Health Bear River Valley Hospital**Work City:**\n\n\nTremonton**Work State:**\n\n\nUtah**Scheduled Weekly Hours:**\n\n\n0\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$17\\.85 \\- $23\\.21\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "parttime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 17.0,
        "max_amount": 23.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-05",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-a9c66313fe5dfdd9",
      "title": "Registered Nurse Telemetry",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=a9c66313fe5dfdd9",
      "job_url_direct": "https://click.appcast.io/track/kv27lqm-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Wheat Ridge",
        "state": "CO"
      },
      "description": "**Job Description:**\n\n\nThe Registered Nurse (RN) is a professional caregiver who assumes responsibility and accountability for assessing, planning, implementing and evaluating care of patients. The staff RN utilizes the nursing process by use of technology, therapeutic intervention, evidence\\-based practice and coordination of care with other health team members.\nScope\n\n\nShift Information: Full\\-Time Night Shift *(eligible for night shift differential)*\n\n\nUnit Information\n\n\nIntermountain Health Heart and Vascular ambulatory clinics bring together many of the region’s top heart and vascular specialists to deliver exceptional quality care and superior outcomes. Built upon long\\-standing clinical partnerships and groundbreaking research, our clinics represent a uniquely innovative and collaborative approach to heart and vascular care in the Front Range region. Along with general cardiology services, our clinics offer specialty services and procedures including Advanced Cardiac Imaging, a Heart Failure program, Cardio\\-Obstetrics services, Cardio\\-Oncology services, Cardiothoracic Surgery, Electrophysiology, Interventional Cardiology, Peripheral Artery Disease treatments and a Structural Heart Disease program. Join our extraordinary team and help us make a difference in our community.\n\n* As a Registered Nurse, you know that every day is different, which is why you need to know how to assess, recognize, and address patients' psychological and physical needs.\n* Foster quality of care with the best interests of patients and their families in mind\n* Communicate compassionately and effectively.\n* Assist in developing individualized treatment plans.\n* Comply with evaluation, treatment, and documentation guidelines\n* Oversee care delivered by LPNs and/or CNAs\\- Participate in clinical team conferences\n* Follow hospital, regulatory, and professional guidelines, policies, and procedures.\n\n\nMinimum Qualifications\n\n\nASN from an accredited program; BSN within 4 years\n\n* A current Registered Nurse license in the state of practice required\n* Current BLS certification endorsed by the American Heart Association\n* One year of nursing experience in a comparable setting, preferred\n\n **Physical Requirements:**\n\n* Ongoing need for employee to see and read information, and labels, assess patient needs, operate monitors, and identify equipment and supplies.\n* Frequent interactions with patient care providers, patients, and visitors that require employees to verbally communicate as well as hear and understand spoken information, alarms, needs, and issues quickly and accurately, particularly during emergency situations.\n* Manual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use and typing for documenting patient care, accessing needed information, medication preparation, etc.\n* Expected to lift and utilize the full range of movement to transfer patients. Will also bend to retrieve, lift, and carry supplies and equipment. Typically includes items of varying weights, up to and including heavy items\n* Need to walk and assist with transporting/ambulating patients and obtaining and distributing supplies and equipment. This includes pushing/pulling gurneys and portable equipment, including heavy items. Often required to navigate crowded and busy rooms (full of equipment, power cords on the floor, etc).\n* May be expected to stand in a stationary position for an extended period of time.\n\n**Location:**\n\n\nLutheran Medical Center**Work City:**\n\n\nWheat Ridge**Work State:**\n\n\nColorado**Scheduled Weekly Hours:**\n\n\n36\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$37\\.17 \\- $54\\.53\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 37.0,
        "max_amount": 54.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-05",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-57bab95d78681a2f",
      "title": "APP Pediatric Liver Transplant",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=57bab95d78681a2f",
      "job_url_direct": "https://click.appcast.io/track/lhrb9hf-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Salt Lake City",
        "state": "UT"
      },
      "description": "**Job Description:**\n\n\nWhen you join us, you’ll become a part of a nationally recognized health system dedicated to our mission of “helping people live the healthiest lives possible.”\n\n **About this role:**\n\n\nThis Advanced Practice Provider will join our Pediatric Liver Transplant team at Primary Children's Hospital, located in Salt Lake City, Utah. Our Liver Disease and Transplantation Program provides comprehensive care for children with liver disease from diagnosis through transplantation and follow\\-up care. Our program has the largest volume in the Rocky Mountain West, providing liver care to patients from more than six Western states nationally, as well as internationally. Our program was established in 1996 and is run by experienced APPs and surgeons who actively participate in national research programs and initiatives. We share in the Primary Children's philosophy of \"The Child First and Always.\" In addition to standard whole liver transplantation, our program performs split liver transplantation and living donor liver transplantation.\n\n  \n\nThe APP will provide care and manage patients who are hospitalized, seen in clinic, and assist in the operating room. While focused primarily on pre and post\\-liver transplant, liver and hepatopancreatobiliary diseases, the APP will also cross train in kidney transplant.  \n\n  \n\nThis is a full\\-time opportunity, that will include expectation of working rotating days, nights, weekends and holidays, split equally among the providers.\n\n**How we'll support you:**\n\n\nWe care about your well\\-being, which is why we provide our caregivers a generous benefits package. In addition, we offer paid time off, license reimbursement, malpractice insurance coverage, and an annual CME allowance to support your continuous growth and development. Learn more about our comprehensive benefits package and our commitment to diversity, equity, and inclusion.\n\n **What you’ll bring:**\n\n* Current state license as an Advance Practice Registered Nurse (APRN) or Physician Assistant (PA)\n* Certification as a Nurse Practitioner or Physician Assistant\n* Utah State Controlled Substance License\n* Federal DEA Certificate II through V\n* BLS Certification for Healthcare Providers\n* Prior pediatric APP experience is strongly preferred.\n\n **About us:**\n\n\nIntermountain Health is a model health system by providing extraordinary care and superior service at an affordable cost. We are an integrated not\\-for\\-profit system of 33 hospitals, 385 clinics, and a medical group with more than 5,000 employed physicians and advanced practice providers across seven states in the mountain west.\n\n  \n\nOur value statements are core to our culture. They reflect the behavior and attitudes that are important to us, are an agreement for how we treat each other, help us make decisions on how to act, and are a promise of what people can expect from us. Learn more about our Mission, Vision, and Values at: About Intermountain.\n\n  \n\nWhat does it mean to be a part of Intermountain Health?\n\n\nIt means joining the Power of We, building an environment where providers and caregivers can deliver the best in healthcare. Realizing each caregiver and volunteer is vital to providing care to our patients, because WE can only achieve the extraordinary together. Committed to the best in research and most advanced technology, the results are better clinical patient outcomes.\n\n**Physical Requirements:**\n\n**Location:**\n\n\nIntermountain Health Primary Childrens Hospital**Work City:**\n\n\nSalt Lake City**Work State:**\n\n\nUtah**Scheduled Weekly Hours:**\n\n\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$54\\.84 \\- $84\\.63\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 54.0,
        "max_amount": 84.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-31",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-856d4868fc5d5051",
      "title": "EVS Technician",
      "company_name": "Intermountain Health",
      "job_url": "https://www.indeed.com/viewjob?jk=856d4868fc5d5051",
      "job_url_direct": "https://click.appcast.io/track/lanrnfw-org?cs=hqw",
      "location": {
        "country": "US",
        "city": "Heber City",
        "state": "UT"
      },
      "description": "**Job Description:**\n\n\nThis position is responsible for performing general housekeeping tasks to maintain the facility and associated buildings in a sanitary, safe, and attractive condition and to meet hospital and Joint Commission standards.**Work Schedule**\n\n* **Part Time, 30 hours per week**\n* **Work Schedule: Thursday\\-Sunday 4:00pm\\-12:00am midnight**\n* **Required: Holiday Shifts**\n* **Benefits Eligible: Yes; Medical, Dental, Vision, Education Assistance. Click here for more details**\n\n**Job Essentials**\n\n* Cleans and disinfects assigned areas using department cleaning procedures.\n* Uses cleaning chemicals properly according to Joint Commission and OSHA standards.\n* Understands procedures and properly disposes of infectious waste and trash.\n* Handles and cleans up emergency spills per department guidelines as well as to Joint Commission and OSHA standards.\n* Operates and maintains assigned equipment according to established procedures.\n* Maintains work and storage areas following established policy and procedures to ensure safety.\n* Uses supplies appropriately and effectively.\n* Reports problems with equipment and facility in an appropriate and timely manner.\n\n **Minimum Qualifications**\n\n* Demonstrated communication skills to include reading color coded labels and chemicals as well as following written and verbal directions.\n* Availability to work a flexible work schedule to meet the needs of the department.\n\n **Preferred Qualifications**\n\n* Professional housekeeping experience\n\n**Physical Requirements:**\n\n\nCarrying, Lifting, Pulling/Pushing, Seeing, Speaking, Squatting/Kneeling, Standing, Walking**Location:**\n\n\nIntermountain Health Heber Valley Hospital**Work City:**\n\n\nHeber City**Work State:**\n\n\nUtah**Scheduled Weekly Hours:**\n\n\n30\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience.\n\n\n$16\\.83 \\- $21\\.88\nWe care about your well\\-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged.\n\n\nLearn more about our comprehensive benefits packages for our Idaho, Nevada, and Utah based caregivers, and for our Colorado, Montana, and Kansas based caregivers; and our commitment to diversity, equity, and inclusion.\n\n\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\n  \n\nAll positions subject to close without notice.",
      "company_url": "https://www.indeed.com/cmp/Intermountain-Health-1",
      "company_url_direct": "https://intermountainhealthcare.org/",
      "job_type": [
        "parttime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 16.0,
        "max_amount": 21.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-05",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Salt Lake City, UT",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "As the largest nonprofit health system in the Mountain West, Intermountain Health is dedicated to helping people live the healthiest lives possible.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bd5e5ad73f224f2caf4d9b5693446d7d",
      "banner_photo_url": null,
      "job_function": null
    }
  ]
}