{
  "company_name": "lululemon",
  "sector": "Retail_and_Apparel",
  "sample_size": 20,
  "total_jobs_available": 429,
  "jobs": [
    {
      "id": "in-5020d6e5c524c763",
      "title": "Contract Full-Time Educator",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=5020d6e5c524c763",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Contract-Full-Time-Educator-Whalers-Village/43082",
      "location": {
        "country": "US",
        "city": "Lahaina",
        "state": "HI"
      },
      "description": "**Who We Are:**  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\n**Job Summary:**  \n\nThe Educator role is the foundation of our success as an organization. Educators are experts in creating world\\-class customer service, or guest experience, in our retail stores. They are responsible for engaging and connecting with our guests, sharing top\\-quality product education, and speaking authentically about our community and culture.\n  \n  \n\nKey Responsibilities of the Job\n  \n  \n\nGuest (i.e., Customer) Experience\n  \n  \n\n* Interact with guests to ensure a great guest experience in a manner that values guests' time.\n* Assess guests' needs to provide customized, effective purchase and return solutions and support.\n* Provide technical product education by articulating the value and benefit of the product.\n* Facilitate a seamless end\\-to\\-end guest experience by conducting accurate and timely guest transactions and executing market\\-relevant omnichannel programs (e.g., buy online/pickup in store, phone sales, and ship from store options) according to company standards.\n* Move dynamically on the floor to continuously engage with guests and attend to guest or store needs.\n* Receive guest feedback and partner with store leadership to take appropriate action and \"make it right\" for guests.\n\n\nWorking with Others\n  \n  \n\n* Contribute to a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive and engaging experience for all team members and guests.\n* Establish supportive and productive relationships with all team members.\n* Collaborate with team members to ensure optimal guest experience and support store operations.\n\n\nOperations\n  \n  \n\n* Perform product presentation tasks (e.g., put items back in place, restock or add depleted items to the floor from inventory, destock or relocate items) according to company standards.\n* Use in\\-store technology to support store operations and provide positive guest experiences.\n* Perform cleaning tasks as needed throughout the shift to maintain the luxury environment of the store.\n* Understand and adhere to people safety policies and procedures to maintain a safe work environment.\n* Perform work in accordance with applicable policies, procedures, and laws or regulations.\n\n\nKey Skills \\& Core Values You Bring\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity/Honesty: Behaves in an honest, fair, and ethical manner\n* Guest Experience: Enjoys working and connecting with, understanding, and helping guests\n* Personal Responsibility: Accepts responsibility/accountability for actions; is dependable\n* Self\\-Awareness: Is aware of how words or actions may be perceived by or affect others\n* Collaboration and Teamwork: Works productively with others to achieve goals; seeks diverse perspectives\n* Enthusiasm: Is enthusiastic about one's own work; looks for ways to make work fun and engaging\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must be 18 years of age or older\n* Must have proof of the Right to Work and evidence relating to associated local legislative requirements (EMEA only)\n* Must have the ability to travel to assigned store with own transportation methods\n\n\nAvailability\n  \n  \n\n* Willing to work a flexible schedule including evenings, weekends, and holidays\n\n\nOther Willingness Requirements\n  \n  \n\n* Willing to work in an environment with bright lights and loud music\n* Willing to move through a store for most of a shift to help guests and accomplish work\n* Willing to move boxes weighing up to 30 lbs (13\\.6 kg)\n* Willing to work as part of a team and also complete some work independently\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma, GED, or equivalent\n\n\nIn keeping with our mission, please connect with us at accommodations@lululemon.com if you have questions about how your unique abilities may translate to the requirements for this role, with or without a reasonable accommodation. In your email, please include the position title, the location of the position and the nature of your question or request.\n  \n  \n\nCompensation \\& Benefits Package\n  \n  \n\nOur educator base pay ranges from $23\\.00 \\- $26\\.46/hour with a target bonus of an additional $3 per hour, bringing our total target compensation range between $26\\.00 \\- $29\\.46/ hour, depending on location and level of experience. Our pay\\-for\\-performance bonus philosophy supports our employees by recognizing exceptional individual and team performance.\n  \n  \n\nAt lululemon, our care and investment in our employees does not stop at compensation. Investing in our people is a top priority. We believe that when life works, work works. With extended health and mental health plans, paid time off, savings plans, generous employee discounts, fitness \\& yoga classes, parenthood top up and more, our benefits support our values and recognize our teams for their performance and dedication. Additionally, our personal and professional development programs include people networks, parenthood support programs, mentorships, and leadership series programming to help employees grow their career.\n  \n  \n\n**Note:** Availability of the benefits and perks may be subject to your location \\& employment type and may have certain eligibility requirements. The Company reserves the right to alter these benefits and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 23.0,
        "max_amount": 29.0,
        "currency": "USD"
      },
      "date_posted": "2024-09-18",
      "emails": [
        "accommodations@lululemon.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-84024db3c1ddc4d1",
      "title": "Assistant Manager, Guest Experience",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=84024db3c1ddc4d1",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Assistant-Manager-Guest-Experience-SOHO/42072",
      "location": {
        "country": "US",
        "city": "New York",
        "state": "NY"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Assistant Manager, Guest Experience role is an essential part of the store leadership team, ensuring our team members and guests (i.e., customers) receive a quality experience in our stores every day. Assistant Managers, Guest Experience are responsible for leading from the floor to build, manage, and develop team members. Assistant Managers, Guest Experience create an environment and a team culture where people feel a deep sense of belonging and have the opportunity to grow. As a result, they ensure their team delivers outstanding guest experience in line with company values and directives.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\nLeadership and People Management\n  \n  \n\n* Create and foster a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive, productive, and fun experience for all team members.\n* Engage team members by helping them understand how their work supports the success of the store and of lululemon overall.\n* Implement the Store Manager's People vision for the store and cascade to team members.\n* Support Store Manager in hiring and building a strong and diverse team that includes team members with various experiences, backgrounds, and skillsets to drive key results and performance.\n* Support ongoing learning and development of team members consistently and equitably by providing direct feedback, coaching, mentoring, and continuous development check\\-ins.\n* Lead performance management activities, including direct feedback and continuous check\\-ins, facilitating team acknowledgement and rewards, managing performance documentation, and addressing performance concerns.\n* Address employee concerns or issues, including knowing when to partner with internal support to take appropriate action.\n\n\nGuest Experience and Community\n  \n  \n\n* Lead an exceptional guest (customer) experience on the floor through assessing the level of guest connection and technical product education and supporting team members to address gaps through feedback and coaching.\n* Provide retail floor leadership to team members, including making in\\-the\\-moment decisions to maintain efficiency and effectiveness of retail floor coverage and operations.\n* Resolve guest feedback and address emergent issues, including guest escalations and urgent requests, helping to \"make it right\" for guests.\n\n\nOperations, Product, and Strategy\n  \n  \n\n* Partner with other managers to review business data and metrics (e.g., profit and loss \\[P\\&L] statement) to inform planning processes (e.g., quarterly business review, sales planning, and hiring strategy).\n* Maintain strategic product presentation/visual merchandising by ensuring product recovery, restock (e.g., pant wall, size store), destock, or minor visual merchandizing changes are accomplished.\n* Open and close the store in accordance with the opening and closing procedures.\n* Understand and adhere to people safety policies and procedures to maintain a safe work environment.\n* Perform work in accordance with applicable policies, procedures, and laws or regulations.\n\n\nBudget Responsibility\n  \n  \n\n* Accountable for delegated aspects of controllable budget and labor hours\n\n\nPeople Management\n  \n  \n\n* Leadership role directly responsible for subset of store employees as delegated by Store Manager\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Leadership: Is able and desires to lead and inspire others; motivates, empowers, develops, and directs people as they work\n* Guest Experience: Actively creates an inclusive, high\\-caliber experience and connection for every guest through team members\n* Team Building: Creates and develops teams that maximize accomplishments; encourages unique contributions and different perspectives\n* Decision Making/Problem Solving: Uses logic and reasoning to evaluate alternatives and make effective, timely decisions\n* Strategic Thinking: Sets strategies that are aligned to vision and values of the company to achieve goals/vision/further the mission; considers the 'big picture' implications of decisions\n* Change Management Leadership: Leads others through change processes and uncertainty\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* Work occurs on a variable schedule which could include early mornings, mornings, afternoons, evenings, late nights or overnights as well as weekends and holidays\n\n\nExperience\n  \n  \n\n* 1 year people management experience\n* 1 year leadership experience, including experience managing business operations and administration and managing projects or processes\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma, GED, or equivalent\n* Education: Bachelor's degree or equivalent\n* Experience: 1 year retail or sales specific management experience\n* Experience: 1 year recruiting, hiring, or training employees\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work occurs in an environment with bright lights and loud music\n* Work is accomplished as part of a team and also independently\n* Work may involve managing conflict or mediating problems between others or deescalating guest issues\n* Work involves reaching out to meet and build relationships with strangers/new people, and to strengthen existing community partnerships\n* Work is sometimes conducted on a computer or other technical devices, including to meet with others virtually\n* Work involves moving through a store for most of a shift to help guests and accomplish work, but can also involve sitting for extended periods of time (i.e., more than 1 hour)\n* Work may occasionally involve moving boxes weighing up to 30 lbs (13\\.6 kg)\n\n\nCompensation \\& Benefits Package\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional team performance. The base pay range for this position is from $26\\.26\\- $35\\.54/hour subject to minimum wage in the location. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. This position has a target bonus of an additional 25%, subject to certain requirements and the Company's discretion, bringing the total target compensation range between $32\\.83\\- $44\\.43/ hour.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 26.0,
        "max_amount": 44.0,
        "currency": "USD"
      },
      "date_posted": "2024-09-03",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-76aa558f0d7b8ef6",
      "title": "Assistant Manager, Guest Experience",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=76aa558f0d7b8ef6",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Assistant-Manager-Guest-Experience-Promenade-at-Chenal/45510",
      "location": {
        "country": "US",
        "city": "Little Rock",
        "state": "AR"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Assistant Manager, Guest Experience role is an essential part of the store leadership team, ensuring our team members and guests (i.e., customers) receive a quality experience in our stores every day. Assistant Managers, Guest Experience are responsible for leading from the floor to build, manage, and develop team members. Assistant Managers, Guest Experience create an environment and a team culture where people feel a deep sense of belonging and have the opportunity to grow. As a result, they ensure their team delivers outstanding guest experience in line with company values and directives.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\nLeadership and People Management\n  \n  \n\n* Create and foster a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive, productive, and fun experience for all team members.\n* Engage team members by helping them understand how their work supports the success of the store and of lululemon overall.\n* Implement the Store Manager's People vision for the store and cascade to team members.\n* Support Store Manager in hiring and building a strong and diverse team that includes team members with various experiences, backgrounds, and skillsets to drive key results and performance.\n* Support ongoing learning and development of team members consistently and equitably by providing direct feedback, coaching, mentoring, and continuous development check\\-ins.\n* Lead performance management activities, including direct feedback and continuous check\\-ins, facilitating team acknowledgement and rewards, managing performance documentation, and addressing performance concerns.\n* Address employee concerns or issues, including knowing when to partner with internal support to take appropriate action.\n\n\nGuest Experience and Community\n  \n  \n\n* Lead an exceptional guest (customer) experience on the floor through assessing the level of guest connection and technical product education and supporting team members to address gaps through feedback and coaching.\n* Provide retail floor leadership to team members, including making in\\-the\\-moment decisions to maintain efficiency and effectiveness of retail floor coverage and operations.\n* Resolve guest feedback and address emergent issues, including guest escalations and urgent requests, helping to \"make it right\" for guests.\n\n\nOperations, Product, and Strategy\n  \n  \n\n* Partner with other managers to review business data and metrics (e.g., profit and loss \\[P\\&L] statement) to inform planning processes (e.g., quarterly business review, sales planning, and hiring strategy).\n* Maintain strategic product presentation/visual merchandising by ensuring product recovery, restock (e.g., pant wall, size store), destock, or minor visual merchandizing changes are accomplished.\n* Open and close the store in accordance with the opening and closing procedures.\n* Understand and adhere to people safety policies and procedures to maintain a safe work environment.\n* Perform work in accordance with applicable policies, procedures, and laws or regulations.\n\n\nBudget Responsibility\n  \n  \n\n* Accountable for delegated aspects of controllable budget and labor hours\n\n\nPeople Management\n  \n  \n\n* Leadership role directly responsible for subset of store employees as delegated by Store Manager\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Leadership: Is able and desires to lead and inspire others; motivates, empowers, develops, and directs people as they work\n* Guest Experience: Actively creates an inclusive, high\\-caliber experience and connection for every guest through team members\n* Team Building: Creates and develops teams that maximize accomplishments; encourages unique contributions and different perspectives\n* Decision Making/Problem Solving: Uses logic and reasoning to evaluate alternatives and make effective, timely decisions\n* Strategic Thinking: Sets strategies that are aligned to vision and values of the company to achieve goals/vision/further the mission; considers the 'big picture' implications of decisions\n* Change Management Leadership: Leads others through change processes and uncertainty\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* Work occurs on a variable schedule which could include early mornings, mornings, afternoons, evenings, late nights or overnights as well as weekends and holidays\n\n\nExperience\n  \n  \n\n* 1 year people management experience\n* 1 year leadership experience, including experience managing business operations and administration and managing projects or processes\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma, GED, or equivalent\n* Education: Bachelor's degree or equivalent\n* Experience: 1 year retail or sales specific management experience\n* Experience: 1 year recruiting, hiring, or training employees\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work occurs in an environment with bright lights and loud music\n* Work is accomplished as part of a team and also independently\n* Work may involve managing conflict or mediating problems between others or deescalating guest issues\n* Work involves reaching out to meet and build relationships with strangers/new people, and to strengthen existing community partnerships\n* Work is sometimes conducted on a computer or other technical devices, including to meet with others virtually\n* Work involves moving through a store for most of a shift to help guests and accomplish work, but can also involve sitting for extended periods of time (i.e., more than 1 hour)\n* Work may occasionally involve moving boxes weighing up to 30 lbs (13\\.6 kg)\n\n\nCompensation \\& Benefits Package\n  \n**Base Pay Range:** $22\\.30\\- $30\\.17/hour, subject to minimum wage in the location\n  \n**Target Bonus:** 25%\n  \n**Total Target Base Pay Range:** $27\\.88\\- $37\\.71/hour\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our offerings, employees in this position are eligible for our competitive bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 22.0,
        "max_amount": 30.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-07",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-fe61878656d3790b",
      "title": "Community Specialist",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=fe61878656d3790b",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Community-Specialist-Northshore-Mall/43438",
      "location": {
        "country": "US",
        "city": "Peabody",
        "state": "MA"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Community Specialist is responsible for executing the store's community strategy, which includes engaging with the community through relationship building, events, and other activities including supporting lululemon product seeding and attending local studios. They develop and sustain local key relationships with lululemon Ambassadors and other relevant and influential community partners providing synergistic value. The Community Specialist also delivers a world\\-class guest (i.e., customer) experience when working on the floor in the store, bringing their community perspective into the guest connection.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\n* Collaborate with store leadership to bring Community strategy, through the pillars of community foundations, and guest experience to life.\n* Establish and manage local key relationships (e.g., Ambassadors, Sweat Collective, studio owners, lululemon Studio partner studios) to increase new guest acquisition and guest retention.\n* Engage with the local community to identify future Ambassador or partner opportunities and to increase the store's standing as a community hub.\n* Connect with guests on the floor to assess their unique needs, provide technical product education, and incorporate omnichannel programs into a seamless end\\-to\\-end guest experience.\n* Attend, support, and/or host local and regional Community events.\n* Execute the product seeding strategy through community partners and Ambassadors.\n* Review community relevant business data and metrics to identify and share insights and recommendations with store leadership regarding Community events, projects, or initiatives.\n* Contribute to a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive, productive, and fun experience for all team members.\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* The work schedule can vary based on store needs\n* Shifts are typically scheduled: mornings, afternoons, evenings, weekends, and holidays\n* In addition, during peak timeframes, special events, or other circumstances, the schedule may include early mornings or late nights/overnights for some employees\n\n\nExperience\n  \n  \n\n* 1 year of cumulative experience in customer service or engagement, grassroots marketing, brand engagement or community building\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma/GED/equivalent, or above\n* Experience (not necessarily the focus of a role): building or maintaining relationships with clients, groups, or partners; motivating team members to accomplish goals or activities\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Connection and Partnership: Is able to build professional relationships with team members and guests; develops partnerships within and across the company and community\n* Planning and Organizing: Plans and organizes work in a clear and efficient manner to ensure completion in alignment with priorities\n* Collaboration and Teamwork: Works productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\n* Learner Mindset: Is curious, open to feedback, and pursues learning and progressing new skills to continually grow and develop\n* Self\\-Leadership: Takes personal responsibility for own actions; inspires others to buy\\-in and actively support goals and initiatives\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work can occur in various locations and environments, including moving through the store with bright lights and loud music, and at locations throughout the community\n* Work involves building relationships with new people, strengthening community partnerships, and participating in events related to fitness or movement\n* Work is accomplished as part of a team, sometimes independently, and sometimes using a computer or other technical devices\n\n\nCompensation \\& Benefits Package\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional team performance. The base pay range for this position is from $20\\.50\\- $23\\.58/hour subject to minimum wage in the location. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. This position has a target bonus of an additional $3 per hour, subject to certain requirements and the Company's discretion, bringing the total target compensation range between $23\\.50\\- $26\\.58/ hour.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 20.0,
        "max_amount": 26.0,
        "currency": "USD"
      },
      "date_posted": "2024-09-27",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-5816f4e0ea50be20",
      "title": "Visual Merchandising Specialist",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=5816f4e0ea50be20",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Visual-Merchandising-Specialist-Reston-Town-Center/44823",
      "location": {
        "country": "US",
        "city": "Reston",
        "state": "VA"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Visual Merchandising Specialist is responsible for ensuring company directed visual merchandising (VM) strategies and standards are brought to life. This role executes product presentation, styling, and in\\-store marketing elements to optimize guests' (i.e., customers) experiences. The Visual Merchandising Specialist implements key product stories, product placement strategies, and sell\\-through strategies by managing merchandise changes as well as product display and mannequin styling, in accordance with company standards and adapted to the individual store need. They also deliver a world\\-class guest experience on the floor.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\n* Collaborate with store leadership to bring VM presentation and guest experience to life on the floor.\n* Optimize guests' experiences through consistent implementation of brand standards in key product stories, product placement strategies, and intuitive store navigation for a world\\-class, guest\\-centric experience.\n* Execute powerful and visually appealing product presentation in accordance with company standards to enhance the guest experience and drive store sell through.\n* Execute VM flips, including window activations, mannequin styling, signage and label updates, and seasonal or weekly merchandise changes as well as company\\-driven product initiatives and campaigns, as directed.\n* Connect with guests on the floor to assess their unique needs, provide technical product education, and incorporate omnichannel programs into a seamless end\\-to\\-end guest experience.\n* Provide direct feedback and in\\-the\\-moment training related to brand standards, product placement, and visual display techniques to support team members ongoing learning and development.\n* Contribute to a respectful and inclusive team environment by establishing supportive working relationships with team members.\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* The work schedule can vary based on store needs\n* Shifts are typically scheduled: mornings, afternoons, evenings, weekends, and holidays\n* In addition, during peak timeframes, special events, or other circumstances, the schedule may include early mornings or late nights/overnights for some employees\n\n\nExperience\n  \n  \n\n* 1 year of retail or sales work experience\n* Some education or experience with visual merchandising, fashion merchandising, graphic design, interior design, space planning or related field\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma/GED/equivalent, or above; training or degree in design or a related field\n* Experience (not necessarily the focus of a role): retail product merchandising, visual merchandising, or inventory management; managing projects, processes, or administering part of a business operation\n* For Experiential stores with food/beverage service only: Food safety and/or liquor service certification\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Visual Design and Styling: Understands and is interested in color theory, visual display composition, and styling/placement techniques and how to apply that knowledge\n* Collaboration and Teamwork: Works productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\n* Attention to Detail: Is careful about detail and thorough in completing work tasks\n* Self\\-Leadership: Takes personal responsibility for own actions; inspires others to buy\\-in and actively support goals and initiatives\n* Adaptability/Agility: Navigates uncertainty and ambiguity and can change priorities in a fast\\-paced environment; recovers quickly from setbacks\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work involves moving through the store, sometimes with bright lights and loud music in the front of house\n* Work is accomplished as part of a team, sometimes independently, and sometimes using a computer or other technical devices\n* Work involves moving boxes, fixtures and mannequins weighing up to 30 lbs (13\\.6 kg) as well as bending, reaching, stretching, and sometimes using ladders to reach materials or adjust presentation elements\n\n\nCompensation \\& Benefits Package\n  \n**Base Pay Range:** $20\\.50\\- $23\\.58/hour, subject to minimum wage in the location\n  \n**Target Bonus:** $3\\.00/hour\n  \n**Total Target Base Pay Range:** $23\\.50\\- $26\\.58/hour\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our offerings, employees in this position are eligible for our competitive bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 20.0,
        "max_amount": 23.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-03",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-f63bd54635ebb442",
      "title": "Guest Experience Lead",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=f63bd54635ebb442",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Guest-Experience-Lead-MOSAIC/45362",
      "location": {
        "country": "US",
        "city": "Fairfax",
        "state": "VA"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Guest Experience Lead is responsible for ensuring all guests (i.e., customers) receive a quality in\\-store experience. They do this by overseeing or providing technical product education that articulates the value of our product and brand to meet the unique needs of each guest. The Guest Experience Lead is part of the store leadership team, responsible for driving store performance on the floor through guest experience and team achievement of daily sales or unit targets. Guest Experience Leads provide input to team member performance evaluations, recommendations into store hiring decisions, and act as Supervisor on Duty (SOD) when leading the floor.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\n* Bring the lululemon guest experience framework to life, leading from the floor to establish an exceptional and inclusive guest experience.\n* Continuously assess the level of guest connection and technical product education, ensuring every single guest receives technical product education and assisting the guests when needed (e.g., when other team members are unavailable).\n* Move dynamically and lead from the floor as the Supervisor on Duty to assess and fulfill the needs of the business, team, and guests.\n* Conduct preparation activities to ensure in\\-store readiness for guests and ensure the operational excellence of the store is maintained throughout shift.\n* Open and close the store in accordance with the opening and closing procedures.\n* Review and interpret daily business data and metrics to track progress toward sales goals and motivate team to drive business results.\n* Participate in the store's hiring process, including recruitment, selection and hiring recommendations, onboarding, and training.\n* Address team member performance and support their ongoing learning and development by providing direct feedback and in\\-the\\-moment recognition, coaching, demonstrations, and hands\\-on experiences.\n* Contribute to a respectful and inclusive team by establishing supportive working relationships and engaging with team members, creating a fun and productive environment.\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* The work schedule can vary based on store needs\n* Shifts are typically scheduled: mornings, afternoons, evenings, weekends, and holidays\n* In addition, during peak timeframes, special events, or other circumstances, the schedule may include early mornings or late nights/overnights for some team members\n\n\nExperience\n  \n  \n\n* 1 year retail or customer experience (e.g., guest resolution, navigating difficult conversations)\n* Some experience in leading, mentoring, or delegating with others\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma/GED/equivalent, or above\n* Experience: 1 year of retail/sales leadership experience (supervisor or people management not necessary; examples: leading delegated assignments/tasks, mentoring or assisting peers)\n* For Experiential stores with food/beverage service only: Food safety and/or liquor service certification\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Guest Experience: Actively creates an inclusive, high\\-caliber experience and connection for every guest through team members\n* Leadership: Is able and desires to lead and inspire others; motivates, empowers, develops, and directs people as they work\n* Collaboration and Teamwork: Works productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\n* Decision Making/Problem Solving: Uses logic and reasoning to evaluate alternatives and make effective, timely decisions\n* Adaptability/Agility: Navigates uncertainty and ambiguity and can change priorities in a fast\\-paced environment; recovers quickly from setbacks\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work involves moving through the store with bright lights and loud music\n* Work is accomplished as part of a team, sometimes independently, and sometimes on a computer or other technical devices\n* Work may occasionally involve moving boxes weighing up to 30 lbs (13\\.6 kg)\n* For Experiential stores with food/beverage service only: Work may involve using industrial kitchen equipment and exposure to heat in order to prepare food or beverages\n\n\nCompensation \\& Benefits Package\n  \n  \n\n**Base Pay Range:** $22\\.00 \\- $25\\.30/hour, subject to minimum wage in the location\n  \n  \n\n**Target Bonus:** $3\\.00/hour\n  \n  \n\n**Total Target Base Pay Range:** $25\\.00 \\- $28\\.30/hour\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our offerings, employees in this position are eligible for our competitive bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 22.0,
        "max_amount": 25.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-02",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-5d24a9862cc98f20",
      "title": "Retail Sales Associate",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=5d24a9862cc98f20",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Educator-Village-at-Totem-Lake/41890",
      "location": {
        "country": "US",
        "city": "Kirkland",
        "state": "WA"
      },
      "description": "Who We Are:  \n\n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.  \n\n\nJob Summary:  \n\n\nThe Educator role is the foundation of our success as an organization. Educators are experts in creating world\\-class customer service, or guest experience, in our retail stores. They are responsible for engaging and connecting with our guests, sharing top\\-quality product education, and speaking authentically about our community and culture.  \n\n\nKey Responsibilities of the Job  \n\n\nGuest (i.e., Customer) Experience  \n\n\n* Interact with guests to ensure a great guest experience in a manner that values guests’ time.\n* Assess guests’ needs to provide customized, effective purchase and return solutions and support.\n* Provide technical product education by articulating the value and benefit of the product.\n* Facilitate a seamless end\\-to\\-end guest experience by conducting accurate and timely guest transactions and executing market\\-relevant omnichannel programs (e.g., buy online/pickup in store, phone sales, and ship from store options) according to company standards.\n* Move dynamically on the floor to continuously engage with guests and attend to guest or store needs.\n* Receive guest feedback and partner with store leadership to take appropriate action and \"make it right\" for guests.\n\nWorking with Others  \n\n\n* Contribute to a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive and engaging experience for all team members and guests.\n* Establish supportive and productive relationships with all team members.\n* Collaborate with team members to ensure optimal guest experience and support store operations.\n\nOperations  \n\n\n* Perform product presentation tasks (e.g., put items back in place, restock or add depleted items to the floor from inventory, destock or relocate items) according to company standards.\n* Use in\\-store technology to support store operations and provide positive guest experiences.\n* Perform cleaning tasks as needed throughout the shift to maintain the luxury environment of the store.\n* Understand and adhere to people safety policies and procedures to maintain a safe work environment.\n* Perform work in accordance with applicable policies, procedures, and laws or regulations.\n\nKey Skills \\& Core Values You Bring  \n\n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity/Honesty: Behaves in an honest, fair, and ethical manner\n* Guest Experience: Enjoys working and connecting with, understanding, and helping guests\n* Personal Responsibility: Accepts responsibility/accountability for actions; is dependable\n* Self\\-Awareness: Is aware of how words or actions may be perceived by or affect others\n* Collaboration and Teamwork: Works productively with others to achieve goals; seeks diverse perspectives\n* Enthusiasm: Is enthusiastic about one’s own work; looks for ways to make work fun and engaging\n\nJob Requirements  \n\n\nEligibility  \n\n\n* Must be legally authorized to work in the country in which the store is located\n* Must be 18 years of age or older\n* Must have proof of the Right to Work and evidence relating to associated local legislative requirements (EMEA only)\n* Must have the ability to travel to assigned store with own transportation methods\n\nAvailability  \n\n\n* Willing to work a flexible schedule including evenings, weekends, and holidays\n\nOther Willingness Requirements  \n\n\n* Willing to work in an environment with bright lights and loud music\n* Willing to move through a store for most of a shift to help guests and accomplish work\n* Willing to move boxes weighing up to 30 lbs (13\\.6 kg)\n* Willing to work as part of a team and also complete some work independently\n\nJob Assets (i.e., nice to have; not required)  \n\n\n* Education: High school diploma, GED, or equivalent\n\nIn keeping with our mission, please connect with us at accommodations@lululemon.com if you have questions about how your unique abilities may translate to the requirements for this role, with or without a reasonable accommodation. In your email, please include the position title, the location of the position and the nature of your question or request.  \n\n\nCompensation \\& Benefits Package  \n\n\nlululemon’s compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional team performance. The base pay range for this position is from $18\\.50\\- $21\\.29/hour subject to minimum wage in the location. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. This position has a target bonus of an additional $3 per hour, subject to certain requirements and the Company’s discretion, bringing the total target compensation range between $21\\.50\\- $24\\.29/ hour.  \n\n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:  \n\n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\nNote: The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.  \n\n\nPay: $18\\.50 \\- $24\\.29 per hour  \n\n\nWork Location: In person",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 18.0,
        "max_amount": 24.0,
        "currency": "USD"
      },
      "date_posted": "2024-08-28",
      "emails": [
        "accommodations@lululemon.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-af4296066249b738",
      "title": "Educator",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=af4296066249b738",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Educator-Church-St-/45308",
      "location": {
        "country": "US",
        "city": "Burlington",
        "state": "VT"
      },
      "description": "**Who We Are:**  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\n**Job Summary:**  \n\nThe Educator role is the foundation of our success as an organization. Educators are experts in creating world\\-class customer service, or guest experience, in our retail stores. They are responsible for engaging and connecting with our guests, sharing top\\-quality product education, and speaking authentically about our community and culture.\n  \n  \n\nKey Responsibilities of the Job\n  \n  \n\nGuest (i.e., Customer) Experience\n  \n  \n\n* Interact with guests to ensure a great guest experience in a manner that values guests' time.\n* Assess guests' needs to provide customized, effective purchase and return solutions and support.\n* Provide technical product education by articulating the value and benefit of the product.\n* Facilitate a seamless end\\-to\\-end guest experience by conducting accurate and timely guest transactions and executing market\\-relevant omnichannel programs (e.g., buy online/pickup in store, phone sales, and ship from store options) according to company standards.\n* Move dynamically on the floor to continuously engage with guests and attend to guest or store needs.\n* Receive guest feedback and partner with store leadership to take appropriate action and \"make it right\" for guests.\n\n\nWorking with Others\n  \n  \n\n* Contribute to a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive and engaging experience for all team members and guests.\n* Establish supportive and productive relationships with all team members.\n* Collaborate with team members to ensure optimal guest experience and support store operations.\n\n\nOperations\n  \n  \n\n* Perform product presentation tasks (e.g., put items back in place, restock or add depleted items to the floor from inventory, destock or relocate items) according to company standards.\n* Use in\\-store technology to support store operations and provide positive guest experiences.\n* Perform cleaning tasks as needed throughout the shift to maintain the luxury environment of the store.\n* Understand and adhere to people safety policies and procedures to maintain a safe work environment.\n* Perform work in accordance with applicable policies, procedures, and laws or regulations.\n\n\nKey Skills \\& Core Values You Bring\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity/Honesty: Behaves in an honest, fair, and ethical manner\n* Guest Experience: Enjoys working and connecting with, understanding, and helping guests\n* Personal Responsibility: Accepts responsibility/accountability for actions; is dependable\n* Self\\-Awareness: Is aware of how words or actions may be perceived by or affect others\n* Collaboration and Teamwork: Works productively with others to achieve goals; seeks diverse perspectives\n* Enthusiasm: Is enthusiastic about one's own work; looks for ways to make work fun and engaging\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must be 18 years of age or older\n* Must have proof of the Right to Work and evidence relating to associated local legislative requirements (EMEA only)\n* Must have the ability to travel to assigned store with own transportation methods\n\n\nAvailability\n  \n  \n\n* Willing to work a flexible schedule including evenings, weekends, and holidays\n\n\nOther Willingness Requirements\n  \n  \n\n* Willing to work in an environment with bright lights and loud music\n* Willing to move through a store for most of a shift to help guests and accomplish work\n* Willing to move boxes weighing up to 30 lbs (13\\.6 kg)\n* Willing to work as part of a team and also complete some work independently\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma, GED, or equivalent\n\n\nIn keeping with our mission, please connect with us at accommodations@lululemon.com if you have questions about how your unique abilities may translate to the requirements for this role, with or without a reasonable accommodation. In your email, please include the position title, the location of the position and the nature of your question or request.\n  \n  \n\nCompensation \\& Benefits Package\n  \n**Base Pay Range:** $16\\.00\\- $18\\.40/hour, subject to minimum wage in the location\n  \n**Target Bonus:** $3\\.00/hour\n  \n**Total Target Base Pay Range:** $19\\.00\\- $21\\.40/hour\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our offerings, employees in this position are eligible for our competitive bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 16.0,
        "max_amount": 21.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-31",
      "emails": [
        "accommodations@lululemon.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-bc25a0c14499cb9d",
      "title": "Assistant Manager, Operations",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=bc25a0c14499cb9d",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Assistant-Manager-Operations-Mayfair-contract/45228",
      "location": {
        "country": "US",
        "city": "Wauwatosa",
        "state": "WI"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Assistant Manager, Operations role is an essential part of the store leadership team and is responsible for making sure our retail business runs smoothly and successfully. Assistant Managers, Operations manage business enablers (including financial, profit and loss \\[P\\&L], budget, expenses, and cash) and ensure inventory, supplies, vendor relationships, technology, and facilities are maintained and maximized. They are responsible for writing the store's weekly schedule and accomplishing people\\-related administrative activities (including completing payroll and other documentation). Assistant Managers, Operations also execute company\\-driven operations\\-focused projects and initiatives at the store level.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\nOperations, Product, and Strategy\n  \n  \n\n* Implement the Store Manager's Operations vision for the store and cascade to team members.\n* Plan and prepare weekly team member schedule according to labor requirements, availability, and budget considerations.\n* Move dynamically on the retail floor to assess and fulfill the needs of the business, team, and guests.\n* Review, monitor, and partner with Store Manager to manage the budget and other business data and metrics (e.g., P\\&L statement, expenses) and inform planning processes (e.g., quarterly business review and sales planning).\n* Provide retail floor leadership to team members, including planning retail floor coverage and making decisions to maintain efficiency and effectiveness of retail floor operations.\n* Support sell\\-through management by ensuring accuracy of inventory counts and coordinating labor hours to efficiently receive product deliveries.\n* Execute company\\-level operations\\-focused directives, projects, and initiatives (e.g., from the SSC).\n* Understand and adhere to people safety policies and procedures to maintain a safe work environment.\n* Perform work in accordance with applicable policies, procedures, and laws or regulations.\n\n\nLeadership and People\n  \n  \n\n* Create and foster a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive, productive, and fun experience for all team members.\n* Perform administrative actions to support team members, including completing payroll, approving vacation and time off requests, approving shift swaps, and other documentation according to policies and procedures.\n* Inform people managers of projected team growth needs to support the building of a strong and diverse team based on operational trends and results.\n* Establish supportive and productive relationships with all team members, focusing on personal and professional development.\n\n\nGuest Experience and Community\n  \n  \n\n* Facilitate a seamless end\\-to\\-end guest experience by monitoring the incorporation of omnichannel programs (e.g., in\\-store guest transactions, buy online pickup in store, phone sales, and ship from store).\n* Collaborate with team members to ensure an optimal guest experience that values guests' time and supports store operations.\n* Resolve guest feedback and address issues, including guest escalations and urgent requests, helping to \"make it right\" for guests.\n\n\nBudget Responsibility\n  \n  \n\n* Accountable for delegated aspects of controllable budget and labor hours\n\n\nPeople Management\n  \n  \n\n* Leadership role indirectly responsible for subset of store employees as delegated by Store Manager\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Adaptability/Agility: Navigates uncertainty and ambiguity and can change priorities in a fast\\-paced environment; recovers quickly from setbacks\n* Leadership: Is able and desires to lead and inspire others; motivates, empowers, develops, and directs people as they work\n* Collaboration and Teamwork: Works productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\n* Decision Making/Problem Solving: Identifies opportunities for improvement; evaluates alternatives and makes effective, timely decisions\n* Strategic Thinking: Considers the lasting implications of decisions; sets a plan and makes decisions aligned with company strategy, vision, and values\n* Business Acumen: Is able to quickly understand and address business information (e.g., profit and loss statements, budgets and sales forecasts, retail strategy and approaches)\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* Work occurs on a variable schedule which could include early mornings, mornings, afternoons, evenings, late nights or overnights as well as weekends and holidays\n\n\nExperience\n  \n  \n\n* 1 year experience managing business operations and administration, including experience with scheduling and management of designated labor hours and managing projects or processes\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma, GED, or equivalent\n* Education: Bachelor's degree or equivalent\n* Experience: 1 year retail or sales specific management experience\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work occurs in an environment with bright lights and loud music\n* Work is accomplished as part of a team and also independently\n* Work may involve managing conflict or mediating problems between others or deescalating guest issues\n* Work involves reaching out to meet and build relationships with strangers/new people, and to strengthen existing community partnerships\n* Work is sometimes conducted on a computer or other technical devices, including to meet with others virtually\n* Work involves moving through a store for most of a shift to help guests and accomplish work, but can also involve sitting for extended periods of time (i.e., more than 1 hour)\n* Work may occasionally involve moving boxes weighing up to 30 lbs (13\\.6 kg)\n\n\nCompensation \\& Benefits Package\n  \n**Base Pay Range:** $22\\.30\\- $30\\.17/hour, subject to minimum wage in the location\n  \n**Target Bonus:** 25%\n  \n**Total Target Base Pay Range:** $27\\.88\\- $37\\.71/hour\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our offerings, employees in this position are eligible for our competitive bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 22.0,
        "max_amount": 30.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-26",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-7cc7ce383d55c3f4",
      "title": "Community Specialist",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=7cc7ce383d55c3f4",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Community-Specialist-Staten-Island-Mall-Pop-Up/44734",
      "location": {
        "country": "US",
        "city": "Staten Island",
        "state": "NY"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Community Specialist is responsible for executing the store's community strategy, which includes engaging with the community through relationship building, events, and other activities including supporting lululemon product seeding and attending local studios. They develop and sustain local key relationships with lululemon Ambassadors and other relevant and influential community partners providing synergistic value. The Community Specialist also delivers a world\\-class guest (i.e., customer) experience when working on the floor in the store, bringing their community perspective into the guest connection.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\n* Collaborate with store leadership to bring Community strategy, through the pillars of community foundations, and guest experience to life.\n* Establish and manage local key relationships (e.g., Ambassadors, Sweat Collective, studio owners, lululemon Studio partner studios) to increase new guest acquisition and guest retention.\n* Engage with the local community to identify future Ambassador or partner opportunities and to increase the store's standing as a community hub.\n* Connect with guests on the floor to assess their unique needs, provide technical product education, and incorporate omnichannel programs into a seamless end\\-to\\-end guest experience.\n* Attend, support, and/or host local and regional Community events.\n* Execute the product seeding strategy through community partners and Ambassadors.\n* Review community relevant business data and metrics to identify and share insights and recommendations with store leadership regarding Community events, projects, or initiatives.\n* Contribute to a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive, productive, and fun experience for all team members.\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* The work schedule can vary based on store needs\n* Shifts are typically scheduled: mornings, afternoons, evenings, weekends, and holidays\n* In addition, during peak timeframes, special events, or other circumstances, the schedule may include early mornings or late nights/overnights for some employees\n\n\nExperience\n  \n  \n\n* 1 year of cumulative experience in customer service or engagement, grassroots marketing, brand engagement or community building\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma/GED/equivalent, or above\n* Experience (not necessarily the focus of a role): building or maintaining relationships with clients, groups, or partners; motivating team members to accomplish goals or activities\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Connection and Partnership: Is able to build professional relationships with team members and guests; develops partnerships within and across the company and community\n* Planning and Organizing: Plans and organizes work in a clear and efficient manner to ensure completion in alignment with priorities\n* Collaboration and Teamwork: Works productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\n* Learner Mindset: Is curious, open to feedback, and pursues learning and progressing new skills to continually grow and develop\n* Self\\-Leadership: Takes personal responsibility for own actions; inspires others to buy\\-in and actively support goals and initiatives\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work can occur in various locations and environments, including moving through the store with bright lights and loud music, and at locations throughout the community\n* Work involves building relationships with new people, strengthening community partnerships, and participating in events related to fitness or movement\n* Work is accomplished as part of a team, sometimes independently, and sometimes using a computer or other technical devices\n\n\nCompensation \\& Benefits Package\n  \n**Base Pay Range:** $20\\.50\\- $23\\.58/hour, subject to minimum wage in the location\n  \n**Target Bonus:** $3\\.00/hour\n  \n**Total Target Base Pay Range:** $23\\.50\\- $26\\.58/hour\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our offerings, employees in this position are eligible for our competitive bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 20.0,
        "max_amount": 23.0,
        "currency": "USD"
      },
      "date_posted": "2024-11-27",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-12b6420151077940",
      "title": "Community Specialist",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=12b6420151077940",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Community-Specialist-Arrowhead-Towne-Center/45418",
      "location": {
        "country": "US",
        "city": "Glendale",
        "state": "AZ"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Community Specialist is responsible for executing the store's community strategy, which includes engaging with the community through relationship building, events, and other activities including supporting lululemon product seeding and attending local studios. They develop and sustain local key relationships with lululemon Ambassadors and other relevant and influential community partners providing synergistic value. The Community Specialist also delivers a world\\-class guest (i.e., customer) experience when working on the floor in the store, bringing their community perspective into the guest connection.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\n* Collaborate with store leadership to bring Community strategy, through the pillars of community foundations, and guest experience to life.\n* Establish and manage local key relationships (e.g., Ambassadors, Sweat Collective, studio owners, lululemon Studio partner studios) to increase new guest acquisition and guest retention.\n* Engage with the local community to identify future Ambassador or partner opportunities and to increase the store's standing as a community hub.\n* Connect with guests on the floor to assess their unique needs, provide technical product education, and incorporate omnichannel programs into a seamless end\\-to\\-end guest experience.\n* Attend, support, and/or host local and regional Community events.\n* Execute the product seeding strategy through community partners and Ambassadors.\n* Review community relevant business data and metrics to identify and share insights and recommendations with store leadership regarding Community events, projects, or initiatives.\n* Contribute to a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive, productive, and fun experience for all team members.\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* The work schedule can vary based on store needs\n* Shifts are typically scheduled: mornings, afternoons, evenings, weekends, and holidays\n* In addition, during peak timeframes, special events, or other circumstances, the schedule may include early mornings or late nights/overnights for some employees\n\n\nExperience\n  \n  \n\n* 1 year of cumulative experience in customer service or engagement, grassroots marketing, brand engagement or community building\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma/GED/equivalent, or above\n* Experience (not necessarily the focus of a role): building or maintaining relationships with clients, groups, or partners; motivating team members to accomplish goals or activities\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Connection and Partnership: Is able to build professional relationships with team members and guests; develops partnerships within and across the company and community\n* Planning and Organizing: Plans and organizes work in a clear and efficient manner to ensure completion in alignment with priorities\n* Collaboration and Teamwork: Works productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\n* Learner Mindset: Is curious, open to feedback, and pursues learning and progressing new skills to continually grow and develop\n* Self\\-Leadership: Takes personal responsibility for own actions; inspires others to buy\\-in and actively support goals and initiatives\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work can occur in various locations and environments, including moving through the store with bright lights and loud music, and at locations throughout the community\n* Work involves building relationships with new people, strengthening community partnerships, and participating in events related to fitness or movement\n* Work is accomplished as part of a team, sometimes independently, and sometimes using a computer or other technical devices\n\n\nCompensation \\& Benefits Package\n  \n**Base Pay Range:** $18\\.00\\- $20\\.70/hour, subject to minimum wage in the location\n  \n**Target Bonus:** $3\\.00/hour\n  \n**Total Target Base Pay Range:** $21\\.00\\- $23\\.70/hour\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our offerings, employees in this position are eligible for our competitive bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 18.0,
        "max_amount": 23.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-04",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-67564c9f6e100550",
      "title": "Assistant Manager, Operations",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=67564c9f6e100550",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Assistant-Manager-Operations-Shops-at-Stonefield/45376",
      "location": {
        "country": "US",
        "city": "Charlottesville",
        "state": "VA"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Assistant Manager, Operations role is an essential part of the store leadership team and is responsible for making sure our retail business runs smoothly and successfully. Assistant Managers, Operations manage business enablers (including financial, profit and loss \\[P\\&L], budget, expenses, and cash) and ensure inventory, supplies, vendor relationships, technology, and facilities are maintained and maximized. They are responsible for writing the store's weekly schedule and accomplishing people\\-related administrative activities (including completing payroll and other documentation). Assistant Managers, Operations also execute company\\-driven operations\\-focused projects and initiatives at the store level.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\nOperations, Product, and Strategy\n  \n  \n\n* Implement the Store Manager's Operations vision for the store and cascade to team members.\n* Plan and prepare weekly team member schedule according to labor requirements, availability, and budget considerations.\n* Move dynamically on the retail floor to assess and fulfill the needs of the business, team, and guests.\n* Review, monitor, and partner with Store Manager to manage the budget and other business data and metrics (e.g., P\\&L statement, expenses) and inform planning processes (e.g., quarterly business review and sales planning).\n* Provide retail floor leadership to team members, including planning retail floor coverage and making decisions to maintain efficiency and effectiveness of retail floor operations.\n* Support sell\\-through management by ensuring accuracy of inventory counts and coordinating labor hours to efficiently receive product deliveries.\n* Execute company\\-level operations\\-focused directives, projects, and initiatives (e.g., from the SSC).\n* Understand and adhere to people safety policies and procedures to maintain a safe work environment.\n* Perform work in accordance with applicable policies, procedures, and laws or regulations.\n\n\nLeadership and People\n  \n  \n\n* Create and foster a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive, productive, and fun experience for all team members.\n* Perform administrative actions to support team members, including completing payroll, approving vacation and time off requests, approving shift swaps, and other documentation according to policies and procedures.\n* Inform people managers of projected team growth needs to support the building of a strong and diverse team based on operational trends and results.\n* Establish supportive and productive relationships with all team members, focusing on personal and professional development.\n\n\nGuest Experience and Community\n  \n  \n\n* Facilitate a seamless end\\-to\\-end guest experience by monitoring the incorporation of omnichannel programs (e.g., in\\-store guest transactions, buy online pickup in store, phone sales, and ship from store).\n* Collaborate with team members to ensure an optimal guest experience that values guests' time and supports store operations.\n* Resolve guest feedback and address issues, including guest escalations and urgent requests, helping to \"make it right\" for guests.\n\n\nBudget Responsibility\n  \n  \n\n* Accountable for delegated aspects of controllable budget and labor hours\n\n\nPeople Management\n  \n  \n\n* Leadership role indirectly responsible for subset of store employees as delegated by Store Manager\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Adaptability/Agility: Navigates uncertainty and ambiguity and can change priorities in a fast\\-paced environment; recovers quickly from setbacks\n* Leadership: Is able and desires to lead and inspire others; motivates, empowers, develops, and directs people as they work\n* Collaboration and Teamwork: Works productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\n* Decision Making/Problem Solving: Identifies opportunities for improvement; evaluates alternatives and makes effective, timely decisions\n* Strategic Thinking: Considers the lasting implications of decisions; sets a plan and makes decisions aligned with company strategy, vision, and values\n* Business Acumen: Is able to quickly understand and address business information (e.g., profit and loss statements, budgets and sales forecasts, retail strategy and approaches)\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* Work occurs on a variable schedule which could include early mornings, mornings, afternoons, evenings, late nights or overnights as well as weekends and holidays\n\n\nExperience\n  \n  \n\n* 1 year experience managing business operations and administration, including experience with scheduling and management of designated labor hours and managing projects or processes\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma, GED, or equivalent\n* Education: Bachelor's degree or equivalent\n* Experience: 1 year retail or sales specific management experience\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work occurs in an environment with bright lights and loud music\n* Work is accomplished as part of a team and also independently\n* Work may involve managing conflict or mediating problems between others or deescalating guest issues\n* Work involves reaching out to meet and build relationships with strangers/new people, and to strengthen existing community partnerships\n* Work is sometimes conducted on a computer or other technical devices, including to meet with others virtually\n* Work involves moving through a store for most of a shift to help guests and accomplish work, but can also involve sitting for extended periods of time (i.e., more than 1 hour)\n* Work may occasionally involve moving boxes weighing up to 30 lbs (13\\.6 kg)\n\n\nCompensation \\& Benefits Package\n  \n**Base Pay Range:** $22\\.30\\- $30\\.17/hour, subject to minimum wage in the location\n  \n**Target Bonus:** 25%\n  \n**Total Target Base Pay Range:** $27\\.88\\- $37\\.71/hour\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our offerings, employees in this position are eligible for our competitive bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 22.0,
        "max_amount": 30.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-02",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-e05612bd2b23b29c",
      "title": "Senior Engineer II - Site Reliability Engineering",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=e05612bd2b23b29c",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Senior-Engineer-II-Site-Reliability-Engineering/43822",
      "location": {
        "country": "US",
        "city": "Seattle",
        "state": "WA"
      },
      "description": "who we are\n  \nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nabout this team\n  \nlululemon Digital Site Reliability Engineering \\- DevOps is dedicated to empowering teams to deliver working software in a reliable, repeatable, secure, observable, performant fashion, and provide the most enjoyable, inclusive, and supportive work environment possible. The SRE DevOps teams provides tools, know\\-how and assistance to digital engineering teams to help them manage their infrastructure and deployments in a safe, repeatable manner. You will work as part of a distributed, global team supported by other SRE and Enterprise Engineering teams, and our technology partners to help us collaboratively develop and deliver industry leading technology solutions that drive lululemon’s business goals.\n  \n  \n\na day in the life\n  \nAs a Senior Engineer II, you will work as a technical leader for the services your team delivers to product development teams. You will be counted on as an expert and leader in your technology space, as you contribute to all areas of development and operations (pre\\-production to production). As a Senior Engineer II, you will dedicate a fair amount of time to the planning and discovery of tools and practices inside your given area of expertise. You will apply that knowledge by working closely with your team and other engineering leaders to promote platform level improvements. Senior Engineer IIs take production readiness and performance personally and help drive continuous improvement. You will be part of a day\\-to\\-day matrixed support team and may perform on\\-call support functions from time\\-to\\-time as needed.\n  \n  \n\nYou will participate in your teams continuous planning process, recommending projects and tasks that improve developer experience, efficiency and reliability. You will become an expert in the enterprise toolset that your team uses and supports and help other engineers become experts themselves. You will measure the signals that identify the effectiveness of your team’s efforts and report on them. You will work with other teams to get agreement on standards and practices for the areas you support. You will participate in and help lead your team’s scrum process and workflow, helping the scrum master refine the backlog, write stories, unblock the team and ensure that obligations are met.\n  \n  \n\n* Main contributor for product roadmaps and reliability strategy\n* Partner with project management to deliver status and performance updates\n* Conduct research to aid in product development and tools selection\n* Provide an escalation point and participate in on\\-call support rotations\n* Actively monitor key metrics, reports on trends, and make improvement recommendations\n* Facilitate an Engineering Community of Practice for your product(s)\n* Contribute to engineering automation, management or development of production level systems\n* Review product roadmaps and guide intake acceptance for a set of production systems\n* Own reliability for a defined set of production systems\n* Own the delivery lifecycle for a defined set of production systems\n\n\nqualifications\n  \n  \n\n* Completed Bachelor’s degree or diploma (or equivalent experience) in Computer Science, Software Engineering or Software Architecture preferred; candidates with substantial and relevant industry experience are also eligible\n* 8\\+ years of engineering experience\n* 5\\+ years experience with CI/CD tools, GitLab preferred\n* Deep experience with AWS\n* Advanced understanding of web technologies (HTTP, SSL, Headers, Cookies, TCP, Caching)\n* Knowledge of CI/CD principles and best\\-practices.\n* Ability to teach and coach other Engineers\n* Ability to learn, understand, and work quickly with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space\n* Experience developing solutions for retail or eCommerce businesses or other relevant domains such as manufacturing \\& logistics, supply chain, or corporate shared services\n* Experience with Terraform, Splunk, DataDog, Kubernetes, CloudFormation, Cloudwatch and Docker are a strong asset\n\n\nmust haves\n  \n  \n\n* Acknowledge the presence of choice in every moment and take personal responsibility for your life.\n* Possess an entrepreneurial spirit and continuously innovate to achieve great results.\n* Communicate with honesty and kindness and create the space for others to do the same.\n* Lead with courage, knowing the possibility of greatness is bigger than the fear of failure.\n* Foster connection by putting people first and building trusting relationships.\n* Integrate fun and joy as a way of being and working, aka doesn’t take yourself too seriously.\n\n\nAdditional Notes\n  \nImmigration support is potentially available for this role.\n  \n  \n\nCompensation and Benefits Package\n  \nlululemon’s compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The typical hiring range for this position is from $136,200 \\- $187,200 annually; the base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our total rewards offering, permanent employees in this position may be eligible for our competitive annual bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.\n  \n  \n\nworkplace arrangement\n  \n  \n\nThis role is classified as Hybrid under our SSC Workplace Policy.\n  \n  \n\nHybrid\n  \n  \n\nIn\\-person collaboration is important, and much of the role can be performed remotely. Work is performed onsite at least 3 days per week.\n  \n  \n\n\\#LI\\-Hybrid \\#LI\\-SS1",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "yearly",
        "min_amount": 136200.0,
        "max_amount": 187200.0,
        "currency": "USD"
      },
      "date_posted": "2024-10-10",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-e9dc7d0d2eeb857b",
      "title": "Guest Experience Lead",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=e9dc7d0d2eeb857b",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Guest-Experience-Lead-Shadyside/43639",
      "location": {
        "country": "US",
        "city": "Pittsburgh",
        "state": "PA"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Guest Experience Lead is responsible for ensuring all guests (i.e., customers) receive a quality in\\-store experience. They do this by overseeing or providing technical product education that articulates the value of our product and brand to meet the unique needs of each guest. The Guest Experience Lead is part of the store leadership team, responsible for driving store performance on the floor through guest experience and team achievement of daily sales or unit targets. Guest Experience Leads provide input to team member performance evaluations, recommendations into store hiring decisions, and act as Supervisor on Duty (SOD) when leading the floor.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\n* Bring the lululemon guest experience framework to life, leading from the floor to establish an exceptional and inclusive guest experience.\n* Continuously assess the level of guest connection and technical product education, ensuring every single guest receives technical product education and assisting the guests when needed (e.g., when other team members are unavailable).\n* Move dynamically and lead from the floor as the Supervisor on Duty to assess and fulfill the needs of the business, team, and guests.\n* Conduct preparation activities to ensure in\\-store readiness for guests and ensure the operational excellence of the store is maintained throughout shift.\n* Open and close the store in accordance with the opening and closing procedures.\n* Review and interpret daily business data and metrics to track progress toward sales goals and motivate team to drive business results.\n* Participate in the store's hiring process, including recruitment, selection and hiring recommendations, onboarding, and training.\n* Address team member performance and support their ongoing learning and development by providing direct feedback and in\\-the\\-moment recognition, coaching, demonstrations, and hands\\-on experiences.\n* Contribute to a respectful and inclusive team by establishing supportive working relationships and engaging with team members, creating a fun and productive environment.\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* The work schedule can vary based on store needs\n* Shifts are typically scheduled: mornings, afternoons, evenings, weekends, and holidays\n* In addition, during peak timeframes, special events, or other circumstances, the schedule may include early mornings or late nights/overnights for some team members\n\n\nExperience\n  \n  \n\n* 1 year retail or customer experience (e.g., guest resolution, navigating difficult conversations)\n* Some experience in leading, mentoring, or delegating with others\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma/GED/equivalent, or above\n* Experience: 1 year of retail/sales leadership experience (supervisor or people management not necessary; examples: leading delegated assignments/tasks, mentoring or assisting peers)\n* For Experiential stores with food/beverage service only: Food safety and/or liquor service certification\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Guest Experience: Actively creates an inclusive, high\\-caliber experience and connection for every guest through team members\n* Leadership: Is able and desires to lead and inspire others; motivates, empowers, develops, and directs people as they work\n* Collaboration and Teamwork: Works productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\n* Decision Making/Problem Solving: Uses logic and reasoning to evaluate alternatives and make effective, timely decisions\n* Adaptability/Agility: Navigates uncertainty and ambiguity and can change priorities in a fast\\-paced environment; recovers quickly from setbacks\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work involves moving through the store with bright lights and loud music\n* Work is accomplished as part of a team, sometimes independently, and sometimes on a computer or other technical devices\n* Work may occasionally involve moving boxes weighing up to 30 lbs (13\\.6 kg)\n* For Experiential stores with food/beverage service only: Work may involve using industrial kitchen equipment and exposure to heat in order to prepare food or beverages\n\n\nCompensation \\& Benefits Package\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional team performance. The base pay range for this position is from $19\\.50\\- $22\\.43/hour subject to minimum wage in the location. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. This position has a target bonus of an additional $3 per hour, subject to certain requirements and the Company's discretion, bringing the total target compensation range between $22\\.50\\- $25\\.43/ hour.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 19.0,
        "max_amount": 25.0,
        "currency": "USD"
      },
      "date_posted": "2024-10-04",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-5e3aa5ebf7e6f289",
      "title": "Assistant Manager, Guest Experience",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=5e3aa5ebf7e6f289",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Assistant-Manager-Guest-Experience-Colonial-Williamsburg-Local/39392",
      "location": {
        "country": "US",
        "city": "Williamsburg",
        "state": "VA"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Assistant Manager, Guest Experience role is an essential part of the store leadership team, ensuring our team members and guests (i.e., customers) receive a quality experience in our stores every day. Assistant Managers, Guest Experience are responsible for leading from the floor to build, manage, and develop team members. Assistant Managers, Guest Experience create an environment and a team culture where people feel a deep sense of belonging and have the opportunity to grow. As a result, they ensure their team delivers outstanding guest experience in line with company values and directives.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\nLeadership and People Management\n  \n  \n\n* Create and foster a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive, productive, and fun experience for all team members.\n* Engage team members by helping them understand how their work supports the success of the store and of lululemon overall.\n* Implement the Store Manager's People vision for the store and cascade to team members.\n* Support Store Manager in hiring and building a strong and diverse team that includes team members with various experiences, backgrounds, and skillsets to drive key results and performance.\n* Support ongoing learning and development of team members consistently and equitably by providing direct feedback, coaching, mentoring, and continuous development check\\-ins.\n* Lead performance management activities, including direct feedback and continuous check\\-ins, facilitating team acknowledgement and rewards, managing performance documentation, and addressing performance concerns.\n* Address employee concerns or issues, including knowing when to partner with internal support to take appropriate action.\n\n\nGuest Experience and Community\n  \n  \n\n* Lead an exceptional guest (customer) experience on the floor through assessing the level of guest connection and technical product education and supporting team members to address gaps through feedback and coaching.\n* Provide retail floor leadership to team members, including making in\\-the\\-moment decisions to maintain efficiency and effectiveness of retail floor coverage and operations.\n* Resolve guest feedback and address emergent issues, including guest escalations and urgent requests, helping to \"make it right\" for guests.\n\n\nOperations, Product, and Strategy\n  \n  \n\n* Partner with other managers to review business data and metrics (e.g., profit and loss \\[P\\&L] statement) to inform planning processes (e.g., quarterly business review, sales planning, and hiring strategy).\n* Maintain strategic product presentation/visual merchandising by ensuring product recovery, restock (e.g., pant wall, size store), destock, or minor visual merchandizing changes are accomplished.\n* Open and close the store in accordance with the opening and closing procedures.\n* Understand and adhere to people safety policies and procedures to maintain a safe work environment.\n* Perform work in accordance with applicable policies, procedures, and laws or regulations.\n\n\nBudget Responsibility\n  \n  \n\n* Accountable for delegated aspects of controllable budget and labor hours\n\n\nPeople Management\n  \n  \n\n* Leadership role directly responsible for subset of store employees as delegated by Store Manager\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Leadership: Is able and desires to lead and inspire others; motivates, empowers, develops, and directs people as they work\n* Guest Experience: Actively creates an inclusive, high\\-caliber experience and connection for every guest through team members\n* Team Building: Creates and develops teams that maximize accomplishments; encourages unique contributions and different perspectives\n* Decision Making/Problem Solving: Uses logic and reasoning to evaluate alternatives and make effective, timely decisions\n* Strategic Thinking: Sets strategies that are aligned to vision and values of the company to achieve goals/vision/further the mission; considers the 'big picture' implications of decisions\n* Change Management Leadership: Leads others through change processes and uncertainty\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* Work occurs on a variable schedule which could include early mornings, mornings, afternoons, evenings, late nights or overnights as well as weekends and holidays\n\n\nExperience\n  \n  \n\n* 1 year people management experience\n* 1 year leadership experience, including experience managing business operations and administration and managing projects or processes\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma, GED, or equivalent\n* Education: Bachelor's degree or equivalent\n* Experience: 1 year retail or sales specific management experience\n* Experience: 1 year recruiting, hiring, or training employees\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work occurs in an environment with bright lights and loud music\n* Work is accomplished as part of a team and also independently\n* Work may involve managing conflict or mediating problems between others or deescalating guest issues\n* Work involves reaching out to meet and build relationships with strangers/new people, and to strengthen existing community partnerships\n* Work is sometimes conducted on a computer or other technical devices, including to meet with others virtually\n* Work involves moving through a store for most of a shift to help guests and accomplish work, but can also involve sitting for extended periods of time (i.e., more than 1 hour)\n* Work may occasionally involve moving boxes weighing up to 30 lbs (13\\.6 kg)\n\n\nCompensation \\& Benefits Package\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional team performance. The base pay range for this position is from $22\\.30\\- $30\\.17/hour subject to minimum wage in the location. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. This position has a target bonus of an additional 25%, subject to certain requirements and the Company's discretion, bringing the total target compensation range between $27\\.88\\- $37\\.71/ hour.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 22.0,
        "max_amount": 37.0,
        "currency": "USD"
      },
      "date_posted": "2024-06-11",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-937079782b7a3408",
      "title": "Product Operations Educator - Seasonal Contract",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=937079782b7a3408",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Product-Operations-Educator-Seasonal-Contract-Waterside-Shops/42645",
      "location": {
        "country": "US",
        "city": "Naples",
        "state": "FL"
      },
      "description": "**Who We Are:**  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\n**Job Summary:**  \n\nProduct Operations Educators are experts in organization and efficiency, executing inventory processing and other product operations, as directed and according to the company's standards. Product Operations Educators receive and process shipments, organize product within the store (the retail floor and the back of house) as directed, and complete other inventory\\-related tasks to maximize profitable product sell\\-through. Support guests on the retail floor by providing service or connecting the guest to another team member.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\n* Organize and clean the inventory workspace to maximize efficiency and maintain a safe store environment.\n* Execute inventory processing plan established by the Product Operations Lead, including accurate RFID inventory counts according to company standards.\n* Receive and process product deliveries according to the company's standards, such as folding, sorting, and hanging product to optimize space and productivity.\n* Reconcile, prepare, package, and ship product to appropriate locations according to company standards (e.g., damages, consolidations).\n* Execute product display adjustments, daily restocking and destocking, or product moves on the floor according to company standards to maintain store organization and presentation.\n* Execute market\\-relevant omnichannel programs (e.g., buy online/pickup in store and ship from store options) according to company standards.\n* Interact with guests or facilitate connection with another team member to provide service on the retail floor and support the guest's experience.\n* Contribute to a respectful and inclusive team environment to ensure a supportive and engaging experience for all team members and guests.\n* Use in\\-store technology to support store operations and provide positive guest experiences.\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n* Must be 18 years of age or older\n\n\nSchedule/Availability\n  \n  \n\n* The work schedule can vary based on store needs\n* Shifts may be scheduled: evenings, overnights, mornings, afternoons, weekends, and holidays\n* In addition, the schedule may include times when the store is closed to guests\n* No Experience Required\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma/GED/equivalent, or above\n* Experience (not necessarily the only focus of a role): retail, distribution center, or warehouse operations related (for example, stocking or inventory processing experience)\n\n\nWhat We Look For\n  \n  \n\n* Attention to Detail: Is careful about detail and thorough in completing work tasks\n* Being Organized: Prioritizes and efficiently performs and completes assigned tasks\n* Drive: Is self\\-motivated and determined to meet or exceed goals\n* Safety Orientation: Is committed to complying with safety rules and guidelines\n* Personal Responsibility: Accepts responsibility/accountability for actions; is dependable\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Collaboration and Teamwork: Works productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\n* Adaptability/Agility: Navigates uncertainty and ambiguity and can change priorities in a fast\\-paced environment; recovers quickly from setbacks\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work involves moving through the store, sometimes on the sales floor with bright lights and loud music, and sometimes in areas with no windows or natural light\n* Work is accomplished as part of a team, sometimes independently, and sometimes using a computer or other technology\n* Work may involve moving boxes weighing up to 30 lbs (13\\.6 kg) or using ladders to reach materials\n\n\nIn keeping with our mission, please connect with us at accommodations@lululemon.com if you have questions about how your unique abilities may translate to the requirements for this role, with or without a reasonable accommodation. In your email, please include the position title, the location of the position and the nature of your question or request.\n  \n  \n\nCompensation \\& Benefits Package\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional team performance. The base pay range for this position is from $17\\.00\\- $19\\.56/hour subject to minimum wage in the location. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. This position has a target bonus of an additional $3 per hour, subject to certain requirements and the Company's discretion, bringing the total target compensation range between $20\\.00\\- $22\\.56/ hour.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [
        "contract"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 17.0,
        "max_amount": 22.0,
        "currency": "USD"
      },
      "date_posted": "2024-09-11",
      "emails": [
        "accommodations@lululemon.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-cd044d78b6ac3f1f",
      "title": "Senior Privacy Counsel (Hybrid - Seattle, WA)",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=cd044d78b6ac3f1f",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Senior-Privacy-Counsel-Hybrid-Seattle-WA-/44528",
      "location": {
        "country": "US",
        "city": "Seattle",
        "state": "WA"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nAbout This Team\n  \n  \n\nWe are self\\-described \"legal outliers.\" Our vision is to inspire and educate, provide value from beginning to end, and create an environment where work enriches life, and life enriches work. We believe in \"the sweat life\" \\- sweat, relationships, and personal development \\- and we live it every day.\n  \n  \n\nA Day In The Life\n  \n  \n\nWe’re looking for an experienced Senior Privacy Counsel to join our dynamic legal team. In this role, you’ll serve as a subject matter expert (SME) in privacy law, providing expert legal counsel across a range of privacy\\-related issues and initiatives. You’ll independently navigate complex and evolving global privacy requirements, delivering tactical, risk\\-based guidance that helps teams stay on track despite ambiguity or rapidly changing regulations.\n  \n  \n\nYou will partner closely with business and cybersecurity teams to ensure that all privacy requirements are effectively integrated into new products, initiatives, and technologies. A key part of this role is advising cross\\-functional teams to mitigate risk and ensuring privacy compliance is achieved efficiently.\n  \n  \n\nYou’ll be responsible for staying ahead of changing privacy laws and regulations and will deliver guidance to help teams quickly adapt to new requirements. You’ll escalate privacy risks as necessary, ensuring that leadership is informed and can act quickly to manage potential issues. In addition to handling legal issues directly, you’ll collaborate with external counsel when needed, manage incidents, and play a central role in the ongoing development and execution of the company’s Privacy Program.\n  \n  \n\nResponsibilities\n  \n  \n\n* Provide independent, expert legal counsel on a wide range of privacy\\-related issues, offering tactical risk\\-based guidance on complex matters across product development, marketing, and technology teams.\n* Collaborate with business and cybersecurity teams to ensure comprehensive compliance with global privacy laws (e.g., CCPA, GDPR, PIPEDA, etc.) and integrate these requirements into new product features and digital initiatives.\n* Stay current with evolving privacy laws, emerging case law, and regulatory changes, delivering practical and timely guidance to internal stakeholders to navigate ambiguity or rapidly changing requirements.\n* Act as a trusted partner to the organization, advising on high\\-impact decisions that require balancing legal and business needs, and escalating privacy risks to leadership when necessary.\n* Provide expert counsel on privacy incidents, data subject access requests (DSARs), and regulatory inquiries, including engaging external counsel and coordinating responses.\n* Lead and support Privacy by Design initiatives, working closely with product and technology teams to ensure privacy considerations are embedded in product development and lifecycle management.\n* Manage privacy\\-related projects, monitor program compliance, track incidents, and ensure alignment with global privacy laws and regulations.\n* Mentor and guide junior legal team members and contribute to a deep partnership with other teams across the organization, ensuring consistent privacy support and alignment.\n* Maintain and update privacy policies, procedures, and notices, ensuring they are in line with evolving legal requirements and organizational practices.\n\n\nRequired Skills and Experience\n  \n  \n\n* At least 5 years of experience as a practicing attorney, preferably in\\-house or at a law firm, with a focus on privacy law, data protection, or related legal fields.\n* Deep knowledge of global privacy laws (e.g., GDPR, CCPA, PIPEDA, CAN\\-SPAM, COPPA, FTC rules, etc.) and the ability to translate complex legal concepts into actionable, business\\-oriented advice.\n* Experience partnering with business, technology, and cybersecurity teams to integrate privacy requirements into projects and products effectively.\n* Strong communication and problem\\-solving skills, with the ability to advise technical and non\\-technical teams on complex privacy issues and help navigate rapidly changing privacy requirements.\n* Ability to manage privacy risks, make independent decisions, and escalate issues when necessary to leadership in a fast\\-paced, dynamic environment.\n* Solid understanding of digital technologies (social media, digital advertising, mobile apps, mobile payments) and their impact on privacy.\n* Proven ability to lead privacy projects, handle incidents, and ensure the ongoing maturity and success of a Privacy Program.\n* J.D. from an accredited institution and licensed to practice in Washington State / British Columbia (or ability to practice in\\-house).\n* Certifications such as CIPP, CIPM preferred.\n\n\nMust Haves\n  \n  \n\n* Acknowledge the presence of choice in every moment and take personal responsibility for your life.\n* Possess an entrepreneurial spirit and continuously innovate to achieve great results.\n* Communicate with honesty and kindness and create the space for others to do the same.\n* Lead with courage, knowing the possibility of greatness is bigger than the fear of failure.\n* Foster connection by putting people first and building trusting relationships.\n* Integrate fun and joy as a way of being and working, aka doesn’t take yourself too seriously.\n\n\nAdditional Notes\n  \nAuthorization to work in USA or Canada is required for this role.\n  \n  \n\nCompensation and Benefits Package\n  \nlululemon’s compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The typical hiring range for this position is from $155,400 \\- $203,900 USD annually; the base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our total rewards offering, permanent employees in this position may be eligible for our competitive annual bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.\n  \n  \n\nworkplace arrangement\n  \n  \n\nThis role is classified as Hybrid under our SSC Workplace Policy: In\\-person collaboration is important, and much of the role can be performed remotely. Work is performed onsite at least 3 days per week.\n  \n  \n\n\\#LI\\-Hybrid\n  \n  \n\n\\#LI\\-JK1",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "yearly",
        "min_amount": 155400.0,
        "max_amount": 203900.0,
        "currency": "USD"
      },
      "date_posted": "2024-11-14",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-d368e53e9f70d5f4",
      "title": "Guest Experience Lead",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=d368e53e9f70d5f4",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Guest-Experience-Lead-Bethesda-Row/45143",
      "location": {
        "country": "US",
        "city": "Bethesda",
        "state": "MD"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Guest Experience Lead is responsible for ensuring all guests (i.e., customers) receive a quality in\\-store experience. They do this by overseeing or providing technical product education that articulates the value of our product and brand to meet the unique needs of each guest. The Guest Experience Lead is part of the store leadership team, responsible for driving store performance on the floor through guest experience and team achievement of daily sales or unit targets. Guest Experience Leads provide input to team member performance evaluations, recommendations into store hiring decisions, and act as Supervisor on Duty (SOD) when leading the floor.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\n* Bring the lululemon guest experience framework to life, leading from the floor to establish an exceptional and inclusive guest experience.\n* Continuously assess the level of guest connection and technical product education, ensuring every single guest receives technical product education and assisting the guests when needed (e.g., when other team members are unavailable).\n* Move dynamically and lead from the floor as the Supervisor on Duty to assess and fulfill the needs of the business, team, and guests.\n* Conduct preparation activities to ensure in\\-store readiness for guests and ensure the operational excellence of the store is maintained throughout shift.\n* Open and close the store in accordance with the opening and closing procedures.\n* Review and interpret daily business data and metrics to track progress toward sales goals and motivate team to drive business results.\n* Participate in the store's hiring process, including recruitment, selection and hiring recommendations, onboarding, and training.\n* Address team member performance and support their ongoing learning and development by providing direct feedback and in\\-the\\-moment recognition, coaching, demonstrations, and hands\\-on experiences.\n* Contribute to a respectful and inclusive team by establishing supportive working relationships and engaging with team members, creating a fun and productive environment.\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* The work schedule can vary based on store needs\n* Shifts are typically scheduled: mornings, afternoons, evenings, weekends, and holidays\n* In addition, during peak timeframes, special events, or other circumstances, the schedule may include early mornings or late nights/overnights for some team members\n\n\nExperience\n  \n  \n\n* 1 year retail or customer experience (e.g., guest resolution, navigating difficult conversations)\n* Some experience in leading, mentoring, or delegating with others\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma/GED/equivalent, or above\n* Experience: 1 year of retail/sales leadership experience (supervisor or people management not necessary; examples: leading delegated assignments/tasks, mentoring or assisting peers)\n* For Experiential stores with food/beverage service only: Food safety and/or liquor service certification\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Guest Experience: Actively creates an inclusive, high\\-caliber experience and connection for every guest through team members\n* Leadership: Is able and desires to lead and inspire others; motivates, empowers, develops, and directs people as they work\n* Collaboration and Teamwork: Works productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\n* Decision Making/Problem Solving: Uses logic and reasoning to evaluate alternatives and make effective, timely decisions\n* Adaptability/Agility: Navigates uncertainty and ambiguity and can change priorities in a fast\\-paced environment; recovers quickly from setbacks\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work involves moving through the store with bright lights and loud music\n* Work is accomplished as part of a team, sometimes independently, and sometimes on a computer or other technical devices\n* Work may occasionally involve moving boxes weighing up to 30 lbs (13\\.6 kg)\n* For Experiential stores with food/beverage service only: Work may involve using industrial kitchen equipment and exposure to heat in order to prepare food or beverages\n\n\nCompensation \\& Benefits Package\n  \n  \n\n**Base Pay Range:** $22\\.00 \\- $25\\.30/hour, subject to minimum wage in the location\n  \n  \n\n**Target Bonus:** $3\\.00/hour\n  \n  \n\n**Total Target Base Pay Range:** $25\\.00 \\- $28\\.30/hour\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our offerings, employees in this position are eligible for our competitive bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 22.0,
        "max_amount": 25.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-19",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-5624510827a67ac9",
      "title": "Product Operations Lead",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=5624510827a67ac9",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Product-Operations-Lead-Abbot-Kinney/44954",
      "location": {
        "country": "US",
        "city": "Venice",
        "state": "CA"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Product Operations Lead is a part of the store leadership team responsible for executing on the store product strategy, including product operations and inventory management. They are responsible for leading inventory shifts, overseeing all back of house (BOH) product operations, and ensuring both the floor and BOH are stocked and well\\-organized. The Product Operations Lead provides input to team member performance evaluations, recommendations into store hiring decisions, and acts as Supervisor on Duty (SOD) while leading inventory shifts. The Product Operations Lead also oversees and delivers a world\\-class guest (i.e., customer) experience when scheduled to work on the floor.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\n* Collaborate with store leadership to bring product strategy to life.\n* Proactively plan, prioritize, manage, and lead inventory processing and accuracy activities in accordance with standard operating procedures (SOPs).\n* Ensure execution of product actions (e.g., pull backs, consolidations, repricing).\n* Engage team members in inventory management by creating a fun and productive atmosphere for the shift.\n* Monitor product levels and communicate findings to support sell\\-through strategy and optimal product availability for the guest.\n* Review and interpret daily business data and metrics to inform actions, for example analyzing product sell\\-through data to provide recommendations to store leadership regarding product focus or, for outlets, pricing.\n* Participate in the store's hiring process, including recruitment, selection and hiring recommendations, onboarding, and training.\n* Address team member performance and support their ongoing learning and development by providing direct feedback and in\\-the\\-moment recognition, coaching, demonstrations, and hands\\-on experiences.\n* Contribute to a respectful and inclusive team environment by establishing supportive working relationships with team members.\n* When serving as Supervisor on Duty during store open hours, move dynamically and lead from the floor to ensure every guest receives technical product education and establish a world\\-class guest experience.\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* The work schedule can vary based on store needs\n* Shifts are typically scheduled: mornings, afternoons, evenings, weekends, and holidays\n* In addition, during peak timeframes, special events, or other circumstances, the schedule may include early mornings or late nights/overnights for some team members\n\n\nExperience\n  \n  \n\n* 1 year of work experience\n* Some experience with inventory management, product or visual merchandising, stocking, or planning and logistics including using business technology to accomplish work\n* Some experience in leading, mentoring, delegating or process implementation with others\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma/GED/equivalent, or above\n* Experience (not necessarily the only focus of a role): retail, sales, distribution center, or warehouse operations related; reviewing and interpreting business reports and metrics to inform action\n* For Experiential stores with food/beverage service only: Food safety and/or liquor service certification\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Adaptability/Agility: Navigates uncertainty and ambiguity and can change priorities in a fast\\-paced environment; recovers quickly from setbacks\n* Leadership: Is able and desires to lead and inspire others; motivates, empowers, develops, and directs people as they work\n* Collaboration and Teamwork: Works productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\n* Decision Making/Problem Solving: Identifies opportunities for improvement; evaluates alternatives and makes effective, timely decisions\n* Planning and Organizing: Plans and organizes work in a clear and efficient manner to ensure completion in alignment with priorities\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work involves moving through the store, sometimes in the front of the house with bright lights and loud music, and sometimes in the back of the house with no windows or natural light\n* Work is accomplished as part of a team, sometimes independently, and sometimes using a computer or other technical devices\n* Work may occasionally involve moving boxes weighing up to 30 lbs (13\\.6 kg) or using ladders to reach materials\n* For Experiential stores with food/beverage service only: Work may involve using industrial kitchen equipment and exposure to heat in order to prepare food or beverages\n\n\nCompensation \\& Benefits Package\n  \n**Base Pay Range:** $22\\.00 \\- $25\\.30/hour, subject to minimum wage in the location\n  \n**Target Bonus:** $3\\.00/hour\n  \n**Total Target Base Pay Range:** $25\\.00 \\- $28\\.30/hour\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our offerings, employees in this position are eligible for our competitive bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 22.0,
        "max_amount": 25.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-10",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-7133443a16b208f3",
      "title": "Visual Merchandising Specialist",
      "company_name": "lululemon",
      "job_url": "https://www.indeed.com/viewjob?jk=7133443a16b208f3",
      "job_url_direct": "https://lululemoninc.avature.net/en_US/careers/JobDetail/Visual-Merchandising-Specialist-Waterside-Shops-Naples/44972",
      "location": {
        "country": "US",
        "city": "Naples",
        "state": "FL"
      },
      "description": "Who We Are\n  \n  \n\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth\\-focused environment for our people.\n  \n  \n\nJob Summary\n  \n  \n\nThe Visual Merchandising Specialist is responsible for ensuring company directed visual merchandising (VM) strategies and standards are brought to life. This role executes product presentation, styling, and in\\-store marketing elements to optimize guests' (i.e., customers) experiences. The Visual Merchandising Specialist implements key product stories, product placement strategies, and sell\\-through strategies by managing merchandise changes as well as product display and mannequin styling, in accordance with company standards and adapted to the individual store need. They also deliver a world\\-class guest experience on the floor.\n  \n  \n\nCore Responsibilities of the Job\n  \n  \n\n* Collaborate with store leadership to bring VM presentation and guest experience to life on the floor.\n* Optimize guests' experiences through consistent implementation of brand standards in key product stories, product placement strategies, and intuitive store navigation for a world\\-class, guest\\-centric experience.\n* Execute powerful and visually appealing product presentation in accordance with company standards to enhance the guest experience and drive store sell through.\n* Execute VM flips, including window activations, mannequin styling, signage and label updates, and seasonal or weekly merchandise changes as well as company\\-driven product initiatives and campaigns, as directed.\n* Connect with guests on the floor to assess their unique needs, provide technical product education, and incorporate omnichannel programs into a seamless end\\-to\\-end guest experience.\n* Provide direct feedback and in\\-the\\-moment training related to brand standards, product placement, and visual display techniques to support team members ongoing learning and development.\n* Contribute to a respectful and inclusive team environment by establishing supportive working relationships with team members.\n\n\nJob Requirements\n  \n  \n\nEligibility\n  \n  \n\n* Must be legally authorized to work in the country in which the store is located\n* Must have the ability to travel to assigned store with reliable transportation methods\n\n\nSchedule/Availability\n  \n  \n\n* The work schedule can vary based on store needs\n* Shifts are typically scheduled: mornings, afternoons, evenings, weekends, and holidays\n* In addition, during peak timeframes, special events, or other circumstances, the schedule may include early mornings or late nights/overnights for some employees\n\n\nExperience\n  \n  \n\n* 1 year of retail or sales work experience\n* Some education or experience with visual merchandising, fashion merchandising, graphic design, interior design, space planning or related field\n\n\nJob Assets (i.e., nice to have; not required)\n  \n  \n\n* Education: High school diploma/GED/equivalent, or above; training or degree in design or a related field\n* Experience (not necessarily the focus of a role): retail product merchandising, visual merchandising, or inventory management; managing projects, processes, or administering part of a business operation\n* For Experiential stores with food/beverage service only: Food safety and/or liquor service certification\n\n\nWhat We Look For\n  \n  \n\n* Inclusion \\& Diversity: Creates/supports an inclusive environment that values/celebrates differences\n* Integrity: Behaves in an honest, fair, and ethical manner\n* Visual Design and Styling: Understands and is interested in color theory, visual display composition, and styling/placement techniques and how to apply that knowledge\n* Collaboration and Teamwork: Works productively with and supports others to achieve common goals; seeks connections, partnerships, and diverse perspectives\n* Attention to Detail: Is careful about detail and thorough in completing work tasks\n* Self\\-Leadership: Takes personal responsibility for own actions; inspires others to buy\\-in and actively support goals and initiatives\n* Adaptability/Agility: Navigates uncertainty and ambiguity and can change priorities in a fast\\-paced environment; recovers quickly from setbacks\n* Interactive Communication: Conveys information effectively and understands information shared while interacting with others\n\n\nWork Context (e.g., environment, interactions, physical)\n  \n  \n\n* Work involves moving through the store, sometimes with bright lights and loud music in the front of house\n* Work is accomplished as part of a team, sometimes independently, and sometimes using a computer or other technical devices\n* Work involves moving boxes, fixtures and mannequins weighing up to 30 lbs (13\\.6 kg) as well as bending, reaching, stretching, and sometimes using ladders to reach materials or adjust presentation elements\n\n\nCompensation \\& Benefits Package\n  \n**Base Pay Range:** $19\\.00 \\- $21\\.85/hour, subject to minimum wage in the location\n  \n**Target Bonus:** $3\\.00/hour\n  \n**Total Target Base Pay Range:** $22\\.00 \\- $24\\.85/hour\n  \n  \n\nlululemon's compensation offerings are grounded in a pay\\-for\\-performance philosophy that recognizes exceptional individual and team performance. The base pay offered is based on market location and may vary depending on job\\-related knowledge, skills, experience, and internal equity. As part of our offerings, employees in this position are eligible for our competitive bonus program, subject to program eligibility requirements.\n  \n  \n\nAt lululemon, investing in our people is a top priority. We believe that when life works, work works. We strive to be the place where inclusive leaders come to develop and enable all to be well. Recognizing our teams for their performance and dedication, other components of our total rewards offerings include support of career development, wellbeing, and personal growth:\n  \n  \n\n* Extended health and dental benefits, and mental health plans\n* Paid time off\n* Savings and retirement plan matching\n* Generous employee discount\n* Fitness \\& yoga classes\n* Parenthood top\\-up\n* Extensive catalog of development course offerings\n* People networks, mentorship programs, and leadership series (to name a few)\n\n\n**Note:** The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.",
      "company_url": "https://www.indeed.com/cmp/Lululemon-e2ea86c4",
      "company_url_direct": "http://www.lululemon.com",
      "job_type": [],
      "compensation": {
        "interval": "hourly",
        "min_amount": 19.0,
        "max_amount": 24.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-11",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "Vancouver, BC",
      "company_num_employees": "10,000+",
      "company_revenue": "$5B to $10B (USD)",
      "company_description": "lululemon is a technical activewear, loungewear and footwear company for all the ways you love to move.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e342a64a3b982e384fca45d395c3050c",
      "banner_photo_url": null,
      "job_function": null
    }
  ]
}