{
  "company_name": "Microsoft",
  "sector": "Technology",
  "sample_size": 20,
  "total_jobs_available": 962,
  "jobs": [
    {
      "id": "in-991cb0a393a986aa",
      "title": "Principal Manager, Technical Program Management",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=991cb0a393a986aa",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1798135/Principal-Manager-Technical-Program-Management?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": null,
        "state": null
      },
      "description": "The Azure High Performance Computing \\& Artificial Intelligence (HPC \\& AI) compute platform team defines and delivers the hardware roadmap, software, and services that enable our users to run technical computing workloads in Azure – extreme scale AI training and inference including large language models, traditional HPC modelling and simulations, remote visualization, and immersive gaming experiences. We are responsible for providing Azure customers with supercomputer\\-class capabilities to accelerate their research, drive competitive differentiation, and finding answers to some of the most difficult questions of science and industry.  \n\nWe are looking for a Principal Technical Program Manager who has a proven track record working with complex and distributed engineering systems that are used in operating large\\-scale cloud solutions. This role requires a candidate with an ability to articulate a vision, build a team, inspire and get key stakeholder buy\\-in and delivery, model Microsoft values and lead cross\\-organization teams to program success.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.**Responsibilities**\n--------------------\n\n* Build a team of Product Managers to create engineering systems for operating our hardware fleet.\n* Engage with partner teams internal and external to Microsoft to develop system architectures which meet emerging business needs. Drive agility in delivering solutions.\n* Articulate requirements for automation and continuous improvement of engineering workflows through the hardware lifecycle.\n* Provide a crisp view of all aspects of the hardware fleet to senior leaders across Microsoft.\n* Facilitate discussions on go\\-forward strategy.\n* A self\\-starter with proven track record of managing complex program/project to successful completion, working across a large set of cross\\-functional stakeholders.\n\n**Qualifications**\n------------------\n\n**Required Qualifications:*** Bachelor's Degree AND 8\\+ years experience in product/service/project/program management or software development\n\t+ OR equivalent experience.\n* 4\\+ years people management experience.\n* 3\\+ years of experience managing cross\\-functional and/or cross\\-team projects.\n\n**Other Qualifications:*** Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n\t+ Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.\n\n **Preferred Qualifications:*** Bachelor's Degree AND 10\\+ years' experience in engineering, product/technical program management, data analysis,\n\t+ OR product development\n\t+ OR equivalent experience.\n* 8\\+ years of experience managing cross\\-functional and/or cross\\-team projects.\n* 6\\+ years people management experience.\n* 1\\+ year(s) of experience reading and/or writing code (e.g., sample documentation, product demos).\n* Understanding of datacenter, network and hardware infrastructure.\n* Understanding of cloud system internals.\n* Experience of managing cross\\-company business relationships.\n\n  \n\nProduct Management M5 \\- The typical base pay range for this role across the U.S. is USD $137,600 \\- $267,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $180,400 \\- $294,000 per year.  \n\n  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay\n  \n\n  \n\nMicrosoft will accept applications for the role until January 23, 2025  \n\n\\#azurecorejobs\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 137600.0,
        "max_amount": 294000.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-09",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-12d114568c9c0bc1",
      "title": "SOFTWARE ENGINEER 2 - CTJ - TS/SCI",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=12d114568c9c0bc1",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1789214/SOFTWARE-ENGINEER-2-CTJ-TS-SCI?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Redmond",
        "state": "WA"
      },
      "description": "Security represents the most critical priorities for our customers in a world awash in digital threats, regulatory scrutiny, and estate complexity. Microsoft Security aspires to make the world a safer place for all. We want to reshape security and empower every user, customer, and developer with a security cloud that protects them with end to end, simplified solutions. The Microsoft Security organization accelerates Microsoft’s mission and bold ambitions to ensure that our company and industry is securing digital technology platforms, devices, and clouds in our customers’ heterogeneous environments, as well as ensuring the security of our own internal estate. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life\\-changing innovations that impact billions of lives around the world.  \n\nMicrosoft Purview solutions offer integrated coverage to address data fragmentation across organizations, improve visibility for data protection and governance, and address the merging of traditional IT management roles. Our team ensures the consistent and efficient delivery of Microsoft Purview solutions across all specialized environments, including Government and Sovereign clouds, while complying with relevant standards and regulations.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.**Responsibilities**\n--------------------\n\n* Design and implement large\\-scale data pipelines and services to support security data ingestion, normalization, and storage.\n* Collaborate with cross\\-functional teams including product management, security experts, and data scientists to translate business requirements into technical solutions.\n* Optimize platform performance to handle vast amounts of data across diverse digital systems while ensuring scalability, availability, and security.\n* Work on cloud\\-native technologies and distributed systems to build a robust, resilient, and secure platform.\n* Continuously improve the platform by leveraging new technologies and best practices in security, data governance, and cloud infrastructure.\n\n**Qualifications**\n------------------\n\n**Required/Minimum Qualifications:*** Bachelor's Degree in Computer Science, or related technical field AND 2\\+ years technical engineering experience with coding in languages including, but not limited to, C, C\\+\\+, C\\#, Java, JavaScript, or Python\n\t+ OR equivalent experience\n\n**Other Requirements:**\nSecurity Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:* Candidates must have an active TS/SCI and be willing to upgrade to TS/SCI (with polygraph). This role will require candidates to maintain the TS/SCI (with polygraph) clearance. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate clearance and/or customer screening requirements may result in employment action up to and including termination.\n* **Clearance Verification**: This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment.\n* **Microsoft Cloud Background Check**: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n* **Citizenship \\& Citizenship Verification:** This position requires verification of U.S citizenship due to citizenship\\-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customers and is subject to certain citizenship\\-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government clearance.\n\n **Preferred Qualifications:*** Familiarity with cloud platforms such as Azure, AWS, or GCP.\n* Understanding of security principles and the challenges of securing large\\-scale systems.\n* Background in working with high\\-scale, mission\\-critical SaaS products including service operations\n* Knowledge of data processing frameworks such as Spark, Hadoop, or similar technologies.\n* Experience with security data management, logging, or monitoring solutions.\n* Expertise in cloud\\-native architecture, microservices, and containerization (Docker, Kubernetes).\n* Strong problem\\-solving skills and a proactive mindset in delivering high\\-quality solutions.\n\n  \n\nSoftware Engineering IC3 \\- The typical base pay range for this role across the U.S. is USD $98,300 \\- $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 \\- $208,800 per year.  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay\n  \n\n  \n\nMicrosoft will accept applications for the role until January 19, 2025\\.  \n\n\\#MSFTSecurity \\#PURVIEW\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 98300.0,
        "max_amount": 208800.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-10",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-d3b9ed8d95563bd8",
      "title": "Integration Technical Infrastructure Manager",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=d3b9ed8d95563bd8",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1795688/Integration-Technical-Infrastructure-Manager?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Charlotte",
        "state": "NC"
      },
      "description": "Are you looking for a role that will leverage your Program Management and Technical Acumen and Construction knowledge with an industry leader? If you are, we have an exciting opportunity at Microsoft.  \n\nFor our **Integration Technical Infrastructure Manager** (ITIM), we are looking for an individual who has effective interpersonal, communication and organizational skills. We are seeking a Project Manager who has drive for results, along with the ability to self\\-direct and who has a strong background in Data Center Construction, with an emphasis on telecom project/construction management.  \n\nYou will be responsible for the project management of all integration and fit\\-out activities associated with MSFT owned system and/or services and critical infrastructure that is required to be installed into a new data center build or lease facility to deliver capacity to the business. The role requires the identification and management of scopes and interdependencies between all external and internal stakeholders and coordinating same with the physical construction with landlord and other vendors. The ITIM is responsible for coordinating the handover process and ensuring the required handover documentation and expectations are met to handover the space to our Operations teams and the business.  \n\nMicrosoft Cloud Operations and Innovation (CO\\&I) is the team behind the cloud. Within CO\\&I, the Engineering Procurement and Construction (EPC) team is responsible for delivering core datacenter infrastructure for Microsoft’s cloud business. The MS portfolio consists of complex, multi\\-disciplinary, large scale, multi\\-year datacenter construction and lease projects. We are looking for a passionate, high\\-energy individual to help build the cloud datacenters that power the world’s largest online services. In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.**Responsibilities**\n--------------------\n\n**General:*** The ITIM will be an advocate for managing a safe worksite , supporting the implementation of the Microsoft High Risk Activity (HRA) program and work with our Construction Program Manager (PM) and landlord groups to deliver trade collaboration methods to improve safe working and co\\-ordination of the job sites.\n* The ITIM is responsible for coordinating internal Microsoft scope and resource efforts, requirements, and schedules with those of the landlord, Owned Vendors and Suppliers to ensure a smooth and timely handover of the fitted out Data Centre facility and capacity to the Microsoft Operations team and Business Groups.\n* The ITIM will coordinate with the Data Center Engineering (DCE) team and supporting specialty consultants to review, improve and execute the design.\n* The ITIM is responsible for the coordination of the telecom materials procurement, telecoms installation, Security systems installation, Furiture, Furnishings \\& Equipment (FFE) procurement and installation\n* Coordination of the design, procurement, installation and turn up of the facility Corporate Network\n* In cooperation with the Construction Lead this position aligns metro wide delivery strategies to local team objectives, business processes, vendor management strategies, and cross\\-group collaboration efforts.\n* The ITIM will align with the Construction PM to agree delivery strategies across multi sites and manage a continuous improvement program that will result in a lean project delivery approach.\n* The ITIM will work alongside the Data Center Design (DCD) Construction Manager and report into the Regional ITIM team leader and is responsible for the delivery of Integration and Technical Infrastructure scope and deliverables for the US\\-West Region.\n\n**Business Processes:*** Create and/or maintain best practices to identify and incorporate cost\\-effective solutions in line with evolving build and lease program specification requirements and report on Key Performance Indicators (KPIs) for the same.\n* Manage the selection, contracting, and integration of multiple vendors and internal partners.\n* Drive deployment of solutions that can be socialized globally across Data Center projects, both builds and leases.\n* Facilitate client/sponsor decision\\-making to drive solutions, schedules, and manage change as required.\n* Apply influence, strategies and negotiation skills to identify options and recommend solutions.\n\n**Communication:*** Regularly reviews cost and KPI metrics, invoices, process/policy communications to client partners.\n* Coordinate meetings and activities of vendors, cost managers, and integration of lessons learned in support of the Construction PM.\n* Attend scheduled Integration meeting and other project meetings, and report as necessary.\n* Report Project Progress on scope, schedule, and budget in relation to the Integration scope and packages as required.\n* Provide weekly project status reporting to Data Center Execution standards.\n* Challenge and remove barriers by working with others around a shared need or customer benefit.\n* Ability to maintain a broader perspective, identify and evaluate opportunities to enhance the business through cross\\-group collaboration.\n* Incorporate diverse perspectives to thoroughly address complex business issues.\n\n**Accountability:*** Responsible for developing, managing, and reporting on scope, schedule, and budget in relation to the Integration and technical fit\\-out scope and packages.\n* Work independently in support of the Data Center Development Project.\n* Track lessons learned and identify and execute on cost down site up opportunities.\n* Provide Vendor oversight and performance management, as required.\n* Support Preparation of Request for Proposal (RFP’s), Packet Error Rate (PER’s), and other project approval tools \\& templates.\n* Review and approval of vendor scope of work and design review of site and building plans, as required.\n* Validate vendor pay\\-application and invoice review and approval in line with milestone payment schedules.\n* Manage compliance with prior audit results and recommendations.\n\n**Qualifications**\n------------------\n\n**Required/Minimum Qualifications:*** Bachelor's Degree in Construction Project Management, Architecture, Engineering, or related field AND 5\\+ years related experience\n\t+ OR equivalent experience.\n\n**Other Requirements:**  \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role.\nThese requirements include but are not limited to the following specialized security screenings:\n* Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\n**Additional or Preferred Qualifications:*** Bachelor's Degree in Construction Project Management, Architecture, Engineering, or related field AND 8\\+ years related experience\n\t+ OR equivalent experience.\n* 7\\+ years experience working on data center projects.\n\n\nConstruction Project Management IC4 \\- The typical base pay range for this role across the U.S. is USD $94,600 \\- $183,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $122,000 \\- $200,500 per year.  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay  \n\nMicrosoft will accept applications for the role until January 18, 2025\\.  \n\n\\#COICareers and \\#EPCCareers \\#DataCenter \\#ProjectManagement\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 94600.0,
        "max_amount": 200500.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-19",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-be4bf76674f4de28",
      "title": "Director of Critical Programs and Transformation",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=be4bf76674f4de28",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1796235/Director-of-Critical-Programs-and-Transformation?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": null,
        "state": null
      },
      "description": "Microsoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life\\-changing innovations that impact billions of lives around the world. You can help us to achieve our mission.\n  \n\n  \n\nWith over 15,000 employees worldwide, the Microsoft Customer Experience and Success (CEnS) organization is responsible for the strategy, design, and implementation of the Microsoft end\\-to\\-end customer experience. This organization reflects the Microsoft ambition to be known as a customer experience company, ensuring our Microsoft mission to empower every person and every organization on the planet to achieve more is enabled by delighting customers and consistently exceeding their expectations in every interaction through a connected customer experience.\n  \n\n  \n\nMicrosoft has a tremendous opportunity to exceed customer expectations and drive greater customer loyalty and trust, which leads to greater satisfaction, retention, and growth. The CEnS organization is looking for people with a passion for delivering customer success to help us build a future where customers come to us, not only because we provide industry\\-leading products and services, and also because we provide a differentiated and connected customer experience that is rooted in our commitment to delivering on customer outcomes.  \n\nAs the Director of Critical Programs and Transformation, you'll be focused on our most critical CE\\&S Programs that will transform our organization and you will be accountable to design the criteria defining the programs deemed as the highest impact and lead a team that will have responsibility for driving beginning\\-to\\-end strategy for these programs or initiatives. You along with your team will ensure programs stay on strategy pulling in all necessary stakeholders across Microsoft to land the programs successfully. Your team will be accountable to track progress and succinctly articulate each programs’ progress to audience varying from our CE\\&S Leadership (Mala Anand and Directs), Sr. Leader stakeholders across both MCAPS and the Engineering Group within Microsoft. In addition, this role will be accountable to design the business executive communications related to all GCS Operations including any external facing executive communications.\nPartnership across all areas of the business will be crucial. You will ensure our CE\\&S programs and initiatives align with our stakeholders building working relationship and successfully navigating across various teams toward execution.  \n\n  \n\nWe are looking for a well\\-rounded leader with a proven ability to navigate complex stakeholders across the company, and an ability to speak with leaders at all levels and influence through alignment. If you are energized by ambiguity, have an entrepreneurial spirit, able to work with empathy when under pressure, and operate with high confidence and interpersonal awareness, then this may be your next role.**Responsibilities**\n--------------------\n\n* Coach M1’s and Develop High Performing Team: Lead / create a Thriving team of M1 managers and Business Program Managers (M1’s and IC’s) with career growth and development.\n* Lead program improvements and growth, developing future strategies and engagement models to land our most critical initiatives including assessing and advising Leaders and Stakeholders on risks and mitigation.\n* Identify areas to simplify, streamline and automate programs moving CE\\&S toward a truly transformational change\n* Enable cross team collaboration through engagement\n* Amplify the impact of programs through effective communication venues\n* responsibility to develop a reporting and insights mechanism to share progress, report success metrics and adoption tracking with organization and stakeholders\n* Weave data insights to inform decisions and drive change management leadership in everything we do\n\n**Qualifications**\n------------------\n\n**Required Qualifications**  \n\n* Bachelor's Degree in Business, Operations, Finance or related field AND 8\\+ years work experience in program management, process management, process improvement\n\t+ OR equivalent experience.\n* 6\\+ years management (e.g., people, project, process, vendor, change) experience.\n* 6\\+ years of people management experience.\n\n **Preferred Qualifications*** 15\\+ years work experience in program management, process management, process improvement.\n* Experience in the technology industry.\n* Demonstrated ability to collaborate and deliver results across organizations and teams with excellent interpersonal skills to build positive working relationships across groups and all management levels.\n* Passion for driving and landing change\n* Track record of cross\\-group collaboration and coordination at multiple levels of the company, and across different cultures within a global organization\n* Proven success with relationship management including ability to rapidly build trust and confidence of stakeholders, as well as influence business decisions across boundaries, at all levels of the organization, and often in ambiguous situations\n* Business maturity and experience working with senior leaders, with the ability to work independently\n* Executive presence and high proficiency with written and verbal communication skills\n* Global program orchestration and execution skills, with ability to manage and deliver multiple projects simultaneously\n* Track record of creating order out of chaos and clarity out of confusion\n* Ability to learn and synthesize complex topics and needs\n* Attention to detail and accuracy in all deliverables\n* Ability to deliver tough messages diplomatically and quickly drive toward solutions to problems\n* Proven ability to design and balance strategic priorities against operational needs\n* Track record of leading through influence to deliver results\n* Proven Organizational agility.\n\n  \n\nBusiness Program Management M6 \\- The typical base pay range for this role across the U.S. is USD $129,200 \\- $273,400 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $162,000 \\- $299,400 per year.  \n\n  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay\n  \n\n  \n\nMicrosoft will accept applications for the role until January 13, 2025\\.  \n\n\\#CES \\#GCS\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 129200.0,
        "max_amount": 299400.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-23",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-4116c8e706f14cd5",
      "title": "Senior Software Engineer",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=4116c8e706f14cd5",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1790724/Senior-Software-Engineer?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Redmond",
        "state": "WA"
      },
      "description": "Microsoft Cloud Operations \\+ Innovation (CO\\+I) is the team behind building the Microsoft cloud. Within CO\\+I, the Datacenter Planning \\& eXecution Engineering (DPXE) team is responsible for delivering datacenter capacity for Microsoft’s cloud business. We have a portfolio of complex, multi\\-disciplinary, multi\\-million, multi\\-year datacenter construction and lease projects with specific safety, quality, schedule, and cost goals.\n  \n\n  \n\nThe DPX Engineering team is responsible for architecting, designing, and building the next generation of connected systems and tools using microservices architecture or ERP platforms to help manage and support critical business functions such as Supply Chain, Cost, Schedule, Networking, Commissioning, Safety, Planning etc. in a real time manner. The team has a charter to deliver against the NorthStar goal of building robust automation for these functions through well engineered systems and at the same time design and build the next gen, ML based, recommendation engine to enable cost and schedule modeling, supply planning, execution planning etc. while integrating with the bigger CO\\+I ecosystem.  \n\nOur Systems Engineering team delivers innovative solutions to address the automation needs to scale our delivery capabilities. We are looking for a passionate, high energy Senior Software Engineer who can deal with ambiguity and challenge the status\\-quo to deliver automation capabilities that power the long\\-range execution planning efforts, drive workflow improvements, and build solutions to assist in the delivery of large\\-scale data centers through efficient management of cost and schedule. If you want to work with a motivated team of engineers and program managers from various disciplines, if working on a V1 product/release and related challenges excite you, and if you want to build the foundation of the cloud delivery experience, look no further. If you are passionate about being part of the delivery of engineering solutions enabling Microsoft’s cloud infrastructure, this is for you.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.* This role is located either in one or all hub locations \\- Atlanta, GA, Washington, D.C., Redmond, WA, San Antonio, TX or Phoenix, AZ.\n* Relocation support will be provided, and successful candidates must relocate or reside within 50 miles of the hub office location.\n* This role is eligible for hybrid or remote work, up to 100%.\n\n**Responsibilities**\n--------------------\n\n  \n\n* Write high quality, maintainable, reusable, secure code using OOPs concepts and SOLID principles.\n* Resolve system integration challenges working with other members of the team and external teams.\n* Collaborate with and demonstrate features developed to stakeholders in an Agile environment.\n* Share learnings and code assets developed with the CO\\+I engineering team.\n\n**Qualifications**\n------------------\n\n**Required/Minimum Qualifications:*** Bachelor's Degree in Computer Science, or related technical discipline AND 4\\+ years technical engineering experience with coding in languages including, but  \n\nnot limited to, C, C\\+\\+, C\\#, Java, JavaScript, or Python\n\t+ OR equivalent experience.\n* Software development experience in any two of the following areas: Web and API development (.NET stack), UI technologies (React/Angular, node.js, etc.), Microsoft Azure/any other cloud platform, Dynamics 365/Power Platform.\n\n **Other Requirements:**  \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. **Preferred/Additional Qualifications:*** Bachelor's Degree in Computer Science or related technical field AND 8\\+ years technical engineering experience with coding in languages including, but not limited to, .Net Stack or Full Stack or Data Engineering OR Master's Degree in Computer Science or related technical field AND 6\\+ years technical engineering experience with coding in languages including, but not limited to, .Net Stack or Full Stack or Data Engineering.\n* Experience working through the full product cycle from initial design to rapid production deployment\n* Experience with shipping software products across multiple platforms/devices\n* Ability to incorporate and understand the needs of our diverse customer base, including customers using assistive technology\n* Technical implementation knowledge in Azure Synapse, Azure Data Factory, Azure Data Catalog/Purview, Azure Analysis Service, SQL Datawarehouse, Kusto, Data Analysis, Azure Data Lake, Azure Databricks.\n* Experience working in construction/capital projects and integration of supply chain activities into engineering, procurement and construction.\n* Technical implementation knowledge integration with external systems (Azure, Dynamics 365, SAP others) is a big plus.\n\n\nSoftware Engineering IC4 \\- The typical base pay range for this role across the U.S. is USD $117,200 \\- $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 \\- $250,200 per year.  \n\n  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay.  \n\n  \n\nMicrosoft will accept applications for the role until January 16, 2025\\.  \n\n\\#COICareers  \n\n\\#COIEngCareers  \n\n\\#COIE\\_DPXEcareers\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 117200.0,
        "max_amount": 250200.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-02",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-c3cd9dcf0876cab5",
      "title": "Senior Researcher – Computational Social Science – Microsoft Research",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=c3cd9dcf0876cab5",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1788482/Senior-Researcher-Computational-Social-Science-Microsoft-Research?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "New York",
        "state": "NY"
      },
      "description": "The Computational Social Science group at Microsoft Research NYC is actively seeking a **Senior Researcher** to join us in advancing the state\\-of\\-the\\-art in computational social science and online experimentation. The ideal applicant will possess awareness of the theoretical and experimental social science literature, experience with experimental design, as well as demonstrated statistics and computer programming expertise.  \n\nMicrosoft Research offers an exhilarating and supportive environment for cutting\\-edge, multidisciplinary research with access to an extraordinary diversity of big and small data sources, ample budget for online experimentation, and close links to top academic institutions around the world. We seek applicants with the passion and ability to craft and pursue an independent research program, including a strong publication record at top research venues.  \n\nThe Computational Social Science group in New York includes the following researchers (click on each link to view their respective projects and publications): Dan Goldstein, Jake Hofman, and David Rothschild. We collaborate extensively with the other groups at MSR NYC and New England: FATE (fairness/accountability/transparency/ethics in AI), Economics and Computation, Machine Learning and AI and AI for Systems) and with groups across Microsoft Research.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.  \n\n  \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.**Responsibilities**\n--------------------\n\n\nAs a **Senior Researcher**, you will design, develop, execute, and implement technology research projects in collaboration with other researchers, engineers, and product groups.  \n\nAs a member of a world\\-class research organization, you will be a part of research breakthroughs in the field and will be given an opportunity to realize your ideas in products and services used worldwide.  \n\nEmbody our culture and values.**Qualifications**\n------------------\n\n**Required Qualifications*** Doctorate in a social science, mathematical, or computational field\n\t+ OR equivalent experience.\n* Proven computer programming skills demonstrated by the authorship and/or publication of source code and the completion of programming courses at the undergraduate or graduate level.\n* Publication record as a lead author or essential contributor at top journals or conferences in areas that overlap with the members of the computational social science group.\n\n**Other Requirements**  \n\nTo ensure we receive a complete application from you, please be sure to follow these instructions:* Upload your CV.\n* When prompted in your application, please provide the names and contact information of at least 2 referees (in most cases one will be from your dissertation advisor; others may be from any other senior collaborators).\n* Upload (as separate attachments to your application) 2 conference or journal articles, book chapters, or equivalent writing samples that you are most proud of and which best demonstrate your expertise.\n* Upload (as an attachment to your application) one academic statement (min 2 pages) that outlines both your research achievements and agenda, and your service and outreach activities and plans (e.g., those related to mentoring or diversity).\n\n\nAfter you submit your application, the system will send a request for letters to your list of referees on your behalf. Note: The application system will not request reference letters until after you have submitted your application. You may wish to alert your letter writers in advance so that they will be ready to submit your letter by our application deadline. While you will not be able to view the letters themselves, you can check the status of individual reference requests within your application. **Preferred Qualifications*** Ability to work in a highly collaborative and interdisciplinary environment\n* Experience designing and running large\\-scale online experiments\n* Participation and activity in the scientific community\n\n\nResearch Sciences IC4 \\- The typical base pay range for this role across the U.S. is USD $117,200 \\- $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 \\- $250,200 per year.  \n\n  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay\n  \n\n  \n\nMicrosoft will accept applications for the role until January 31, 2025  \n\n\\#Research\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 117200.0,
        "max_amount": 250200.0,
        "currency": "USD"
      },
      "date_posted": "2024-11-25",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-1fe8aa6d09d2675b",
      "title": "Data Center Technicians Manager",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=1fe8aa6d09d2675b",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1790535/Data-Center-Technicians-Manager?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Phoenix",
        "state": "AZ"
      },
      "description": "As a Data Center Technician (DCT) Manager, you will lead a team of technicians, providing expert guidance on performing hardware deployments, diagnostics on equipment, and hardware decommissions. You will support technician performance, prioritizing technician tasks while monitoring Key Performance Indicators (KPIs) and Service Level Agreements (SLAs). This opportunity will allow you to model leadership principles, provide training to technicians, and accelerate your career growth in the process.  \n\nMicrosoft’s Cloud Operations \\& Innovation (CO\\+I) is the engine that powers our cloud services. As a CO\\+I DCT Manager, you will perform a key role in delivering the core infrastructure and foundational technologies for Microsoft's online services including Bing, Office 365, Xbox, OneDrive, and the Microsoft Azure platform. As a group, CO\\+I is focused on the personal and professional development of all employees and offers training and growth opportunities including Career Rotation Programs, Diversity \\& Inclusion training and events, and professional certifications.  \n\nOur infrastructure is comprised of a large global portfolio of more than 200 data centers in 32 countries and millions of servers. Our foundation is built upon and managed by a team of subject matter experts working to support services for more than 1 billion customers and 20 million businesses in over 90 countries worldwide.  \n\nWith environmental sustainability and optimization at the forefront of our data center design and operations, we continue to grow and evolve as we meet the ever\\-changing business demands that hold Microsoft as a world\\-class cloud provider.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.**Responsibilities**\n--------------------\n\n**People Management*** Managers deliver success through empowerment and accountability by modeling, coaching, and caring.\n* Model \\- Live our culture; Embody our values; Practice our leadership principles.\n* Coach \\- Define team objectives and outcomes; Enable success across boundaries; Help the team adapt and learn.\n* Care \\- Attract and retain great people; Know each individual’s capabilities and aspirations; Invest in the growth of others.\n\n**Datacenter Operations*** Encourages the sharing of expertise in and provides guidance on standard processes and procedures for preparing, installing, performing diagnostics, troubleshooting, replacing, and decommissioning IT datacenter technology(ies) and equipment. Encourages the sharing of expertise and provides guidance on the functions of, and interactions between cabling infrastructure, network, server, and storage equipment. Develops awareness of Information Technology Infrastructure Library (ITIL) Foundation components: Incident Management and Change Management.\n* Advises on and reviews suggested modifications to process and procedures to manage changes and drive improvement in service quality and/or efficiency. Proactively investigates, evaluates, and analyzes changes. Reviews Process Change Notifications (PCNs) to evaluate impact on service execution and shares relevant information about change with stakeholders across functions and disciplines to mitigate the impact they may have on others. Encourages technicians to ask questions when they do not have required information, resolves others' questions in a timely manner, and may provide feedback on changes to processes to direct\\-line management, standards management teams, and/or project, program, or special initiative managers.\n* Provides guidance on, and holds a team of technicians accountable for compliance with Data Center business unit policies, procedures, and deadlines. Proactively reviews and provides feedback regarding Data Center business unit policies, procedures, and deadlines. Resolves issues related to compliance or operational assurance activities directly, or with assistance from compliance colleagues and/or business partners. Provides input on improvement plan components for service delivery gaps or challenges.\n* Ensures a team of technicians can complete assigned tickets efficiently and in alignment with relevant Key Performance Indicators (KPIs) per task type. Supports escalation of challenging or complex tickets to internal business partners and appropriately summarizes relevant issues for communication to direct\\-line management. Coordinates and assigns tasks to technicians, and/or provides input or coordination with appropriate program managers and direct\\-line management for ticket assignment automation to provide direction as needed, to ensure work is appropriately allocated to meet Key Performance Indicators (KPIs) per task type. Monitors progress of tickets assigned to teams of technicians and adjusts where necessary, to meet established Key Performance Indicators (KPIs) per task type. Analyzes data related to technicians' performance on tickets and shares with direct\\-line management.\n\n**Service Delivery*** Coordinates training packages for technicians on procedures for installation, deployment, upgrade, refresh, simple change, decommission and/or replacement of infrastructure cabling, network, storage, or server equipment. Provides guidance to technicians for developing an effective execution order of assigned tasks and ensures technicians have access to tools and/or supplies required to perform work. Investigates root causes of issues that may have negatively impacted ticket Key Performance Indicators (KPIs) per task type, and takes proactive corrective action.\n* Evaluates procedures for performing quality checks to ensure they align with compliance standards and process adherence, and takes responsibility for impact to Key Performance Indicators (KPIs) by task type of work performed by technicians. Performs post\\-execution verification of grounding, staging, labeling, and cabling as needed to ensure alignment with all safety protocols, deployment standards, and planned Network Design Templates (NDTs), taking corrective action(s) to address any non\\-compliance, and validates post\\-execution quality or validation training has been completed by applicable technicians to enable them. Identifies errors in deployment standards or Network Design Templates (NDTs) and coordinates directly with internal business partners, technologists, or subject matter experts (SMEs) to develop corrections as needed.\n* Evaluates diagnostic and troubleshooting processes and suggests improvements. Maintains advanced awareness of conditions, circumstances, and scenarios which may reflect significant customer or business impact within the Data Center environment, and escalates observations of imminent incident risks or potential situations immediately to direct\\-line management.\n* Follows procedures to immediately engage Designated Responsible Individuals (DRIs) for appropriate communication, reporting, and incident management of data center technical or safety related incidents with direct\\-line management, internal business partners, and impacted engineering group contacts. Participates in bridge calls to provide details on incident status and executes on\\-site follow\\-up actions as directed if necessary. May leverage learnings to contribute to the improvement of quality of service and support.\n* Verifies compliance with standards and procedure for data\\-bearing devices (DBDs) destruction and/or confirms any\\-and\\-all such devices (e.g. hard\\-drives, solid\\-state drives, flash cards, etc.) contained within network, storage, or server equipment has been identified for eradication or destruction. Creates schedules for shift\\-based technicians to ensure positioning and availability to execute work as defined by organizational standards, negotiates with internal team colleagues to organize project timelines, with guidance from direct\\-line management, and appropriate notification to stakeholders.\n* Manages assigned projects or programs to meet service delivery objectives. Participates in pilot programs or task forces to ensure smooth implementation for future service delivery as directed.\n* Proactively reviews schedules and avoids conflicts when possible. Identifies, coordinates, manages expectations, and offers alternatives when defining technical solutions in light of ongoing operations and procedures (e.g., schedule, technical feasibility, policy, procedure, tools).\n\n**Managing Service*** Exercises judgment and discretion to contribute to issue tracking related to follow\\-up and resolution to overall quality of service escalations and/or proactive initiatives. Maintains responsibility for client and technician team interactions for escalations and/or engagements between them and other internal business partners.\n* Collects and reviews appropriate Key Performance Indicators (KPIs) for their team to support line of business (e.g. performance measures, long\\-term trends) and/or business intelligence analysis (e.g., service availability data, system health). Shares feedback from reviews with technicians to drive improvement in meeting KPI expectations and sharing learnings from reviews with direct\\-line management.\n* Partners with internal and external stakeholders to manage the removal of risks to personnel and/or resource availability, performance, and compliance.\n* Identifies and assigns required training as applicable across all technician job focus areas and workloads (i.e., Break fix, Deployment, Simple Change, Decommission, IT Critical Environment) along with Personnel Management training in a timely manner per direct\\-line management assignment(s) and validates completion of assigned training by team members. May complete additional or supplemental training to obtain or maintain relevant industry or technical certifications and advise their team on relevant certifications to obtain.\n\n**Datacenter Work Environment*** Conducts daily safety briefings, ensuring their team members attend, and/or participates in onsite safety committees. Completes required Environmental \\& Health Safety (EHS) training, ensures technicians comply with EHS training completion requirements and are compliant with safety procedures (e.g., equipment use, lifting, electrical hazards, ladder/rolling stair use), Task Hazard Analysis (THAs) completion, and use of appropriate equipment and Personal Protective Equipment (PPE) for assigned tasks. Adheres to and promotes a culture of safety, empowering technician teams to report and/or take proactive action regarding safety concerns, near\\-misses, and/or incidents. Participates in the regular cadence of proactive safety observation reporting processes and systems and follows up with their team members as needed regarding actionable safety observations reported.\n* Completes required security and data management training, ensures technicians completion of applicable training, and maintains accountability for technician compliance with security and data management procedures/policies. Ensures that policies and procedures securing physical access to the data center or network site environment(s) are appropriately enforced. May escort third party vendors or IT support on\\-premises at data centers or network sites. Appropriately takes action and reports physical security access concerns and/or incidents, and gathers information about such events reported by their team to inform direct\\-line management and escalates to relevant stakeholders. Participates in identifying the root cause of any physical security access violations and manages corrective actions and escalations related to technician violations of physical security procedures or policies.\n* Promotes a positive and effective team environment by modeling best practices, leading regular team meetings, cross\\-discipline collaborations, and monitoring the status of work across their team to understand the impact on other shifts/technician teams, engineering groups or internal business partner needs, and the overall business. Provides, responds to, and encourages providing feedback regarding on ways to work more effectively or enhance efficiency within their team and adopts best practices shared within\\-and\\-across shifts or technician teams.\n\n**Physical Requirements (Applies to but is not limited to US\\-based Data Center roles)*** Occasional climbing of ladders.\n* Frequent climbing of stairs and/or ramps.\n* Prolonged standing.\n* Occasional lifting 50lbs. / 22\\.5kg.\n* Occasional push or pull 50\\-75lbs. / 22\\.5\\-34kg. with assistive device.\n* + Normal visual acuity (near, far and peripheral with correction).\n\t+ Normal color vision for electrical work.\n\t+ Normal is defined via standard medical terms and applicable criteria.\n\n**Other*** Embody our culture and values.\n\n**Qualifications**\n------------------\n\n**Required Qualifications**\n* High school diploma, GED, or equivalent and basic knowledge of computer hardware and components AND 3\\+ years experience supporting IT equipment or related technology or related experience working with teams\n\t+ OR equivalent experience.\n* 1\\+ year(s) experience directing, supervising, or managing others or leading a project.\n\n**Other Requirements:**  \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:* **Microsoft Cloud Background Check:** This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter\n\n**Preferred Qualifications:*** Associate's degree in Computer Science or realted field AND 6\\+ years experience supporting IT equipment or related technology\n\t+ Bachelor's degree in Computer Science or related field AND 5\\+ years experience supporting IT equipment or related technology\n\t+ OR equivalent experience.\n* 3\\+ years experience working in a production, mission\\-critical 24x7x365 datacenter environment.\n* Applicable certifications: Information Technology Infrastructure Library (ITIL) Foundation, ASICS/Inventory Control, CompTIA (A\\+, Server\\+, Network\\+), Basic Structure Cabling (BSC), Certified Data Center Professional (CDCP), Microsoft Certified Professional (MCP), Six Sigma Green Belt).\n* 2\\+ years experience leading a diverse team.\n\n**Data Center Technicians M3** \\- The typical base pay range for this role across the U.S. is USD $74,100 \\- $165,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $104,000 \\- $182,200 per year.  \n\n  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay  \n\n  \n\nMicrosoft will accept applications and processes offers for these roles on an ongoing basis.  \n\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 74100.0,
        "max_amount": 182200.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-20",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-a9e4d9f1722ef666",
      "title": "Director of Production - Xbox Game Studios, Publishing",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=a9e4d9f1722ef666",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1781803/Director-of-Production-Xbox-Game-Studios-Publishing?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Redmond",
        "state": "WA"
      },
      "description": "The Xbox Game Studios Publishing (XGSP) Team responsible for the recently released *Towerborne*, *Ara: History Untold*, *Microsoft Flight Simulator*, *As Dusk Falls*, *Ori and the Will of the Wisps*, and *Tell Me Why* is seeking a Director of Production responsible for working with a team of XGSP Executive Producers and the supporting production team, central publishing services, Xbox Partners, and independent development studios on console and PC games developed for Xbox Services. This will be a leadership role within the Publishing Team reporting to the GM of Publishing.\n\n\nThe Director of Production should have experience with internal and external game console development processes, superior operational skills and excellent verbal and written communication skills. They should also be interested in delivering high quality games and business success. They must be a team\\-player, highly organized, self\\-motivated, and detail oriented with great follow\\-through skills and the ability to prioritize and manage large complex organizational and executional issues.\n\n\nThe Director of Production will be forging partnerships with internal teams and external development teams, including day\\-to\\-day communication and management, as necessary. It also includes overseeing all the workstreams that go into managing a game from start to release and maintaining an environment of trust and excellence. The Director of Production will work on multiple games, with an internal publishing team, ensuring that milestones are delivered on\\-time, on\\-budget and complete as per the approved Development plan, and that the approved submissions maintain alignment with the established Franchise plan.  \n\nAs a leader, this role will contribute to shaping the Publishing organization culture and refining our production processes.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.**Responsibilities**\n--------------------\n\n**Production Process:*** Accountable for the team managing the publishing activities associated with console game development projects on their team.\n* Serve as the executive contact to development teams throughout the production process.\n* Works collaboratively with development partners and internal staff to help shape product positioning and features.\n* Oversees the Xbox stakeholder communication.\n* Oversees the review, and feedback of milestone submissions for assigned products.\n* Works with Legal (CELA) and Business Management to manage budget against product P\\&L.\n* Develops strong relationships with development studios to establish and maintain a reliable and timely flow of information and materials to all parties as necessary for assigned project.\n* Works with XGSP Executive Producer and developer management to help identify and mitigate project risks.\n* Identifies and establishes required production group process and workflow improvements to ensure timely and high quality delivery of assigned projects.\n* Work directly with business development on Developer Agreements when applicable and communicate production related issues to the appropriate parties for assigned projects.\n\n **Communication:*** Works across the publishing organization to drive accountability for shaping and maintaining product goals and dates.\n* Coordinates and liaises with all necessary departments and divisions to facilitate execution of projects and materials in a professional manner. This includes keeping Xbox department heads apprised of products status.\n* Works closely with the appropriate production and other internal Xbox staff to research and identify and/or obtain clearances for all materials needed for the creation of assigned projects.\n* Keep all key stakeholders informed of product status and vision through the preparation and presentation of appropriate project materials (including milestone updates, work\\-in\\-progress presentations, etc.)\n\n **Strategic Planning:*** Participates in creation of franchise plans; plus establishing and then growing a Community for your game\n* Implementation and management of production processes, policies and procedures.\n* Improving and evolving the Xbox Publishing production and organizational management structure, process and procedures.\n\n  \n\nEmbody our Culture \\& Values**Qualifications**\n------------------\n\n**Required Qualifications**\n\n* Bachelor's Degree AND 6\\+ years experience in production roles in gaming or entertainment industry, or other multi\\-disciplinary leadership\n\t+ OR equivalent experience.\n* 3\\+ years experience in managing budget for large production projects (e.g., several hundred thousand dollars or more).\n* Experience in full development of at least one major product release.\n* 3\\+ years experience managing relationships with stakeholders, clients, and/or customers.\n* 3\\+ years people management experience.\n\n**Preferred Qualifications**\n\n* Previous experience as an Executive Producer or equivalent with game developer or publisher.\n* 3\\+ years experience specifically managing Game Producers and/or Game Developers.\n* 10\\+ years’ experience in console and/or PC videogame game production; experience shipping PC and/or console games necessary.\n* Game development experience, through an entire product’s development from Concept to Launch to Live.\n* Experience in setting, guiding and evaluating multiple styles of production processes.\n* Experience managing budgets for large multimillion dollar game productions.\n* Multi\\-language localization experience.\n* Experience with Multiplayer \\& LiveOps games.\n\n  \n\nGame Producers M5 \\- The typical base pay range for this role across the U.S. is USD $137,600 \\- $267,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $180,400 \\- $294,000 per year.  \n\n  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay\n  \n\n  \n\nMicrosoft will accept applications for the role until January 09, 2025\\.  \n\n\\#xgspublishingjobs\n\\#gamingjobs\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 137600.0,
        "max_amount": 294000.0,
        "currency": "USD"
      },
      "date_posted": "2024-11-04",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-8befbde6318ff78c",
      "title": "Critical Environment Operations Manager",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=8befbde6318ff78c",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1790980/Critical-Environment-Operations-Manager?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Phoenix",
        "state": "AZ"
      },
      "description": "Microsoft’s Cloud Infrastructure and Operations (MCIO) is the engine that powers our cloud services. As a **Critical Environment Operations Manager**, you will perform a key role in delivering the core infrastructure and foundational technologies for Microsoft's over 200 online businesses including Bing, Office 365, Xbox, OneDrive and the Microsoft Azure platform.  \n\nOur infrastructure is comprised of a large global portfolio of more than 200 datacenters in 32 countries and millions of servers. Our foundation is built upon and managed by a team of subject matter experts working to support services for more than 1 billion customers and 20 million businesses in over 90 countries worldwide.  \n\nWith environmental sustainability and optimization at the forefront of our datacenter design and operations, we continue to grow and evolve as we meet the ever\\-changing business demands that hold Microsoft as a world\\-class cloud provider.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.**Responsibilities**\n--------------------\n\n* Empower a culture of safety, security, and compliance in all aspects of our Datacenter operations\n* Lead a team of Mechanical, Electrical and Control System professionals supporting Microsoft's online services\n* Oversee the day\\-to\\-day operations and maintenance of mechanical and electrical equipment in our Datacenters\n* Maximize Critical Environment (CE) availability to ensure optimal operational efficiency\n* Reduce high\\-impact and human\\-error Critical Environment (CE) incidents year over year\n* Deliver on cost/energy efficiency initiatives\n* Ensure routine reporting to effectively manage and analyze our Power/Temperature/Relative Humidity, and SLA monitoring\n* Establish and enhance strong working relationships and engagement with our Engineering Groups (EGs), and business partners\n* Work with regional and global peers to share and build best practices across the entire datacenter portfolio\n\n**Qualifications**\n------------------\n\n**Required Qualifications:*** High School Diploma or equivalent AND 3\\+ years experience of mission\\-critical service management (e.g., providing IT services, manufacturing, warehouse, retail, military, or managing physical operations in an IT and/or critical environment infrastructure) and leading teams\n\t+ OR equivalent experience.\n\n**Other Requirements:**\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:* Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\n**Preferred Qualifications****:*** Bachelor's or Technical College Degree in Computer Science, Math, Telecommunications, Electrical/Mechanical Engineering, Supply Chain Management or related field AND 8\\+ years experience in Critical Environment infrastructures (e.g., UPS, Generator, AHU), or working in physical IT infrastructures (e.g., Servers, SANs, Networking, Capacity, DC Rack/Enclosures, structured cabling)\n\t+ OR High School Qualification or equivalent AND 10\\+ years experience in Critical Environment infrastructures (e.g., UPS, Generator, AHU), or working in physical IT infrastructures (e.g., Servers, SANs, Networking, Capacity, DC Rack/Enclosures, structured cabling) AND Experience managing budget $1M\\+.\n\t+ OR equivalent experience.\n* People management experience.\n* Applicable certifications: ASICS/Inventory Control, CompTIA, Microsoft, Network Certifications, CCNA Certifications, ITIL v3 Foundation, Microsoft Operations Framework (MOF) Certifications, Leadership Development Certifications, PMP, CDCP.\n* Bachelor’s Degree or Technical College certification in mechanical or electrical engineering and/or services\n* Experience working on large scale CE projects\n* Experience with the operation of IT infrastructure (Servers, SANs, Networking, etc.)\n\n\nData Center Operations Management M4 \\- The typical base pay range for this role across the U.S. is USD $100,800 \\- $195,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $135,200 \\- $222,000 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay\n\nMicrosoft will accept applications for the role until January 12, 2025  \n\n\\#COICareers\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 100800.0,
        "max_amount": 222000.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-12",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-5b17d98e1e3103bb",
      "title": "Senior Applied Scientist",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=5b17d98e1e3103bb",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1798977/Senior-Applied-Scientist?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Redmond",
        "state": "WA"
      },
      "description": "Microsoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud\\-enabled world.  \n\nThe Azure AI Speech Group brings together talents in the areas of signal processing, speech modeling, statistical modeling and Deep Learning to develop and deliver robust, natural and scalable speech recognition and translation, across a rich set of scenarios and languages.  \n\nAs a science team in the Speech Group, we industrialized deep learning speech technologies, and contributed key innovations to the speech community. We work on all kinds of end\\-to\\-end speech technologies, targeting on the most challenging problems by inventing new algorithms. To that end, we welcome a **Senior Applied Scientist** who is passionate at innovating the state\\-of\\-the\\-art speech modeling technologies, which impact millions of users.  \n\n.In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.  \n\nWe do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more, and we’re dedicated to this mission across every aspect of our company. Our culture is centered on embracing a growth mindset and encouraging teams and leaders to bring their best each day. Join us and help shape the future of the world.**Responsibilities**\n--------------------\n\n\nYour responsibilities include developing novel speech algorithms to advance state\\-of\\-the\\-art speech technologies for real world user scenarios, especially in integrating speech with LLM for multimodal modeling.* Helps address scalability problems by adjusting to stakeholder needs.\n* Works with large\\-scale computing frameworks, data analysis systems, and modeling environments to improve models.\n* Applies the model to real products, and then verifies effects through iterations.\n* Experiments by putting multiple models in production and evaluating their performance. Continues to monitor how algorithm performs against expected behaviors and performance or accuracy guardrails.\n* Embody our culture and values\n\n**Qualifications**\n------------------\n\n**Required Qualifications:*** Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 4\\+ years related experience (e.g., statistics predictive analytics, research)\n\t+ OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3\\+ years related experience (e.g., statistics, predictive analytics, research)\n\t+ OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1\\+ year(s) related experience (e.g., statistics, predictive analytics, research) OR equivalent experience.\n\n**Preferred Qualifications:*** 1\\+ year(s) experience developing and deploying products or systems at multiple points in the product cycle from ideation to shipping.\n* 1\\+ year(s) experience developing and deploying live production systems, as part of a product team.\n* 3\\+ years experience conducting research as part of a research program (in academic or industry settings).\n* Experience presenting at conferences or other events in the outside research/industry community as an invited speaker.\n* 3\\+ years experience creating publications (e.g., patents, libraries, peer\\-reviewed academic papers).\n* Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 6\\+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3\\+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience.\n* 2\\+ years experience presenting at conferences such as Automatic Speech Recognition and Understanding (ASRU) International Conference on Acoustics Speech and Signal Processing (ICASSP), Interspeech or other events.  \n\nresearch/industry community as an invited speaker.\n\n\nApplied Sciences IC4 \\- The typical base pay range for this role across the U.S. is USD $117,200 \\- $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 \\- $250,200 per year.  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay  \n\nMicrosoft will accept applications for the role until January 20, 2025\\.  \n\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 117200.0,
        "max_amount": 250200.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-06",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-48b822fb264d8dc5",
      "title": "Architect Engineer (AE) Regional Sourcing Manager",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=48b822fb264d8dc5",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1793828/Architect-Engineer-AE-Regional-Sourcing-Manager?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Ireland",
        "state": "WV"
      },
      "description": "Microsoft Cloud Operations and Innovation (CO\\+I) is the team behind the cloud. We are responsible for delivering over 200 Microsoft web portals, Live and Online Services around the world including infrastructure, security and compliance, operations, globalization, and manageability. Our focus is on smart growth, high efficiency, and delivering a trusted experience to customers and partners worldwide. We are looking for a passionate, high\\-energy individual to help build the network that powers the world’s largest online services.  \n\nWithin CO\\+I, the Contracts Management team is responsible for establishing a construction services supply chain that can meet and deliver services to support the ever\\-growing growth of the Cloud and our customers. We support a portfolio of complex, multi\\-disciplinary, multi\\-billion, multi\\-year datacenter construction projects.\nWe are looking to fill a critical role of **Architect Engineer (AE) Regional Sourcing Manager** to lead the sourcing and category management for construction consultancy services as we continue to develop our build program across the Europe Middle East Africa (EMEA) region.  \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.**Responsibilities**\n--------------------\n\n **Responsibilities:**  \n\nThe role of the Sourcing and Category Manager will focus on the following key areas:  \n\n* Developing sourcing strategies for several key construction professional services categories, such as Architect / Engineer, Commissioning Agents, Project Management, Cost Management, Environmental Consultants, etc.\n* Establishment of appropriate sourcing strategies alongside relevant internal stakeholders to drive long term goals of Continuity of Supply, Cost, Quality, Safety, Diversity \\& Inclusion and Sustainability.\n* Manage the sourcing, assessment, and onboarding of potential new suppliers.\n* Own the RFI / RFP process for the establishment of regional framework agreements to drive appropriate competition and reduce procurement timelines at the project execution stage.\n* Oversee supplier performance and compliance including the development of Key Performance Indicators (KPIs) and Service Level Agreements (SLAs) in collaboration with key stakeholders.\n* Conduct quarterly business reviews.\n* Develop and maintain category management and allocation plans for the planned portfolio of construction projects across the region.\n* Manage the drafting, negotiation, and execution of contracts.\n* Collate data and report to our Leadership Team on key performance metrics and category health.\n\n **Category Experience:*** Deep Construction Experience in Supply Chain and Contracts Management is an absolute requirement for this role.\n* Experience in key construction categories including Architect / Engineering consultancy, Infrastructure Equipment and construction services would be of benefit too.\n* Experience on large\\-scale mission critical construction projects is an absolute requirement \\- sourcing, managing, and administering contracts over USD $100M.\n* The ability to develop sourcing strategies for specific services and products including the knowledge of the development of requests for information (RFIs) and requests for proposals (RFPs) and the ability to incorporate necessary technical requirements into contracts.\n* Experience overseeing supplier performance and compliance including the development of Key Performance Indicators (KPIs) and Service Level Agreements (SLAs) in collaboration with key stakeholders and conducting quarterly business reviews with our supply chain.\n\n**Behavioral Attributes:*** Can create clarity, generate energy, and deliver success; always be planning for the future.\n* Have high integrity – must be ethical and strong value\\-based individual focused on fairness and maintaining confidentiality.\n* Bring high energy – a drive to achieve results in midst of ambiguity and a matrix organization.\n* Be a high performer – be able to fit the Microsoft “culture” by effectively multi\\-tasking and managing priorities; have a “sense of urgency” regarding issue resolution.\n* Understand the importance of relationships inside the company and with our supply chain partners.\n\n **Compliance*** Applies an end\\-to\\-end understanding of the tradeoffs between Microsoft and key suppliers to drive business impact by influencing senior managers cross\\-functionally, or cross\\-regionally to apply market intelligence and adopt practices that enable execution with consistency, accuracy, quality, and timeliness of delivery. Manages supplier scorecard process, leads strategic business reviews, educates stakeholders on policy compliance, analyzes root causes of issues, and influences change internally and/or externally to addresses issues.\n* Ensures adherence to policy, educates stakeholders and suppliers on policy compliance, and manages the remediation and resolution of sourcing issues. Identifies opportunities to adapt policy as needed to mitigate risk and better enable suppliers to meet business requirements.\n* Ensures consistency, timeliness, quality, and accuracy of deliverables, and ensures Procurement stakeholders are aware of Service Level Agreement (SLA) and/or defined milestones and deliverables terms. Communicates delay to Procurement stakeholders, and independently proposes and executes contingency measures.\n\n**Procurement and Contracts*** Processes or supports stakeholder procurement requests for complex purchasing categories via engagement and/or leveraging workflow process or technology, where applicable in support of product and service requirements. Manages the resolution of escalated pricing issues raised by other sourcing personnel.\n* Executes contracts and complies with established control processes to ensure delivery and execution on contracts in alignment with business requirements. Identifies risks and roadblocks to contract execution and drives action internally and/or externally to resolve and/or escalate, as appropriate. Monitors the impact of change orders to the underlying business case, and partners cross\\-functionally to adjust impact models.\n\n**Sourcing*** Integrates business specifications for complex purchasing areas into request for information (RFI) and/or request for proposal (RFP) processes. Collaborates cross\\-functionally to define and manage supplier scorecard criteria (e.g., key performance indicators \\[KPIs], Service Level Agreements \\[SLAs]), coordinates supplier performance reviews, and drives corrective actions. Actively partners with suppliers to identify and drive continuous improvement and risk management opportunities by evaluating procedural, operational, and/or environmental factors, analyzing root causes of issues, sharing insights with key stakeholders, and influencing the adoption of needed improvements.\n* Manages contract and price negotiation activities for a single purchasing category cross\\-functionally and ensures that both price and capacity needs are met while also reflecting Microsoft's cross functional engagements with suppliers. Identifies cost reduction opportunities and works closely with suppliers to drive cost competitiveness.\n* Defines, maintains, and executes on sourcing strategies for one or more complex projects and/or purchasing opportunities to ensure optimal cost and sufficient continuity of supply and/or service, collects relevant internal and industry data to understand business requirements, benchmarks data against relevant markets, and shares industry and category expertise across stakeholder teams to develop and execute sourcing strategies.\n\n**Stakeholder Collaboration*** Develops pricing and negotiation strategies for one or more complex purchasing categories, ensures that strategies clearly articulate the trade\\-offs, roles, and responsibilities across parties, and gains senior executive support for strategies both internally and externally. Identifies negotiation setbacks and takes action to mitigate contract disagreements.\n* Drives early business engagements for complex business areas or purchasing categories with cross\\-functional leadership including product design, quality, and business teams, to define and drive action on supply solutions and strategies, business requirements, optimal sourcing spend, and priorities. Shares expertise to advise cross\\-functional teams on sourcing decisions.\n* Collaborates with suppliers and leads on\\-boarding, processes. Serves as contact point between suppliers and multiple Microsoft accounts across one or more complex purchasing categories, developing and executing supplier account plans detailing priorities and focus for the supplier relationship for the upcoming period.\n\n **Culture*** Embody Microsoft’s Culture and Values.\n\n**Qualifications**\n------------------\n\n**Required Qualifications*** Master's Degree OR Bachelor's Degree in Quantity Surveying, Engineering, Supply Chain, AND experience in Commercial / Contractual Construction Role, Project Management, Supply Chain.\n* Experience working in a cross functional team environment on dynamic large scale capital programs\n* Extensive experience with direct procurement in the construction industry\n\n**Preferred Qualifications*** Strong commercial understanding and experience of driving and developing key contractual components of categories (Architect / Engineer, Commissioning, Project Management, Cost Management and other construction services suppliers).\n* Knowledge of construction projects and teams is a must. Datacenter industry preferable and / or mission critical experience managing a variety of project delivery methods – ability to collaborate with a project team in defining risk and developing the appropriate contracting and compensation approaches.\n* Ability to work independently and within a matrixed environment; a self\\-starter and quick learner of Microsoft systems and processes.\n* Take ownership and accountability for scope and closing out deliverables in required timelines.\n* Technical ability to review contracts, ability to set up sourcing plans and negotiation strategies to execute them.\n* High integrity – must be ethical and strong value based individual focused on fairness and maintaining confidentiality.\n* Strong verbal and written communication skills for executive communication; ability to articulate points of view with executive management and stakeholders.\n* Ability to implement new processes and get buy in from a cross functional team.\n* Be a high performer – be able to fit the Microsoft “culture” by effectively multi\\-tasking and managing priorities; have a “sense of urgency” regarding issue resolution.\n* Understand the importance of relationships inside the company and with our supply chain partners.\n\n  \n\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 146682.0,
        "max_amount": 185733.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-09",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-56de1ae2ca4c0db5",
      "title": "[US Federal] Customer Success Account Management: Full-Time Opportunity - Arlington, VA",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=56de1ae2ca4c0db5",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1792262/-US-Federal-Customer-Success-Account-Management-Full-Time-Opportunity-Arlington-VA?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Arlington",
        "state": "VA"
      },
      "description": "Come build community, explore your passions and do your best work at Microsoft. This opportunity will allow you to bring your aspirations, talent, potential \\- and excitement for the journey ahead.  \n\nAs a Customer Success Account Manager, you will develop, maintain, and build upon foundational relationships with key customer stakeholders and technical professionals to enable quality solution delivery. This opportunity will allow you to guide and lead conversations to facilitate the achievement of customer business objectives; lead the execution of program planning and customer\\-facing program reviews.  \n\n  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.**Responsibilities**\n--------------------\n\n* Learn customer, partner and internal stakeholder engagement models and support foundational relationships with key customer stakeholders and technical professionals to enable quality solution delivery and health using partnerships with other account team leaders and with guidance from more experienced colleagues.\n* Learn how to identify, navigate and communicate with key customer technical stakeholders at different levels and learn how to guide and lead conversations to facilitate the achievement of customer business objectives by leveraging their investment in Microsoft.\n* Grow your technical aptitude and industry awareness to translate customer interactions into customer business impact and value.\n* Understand the organizational and customer success strategy as well as Microsoft technology and services and align with the account team to link Customer Success Plans (CPSs) with account plan priorities and develop bookable programs of work.\n* Support the identification and mitigation of customer blockers by leveraging Microsoft solutions and services and the development of deliverable programs of work with guidance from more experienced colleagues.\n\n**Qualifications**\n------------------\n\n**Required Qualifications*** Currently pursuing or have completed a Bachelor's Degree in Business, Sociology, Psychology, Computer Science, or related field.\n* 1\\+ year(s) work or internship experience in customer success, solution delivery, practice management, customer\\-facing consulting, or portfolio management\n\t+ OR equivalent experience.\n\n**Preferred Qualifications*** Microsoft or competitor equivalent (e.g., AWS) certification in relevant technologies (e.g., Azure, 365\\).\n* Information Technology Infrastructure Library (ITIL) Foundation certification or equivalent service management certification.\n\n**Other Requirements:*** Citizenship \\& Citizenship Verification: This position requires verification of U.S citizenship due to citizenship\\-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customers and is subject to certain citizenship\\-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport.\n* This role will require access to information that is controlled for export under U.S. export control regulations, potentially under the International Traffic in Arms Regulations or the Export Administration Regulations. As a condition of employment, the successful candidate will be required to provide proof of citizenship, for assessment of eligibility to access the export\\-controlled information. To meet this legal requirement, citizenship will be verified via a valid passport.\n* Cloud Screening: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\n  \n\nCustomer Success Account Mgmt IC2 \\- The typical base pay range for this role across the U.S. is USD $66,900 \\- $135,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $89,600 \\- $148,200 per year.  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay  \n\nMicrosoft will accept applications for the role until January 24th, 2025\\.  \n\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 66900.0,
        "max_amount": 148200.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-09",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-0210fad7d7deb6e8",
      "title": "Senior Cloud Solution Architect - Azure Core",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=0210fad7d7deb6e8",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1770090/Senior-Cloud-Solution-Architect-Azure-Core?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": null,
        "state": null
      },
      "description": "We are seeking passionate individuals to join our Customer Success teams across various business groups, working with a diverse range of customers within our enterprise, regulated, and partner services organizations.  \n\nAs a **Senior Cloud Solution Architect \\- Azure Core**, you will work closely with Microsoft’s strategic partners to help them achieve their business goals by fully leveraging their Microsoft technology investments. With your deep technical expertise, you will lead critical technical discussions, ensuring partners unlock the full potential of Microsoft solutions while resolving any challenges that could impede customer success. This role presents an excellent opportunity to grow your career, enhance your technical and collaboration skills, and expand your cloud expertise.  \n\nAzure is the most comprehensive, innovative, and flexible cloud platform available today, and Microsoft is looking for talented professionals to drive cloud adoption among the world’s most important companies. We are driven by curiosity and a commitment to continuous learning. We embrace uncertainty, take bold risks, and learn quickly from our experiences. Collaboration is at the heart of what we do—we build on each other’s ideas because we are stronger together. We are inspired by what people can achieve and are motivated every day to empower others to accomplish more through our technology and innovation. Together, we make a lasting impact.  \n\nMicrosoft’s mission is to empower every individual and organization on the planet to achieve more. As employees, we embrace a growth mindset, innovate to empower others, and collaborate to achieve our collective goals. Every day, we uphold our core values of respect, integrity, and accountability, fostering a culture of inclusion where everyone can thrive both at work and in life.**Responsibilities**\n--------------------\n\n#### **Customer Centricity:**\n\n* Gathers customer/partner insights (e.g., feedback around technical preferences, environments, business needs) and leverages these insights and existing plans to map solutions with customer/partner business outcomes. Acts as the voice of the customer (VOC)/partner by driving awareness of existing feedback, insights, and resources with internal teams to add and prioritize. Shares customer success stories with the wider internal team.\n* Identifies and begins developing impactful relationships with internal teams and customer and partner technical specialists during initial preparation and ramp\\-up stages. Proposes viable solutions based on specific technical products. Demonstrates complex concepts, and proves the capability of those solutions through design collaboration sessions with the customer/partner. Understands how work aligns with customer success plan and meets customer/partner needs by working with internal teams to deliver customer outcomes. Supports customer skilling by delivering as a trusted technical advisor to ensure customer readiness by facilitating technical discussions and enabling operational health and cloud readiness. Transfers knowledge to customers close customer skill gaps.\n* Contributes to customer satisfaction by providing a positive customer/partner experience. Demonstrates an understanding of customer/partner conditions of success. Identifies dissatisfied customers and builds remedial actions (e.g., post\\-mortem reviews).\n* Actively listens and respectfully challenges customers/partners when going in the wrong direction and escalates appropriately.\n\n#### **Business Impact:**\n\n* Independently identifies issues and advises customers/partners to operate and optimize performance in accordance with Microsoft best practices. Escalates issues to senior team members or manager, as needed. Applies methodology and governance to minimize business and technical risks and adhere to quality assurance while ensuring excellence in contributions to design and/or delivery of solutions. Adheres to quality assurance standards and calculates risks while ensuring excellence in the design and/or delivery of solutions. Leverages standard tools to ensure accurate opportunity and milestone execution and pipeline hygiene.\n* Independently works with the customer to identify, determine root causes, and resolve blockers to accelerate consumption and solution implementation (e.g., by application of technical capabilities). Identifies non\\-technical issues and escalates for removal by the appropriate party. Applies business and technical knowledge of architecture or other Microsoft solutions to meet business and information technology (IT) requirements and resolve identified technical constraints. Helps to shape and enhance customers' requirements.\n* Leverages knowledge of the products, services, and value propositions of Microsoft and its competitors in customer/partner conversations to assess customer/partner needs and independently identify growth opportunities. Leverages an existing architecture approach or reference architecture to propose a solution or achieve Microsoft's Customer Promise. Identifies opportunities to expand or accelerate consumption (e.g., cloud and support). Participates in discussions about architecture design, resiliency reviews, and technical optimization that result in production deployment application and increase customer/partner usage and consumption. Independently consults on technical solution design, development, and deployment and supports the customer/partner throughout implementation to achieve value outcomes and Microsoft's Customer Promise.\n* Understands the competitor's architecture solutions and identifies Microsoft's strengths over competitive solutions to demonstrate Microsoft's value to customers/partners.\n\n#### **Technical Leadership:**\n\n* Leverages development opportunities (e.g., mentorships, role\\-based resources, trainings, internal events such as Ready, Build, Ignite) to learn new technologies and services as advised by leadership team/manager.\n* Shares ideas, insights, and technical input with virtual team members using a working knowledge of specific Microsoft architectures and other relevant products. Participates in external technical community events (e.g., conferences, seminars, technical meetups, Webcasts, blogs, hackathons) and shares learnings with the internal team.\n* Supports research projects and contributes to scoping surveys for customers/partners to assess potential intellectual property (IP) needs or process changes. Supports identification of opportunities for IP reuse and consumption acceleration. Contributes to IP creation and updates by identifying gaps through delivery and communicating those gaps to others (e.g., Leadership, managed intellectual property \\[MIP], Design, and Governance).\n\n#### **Other:**\n\n* Embody our culture and values\n\n**Qualifications**\n------------------\n\n**Required/Minimum Qualifications:*** Bachelor's Degree in Computer Science, Information Technology, Engineering, Business, or related field AND 4\\+ years experience in cloud/infrastructure technologies, information technology (IT) consulting/support, systems administration, network operations, software development/support, technology solutions, practice development, architecture, and/or consulting\n\t+ OR equivalent experience\n\n#### **Other Requirements:**\n\n* Microsoft is unable to sponsor a work visa for this role due to the nature of the role’s job duties.\n\n#### **Additional or Preferred Qualifications:**\n\n* Bachelor's Degree in Computer Science, Information Technology, Engineering, Business, or related field AND 12\\+ years experience in cloud/infrastructure technologies, information technology (IT) consulting/support, systems administration, network operations, software development/support, technology solutions, practice development, architecture, and/or consulting\n\t+ OR Master's Degree in Computer Science, Information Technology, Engineering, Business, or related field AND 8\\+ years experience in cloud/infrastructure technologies, technology solutions, practice development, architecture, and/or consulting\n\t+ OR equivalent experience.\n* 6\\+ years experience working in a customer\\-facing role (e.g., internal and/or external).\n* 6\\+ years experience leading technical projects.\n* Technical Certification in Cloud (e.g., Azure, Amazon Web Services, Google, certifications).\n\n**Cloud Solution Architecture IC4** \\- The typical base pay range for this role across the U.S. is USD $103,800 \\- $200,300 per year.\n\nThere is a different range applicable to specific work locations, within the San Francisco Bay Area and New York City metropolitan area, and the base pay range for this role in those locations is USD $133,700 \\- $219,200 per year.\n**Cloud Solution Architecture IC5** \\- The typical base pay range for this role across the U.S. is USD $129,200 \\- $248,800 per year.\n\nThere is a different range applicable to specific work locations, within the San Francisco Bay Area and New York City metropolitan area, and the base pay range for this role in those locations is USD $162,000 \\- $268,900 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: US corporate pay information \\| Microsoft Careers\n\nMicrosoft will accept applications and processes offers for these roles on an ongoing basis.  \n\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 103800.0,
        "max_amount": 268900.0,
        "currency": "USD"
      },
      "date_posted": "2024-09-16",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-842413c309a75265",
      "title": "Senior Software Security Engineer",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=842413c309a75265",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1786665/Senior-Software-Security-Engineer?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Redmond",
        "state": "WA"
      },
      "description": "Security represents the most critical priorities for our customers in a world awash in digital threats, regulatory scrutiny, and estate complexity. Microsoft Security aspires to make the world a safer place for all. We want to reshape security and empower every user, customer, and developer with a security cloud that protects them with end to end, simplified solutions. The Microsoft Security organization accelerates Microsoft’s mission and bold ambitions to ensure that our company and industry is securing digital technology platforms, devices, and clouds in our customers’ heterogeneous environments, as well as ensuring the security of our own internal estate. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life\\-changing innovations that impact billions of lives around the world. The Azure Security DevSec team is looking for a Senior Security Engineer to join us in securing services in the Microsoft Cloud. We work with service teams across Microsoft to evaluate and improve their security posture in the cloud, continuously moving the needle across multiple dimensions of their design, development and deployment security. In this role, you will collaborate with teams across Microsoft to dive deep and evaluate the risk posed by and to a given service, recommend existing mitigations, innovate on mitigations for new issue classes, contributing to the feedback loop that can help achieve these outcomes at scale.\n  \n\n  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n  \n\n  \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.**Responsibilities**\n--------------------\n\n* Perform exhaustive vulnerability analysis on cloud\\-hosted services in Microsoft Azure\n* Identify opportunities, and implement solutions, to improve the security posture of services across Microsoft Azure\n* Bring a growth mindset to tackle new and challenging problems everyday, in an inclusive team environment\n* Innovate new approaches to solving security at cloud scale\n* Other  \n\n\t+ Embody our culture and values\n\n**Qualifications**\n------------------\n\n**Required/Minimum Qualifications:*** 5\\+ years experience in software development lifecycle, large scale computing, modeling, cybersecurity, anomaly detection\n\t+ OR bachelor's degree in computer science, Cybersecurity, or related field\n\t+ OR equivalent experience.\n* 5\\+ years experience performing security assessments and penetration testing\n* 3\\+ years experience securing cloud computing environments\n* 3\\+ years experience with one or more of C\\#, Python, Rust, or JavaScript, PowerShell\n\n**Other Requirements*** Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\n\t+ This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter\n\n  \n\nSecurity Assurance IC4 \\- The typical base pay range for this role across the U.S. is USD $117,200 \\- $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 \\- $250,200 per year.  \n\n  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay1  \n\nMicrosoft will accept applications for the role until December 4, 2024\\.  \n\n\\#AzureSecurity \\#DevSecJobs \\#AzureDevSec **\\#DSR \\#MSFTSecurity \\#AfroTech2024**  \n\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 117200.0,
        "max_amount": 250200.0,
        "currency": "USD"
      },
      "date_posted": "2024-11-20",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-9de9ba3f216e542b",
      "title": "Finance Manager – Cloud Infrastructure Accounting & Enablement",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=9de9ba3f216e542b",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1799738/Finance-Manager-Cloud-Infrastructure-Accounting-Enablement?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Redmond",
        "state": "WA"
      },
      "description": "Empower every person and organization on the planet to achieve more. That’s what inspires us, drives our work and pushes us to challenge the status quo every day. Through our Cloud\\-first strategy, we strive to deliver solutions that are optimized for the world and enable customers to drive their business more successfully. The Margin Strategy and Investment Optimization (MSIO) finance team is an exciting and fast\\-evolving finance team at the forefront of Microsoft’s Cloud\\-first strategy. We are looking for a Finance Manager – Cloud Infrastructure Accounting \\& Enablement to help shape the future of our cloud infrastructure accounting systems and processes and continue to build the MSIO team.  \n\nThe team’s charter is to partner with a broad group of stakeholders to build out the end\\-to end Microsoft Cloud Infrastructure, while optimizing investments and enabling accounting solutions that are scalable and mitigate risk. As a key member of the team, The Finance Manager – Cloud Infrastructure Accounting \\& Enablement will be responsible for executing the accounting system and process solutions for new initiatives focused on the next generation of Microsoft’s Cloud infrastructure. The Finance Manager – Cloud Infrastructure Accounting \\& Enablement will be involved with implementing a global, best\\-in\\-class supply chain for Cloud spares, influencing the design of systems \\& processes and providing key insight to business partners. Additionally, the role assists with executing monthly financial close processes related to warranty and maintenance contracts.  \n\n  \n\nThe Finance Manager – Cloud Infrastructure Accounting \\& Enablement will collaborate with Microsoft partners globally, including Finance, Tax, Treasury, Trade, Sourcing and Business Operations.**Responsibilities**\n--------------------\n\n* Assist with design, user acceptance testing and documentation business requirements documents, responsibility matrices, Business Flows, etc. of new global supply chain for Cloud spares.\n* Assist with preparation ofstandard operating procedures and onboarding of Finance Operations across different global regions.\n* Work independently and in partnerships with Finance and Sourcing to ensure timely and accurate fiscal close cycles.\n* Ensure compliance with GAAP/IFRS, SOX and MS Policy; enable controls to safeguard assets and accurate financial reporting.\n* Assist team in fulfilling auditor requests by collecting and preparing documentation.\n* Embrace inclusion, a growth mindset, and enable culture and norms that support consistent quality partner experiences.\n\n**Qualifications**\n------------------\n\n\nRequired/Minimum Qualifications* Master's Degree in Business Administration, Accounting, Finance, Economics, Data Science or related field\n\t+ OR Bachelor's Degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 2\\+ years experience in financial analysis, accounting, controllership, finance, or related field\n\t+ OR equivalent experience.\n\n  \n\nAdditional or Preferred Qualifications* Previous accounting experience in Accounts Payable, Accounts Receivables, Intercompany Accounting, Supply Chain (preferred)\n* Bachelor’s degree in Accounting or Finance preferred\n* Proficient analytical, collaboration, and time management skills\n* Ability to communicate effectively (written and verbal) with all levels of management.\n* Preliminary understanding of GAAP, Internal Controls, and SOX.\n* Demonstrated experience with large ERP systems (SAP preferred) and process improvement experience.\n* Collaborative and comfortable dealing with ambiguity, influencing across multiple complex organizations, creating effective internal business partnerships.\n* Ability to effectively manage multiple projects, have excellent attention to detail, and work effectively under deadlines.\n\n\nFinancial Analysis IC3 \\- The typical base pay range for this role across the U.S. is USD $75,100 \\- $148,900 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $98,800 \\- $163,300 per year.  \n\n  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay\n  \n\n  \n\nMicrosoft will accept applications for the role until January 18, 2025\\.  \n\n  \n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 75100.0,
        "max_amount": 163300.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-08",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-ec952570418a602d",
      "title": "Legal Counsel Juris Doctorate Internship Opportunities - Neurodiversity Hiring Program",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=ec952570418a602d",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1787975/Legal-Counsel-Juris-Doctorate-Internship-Opportunities-Neurodiversity-Hiring-Program?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Redmond",
        "state": "WA"
      },
      "description": "Come build community, explore your passions and do your best work at Microsoft with thousands of University interns from every corner of the world. This opportunity will allow you to bring your aspirations, talent, potential—and excitement for the journey ahead.  \n\nThe goal of the Neurodiversity Hiring Program is to build an inclusive hiring approach that recognizes and embraces the strengths of Neurodiverse candidates. Neurodiversity encompasses a wide range of cognitive differences, such as ADHD, autism, dyslexia, dyspraxia \\& dyscalculia.  \n\nA Legal Counsel Intern manages legal business matters and provides corporate and commercial legal services to in\\-house clients, counsels business partners and executives on a broad range of issues, which may include legal, business, public relations, government affairs, corporate image, Customer Partner Experience, regulatory compliance, or cross\\-Microsoft related matters. Reviews legal data and advises the organization on appropriate legal action. Identifies legal risks and develops solutions and mitigation strategies.  \n\nAt Microsoft, Interns work on real\\-world projects in collaboration with teams across the world, while having fun along the way. You’ll be empowered to build community, explore your passions, and achieve your goals. This is your chance to bring your solutions and ideas to life while working on cutting\\-edge technology.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. Learn more about our cultural attributes.**Responsibilities**\n--------------------\n\n* Acts as the primary legal contact (generalist or subject matter expert) for assigned clients; executes routine to moderate\\-impact legal matters; provides support (e.g., revises templates, answers client questions about legal process) to higher\\-level attorneys.\n* Serves as a contributor to clients and colleagues about legal and related business matters (e.g., privacy, intellectual property, regulatory compliance).\n* Provides input and continuous feedback to improve process efficiencies within role; identifies opportunities and tools to increase operational efficiency and effectiveness.\n\n**Qualifications**\n------------------\n\n**Required Qualifications:*** Currently pursuing a Juris Doctorate Degree OR Legal Apprenticeship\n* Must have at least one quarter/semester of school remaining following the completion of the internship.\n* Eligible for the Neurodiversity Hiring Program.\n\n  \n\nThe base pay range for this internship is USD $6,920 \\- $13,350 per month. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $8,910 \\- $14,610 per month.  \n\n  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-intern\\-pay  \n\nMicrosoft accepts applications and processes offers for these roles on an ongoing basis throughout the academic calendar (September \\- April)  \n\n\\#CELA\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "internship"
      ],
      "compensation": {
        "interval": "monthly",
        "min_amount": 6920.0,
        "max_amount": 14610.0,
        "currency": "USD"
      },
      "date_posted": "2024-11-22",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-923ab7f13a0663cb",
      "title": "Senior Technical Program Manager - Azure Storage",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=923ab7f13a0663cb",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1790531/Senior-Technical-Program-Manager-Azure-Storage?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": null,
        "state": null
      },
      "description": "Do you want to be a key contributor to the core infrastructure powering the AI era? Are you passionate about data storage, large\\-scale distributed systems, and pushing the boundaries of cutting\\-edge technology at an immense scale?\n\n\nThe Azure Storage team delivers a range of storage solutions—including Azure Blob Storage for object storage, Azure Files for shared storage, and Azure Disks for block storage—that empower developers to create scalable, durable, and highly available cloud\\-native and AI applications. These capabilities support workloads in containers, VMs, and more, forming the backbone of Microsoft's services like CoPilot, Office, Windows, Xbox, and countless others. In this role, you'll be part of a strategic team with influence across Microsoft and the tech industry.\n\n\nWe are seeking a Senior Technical Program Manager \\- Azure Storage to lead critical initiatives that support the delivery of supercomputer capacity and capabilities. You will be responsible for coordinating efforts across various teams within Microsoft, including storage engineering, datacenter, supply chain, and build\\-out teams. You will ensure that new supercomputer projects come online smoothly, and you will drive end\\-to\\-end tracking, reporting, and coordination efforts.\n\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. Our employees embrace a growth mindset, collaborate to achieve shared goals, and innovate to empower others. We build on our values of respect, integrity, and accountability to foster a culture of inclusion where everyone can thrive.\n\n**Responsibilities**\n--------------------\n\n* Coordinate requirements across Microsoft including engineering, datacenter, supply chain, and build\\-out teams, to bring new supercomputer capacity online.\n* Lead daily team scrums ensuring effective tracking and reporting across workstreams.\n* Understand the scenarios, workloads, and deep technical storage requirements of our largest and most complex customers. Facilitate the feedback loop between customers and engineering.\n* Partner with engineering teams on design, planning, and delivery.\n* Engage directly with our largest and most complex customers as a subject matter expert on Azure Blob Storage.\n\n**Qualifications**\n------------------\n\n**Required Qualifications:*** Bachelor's Degree AND 4\\+ years experience in engineering, product/technical program management, data analysis, or product development\n\t+ OR equivalent experience.\n* 2\\+ years of experience managing cross\\-functional and/or cross\\-team projects.\n* 3\\+ years of experience in a technical role where you were responsible for managing or supporting the underlying systems of a product, service, or infrastructure.\n\n\n**Other Requirements:*** + Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. **Additional/Preferred Qualifications:**\n* Strong analytical skills, with an ability to break down complex problems and drive structured solutions.\n* Excellent relationship\\-building skills and a proven track record of effective cross\\-team collaboration.\n* Strong sense of ownership, detail orientation, and follow\\-up skills.\n* Experience with one or more of the following:\n* + High\\-performance network\\-attached filers and filesystems.\n\t+ On\\-premises SAN and NAS solutions.\n\t+ Object storage services and platforms.\n\t+ Long\\-term retention and archiving solutions, including tape.\n\t+ Large\\-scale data migration solutions.\n\t+ Storage protocols, clients, tools, APIs, libraries, SDKs.\n\t+ AI/ML workload patterns including training, fine\\-tuning, and retrieval\\-augmented generation (RAG).\n\n  \n\nTechnical Program Management IC4 \\- The typical base pay range for this role across the U.S. is USD $117,200 \\- $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 \\- $250,200 per year.  \n\n  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay\n  \n\n  \n\nMicrosoft will accept applications for the role until January 11, 2025  \n\n\\#Azurecorejobs\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 117200.0,
        "max_amount": 250200.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-12",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-898348c9d9dca774",
      "title": "Modern Work Digital Specialist Manager",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=898348c9d9dca774",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1797629/Modern-Work-Digital-Specialist-Manager?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Atlanta",
        "state": "GA"
      },
      "description": "Digital Enterprise Sales (DES), as part of Microsoft’s Global Enterprise Sales organization, empowers our customers through the unique value of the Microsoft Cloud by building a globally led, digital\\-first scale organization aligned with partners. As part of our local subsidiaries or Digital Sales centers around the world, you will engage a dedicated set of enterprise customers to identify and achieve their business objectives through best\\-in\\-class digital engagement and partner co\\-selling. You will also have an opportunity to work collaboratively across teams while living our Global Enterprise Sales and Culture priorities: Diversity and Inclusivity, Wellbeing, Sustainability, and Customer Obsession. If you are interested in driving digital first solutions and delivering customer satisfaction, we invite you to learn more about Digital Enterprise Sales team and the value we bring to our customers, partners, and one another, every day.\n\n\nAs part of our transformation, one of our key areas of focus is the modernization of our sales motions. The Global Enterprise Sales organization with a charter to achieve Microsoft and Customer business outcomes with a focus on AI, Copilot and Security.\n\n\nWe are looking for a **Modern Work Digital Specialist Manager** to lead a team of talented and skilled Digital Specialists to drive the day\\-to\\-day execution of Microsoft's strategic business priorities. You will lead a team to drive business growth across Modern Work solutions, leveraging generative AI narratives, to sell the best\\-in\\-class cloud services and platforms to our enterprise customers, building the momentum for digital transformation for our customers, partners, and Microsoft. In this role, you will be a sales coach and leader and have an understanding of sales leadership practices, and contribute with vision and execution of solution sales.\n\n\nThis role is flexible in that you can work up to 50% from home. In this role, you may be located in one of the following locations: Atlanta, GA, Austin, TX, Charlotte, NC, Dallas, TX, Fargo, ND, Phoenix, AZ, Raleigh, NC, or Seattle, WA. Relocation assistance is not available for this role.\n\n  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\n**Responsibilities**\n--------------------\n\n* **Model, Coach, Care:** Deliver success through empowerment and accountability by modeling, coaching, and caring. Effectively lead your team through change, keeping them motivated and focused as customer needs and market conditions evolve in a digitally enabled environment\n* **Customer Engagement:** You will identify trends, assess risk, and create performance plans in weekly deals and pipeline reviews with leadership. You will ensure that team meets and exceeds monthly, quarterly, and annual team targets by generating sales pipeline; and for your sellers who have responsibilities to manage pipeline end\\-to\\-end, ensure they accelerate and drive active opportunities to close.\n* **Stakeholder Engagement:** Coach your team to collaborate and leverage internal and external stakeholders to develop customer and partner relationships that build, expand and effectively progress opportunities and pipeline through the sales cycle within assigned territory. Facilitate and lead internal communication with the account team and leadership to get support for your team and eliminate barriers to success.\n* **Sales Excellence:** You will provide reports in a timely manner on sales targets \\& key metrics and contribute to correction\\-of\\-error plans as needed. You will play a pivotal role, lead\\-by\\-example, in driving adoption of new tools and processes, and data/operation rigor to provide accurate on\\-time reporting of business insights to reach strategic goals. You will coach your team on executing digital sales excellence through use of tools such as Sales Accelerator, LinkedIn Sales Navigator to better identify, connect, and engage with customers and key decision makers and promote professional brand.\n* **Technical Skilling and Development:** You will mentor the sales team to drive sales conversations through call coaching of their customer sales calls, co\\-selling with partners, and demo execution.\n\n**Qualifications**\n------------------\n\n**Required/Minimum Qualifications**\n\n* 9\\+ years of technology\\-related sales or account management experience\n\t+ OR Bachelor's Degree in Computer Science, Information Technology, Business Administration, or related field AND 7\\+ years of technology\\-related sales or account management experience.\n\n  \n\nDigital Solution Area Specialists M5 \\- The typical base pay range for this role across the U.S. is USD $129,300 \\- $217,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $167,800 \\- $237,400 per year.\n\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay\n\n\nMicrosoft will accept applications for the role until January 17, 2025\\.\n\n  \n\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 129300.0,
        "max_amount": 237400.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-10",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-eb473668b8a7ee44",
      "title": "Senior Technical Program Manager - CTJ - TS/SCI",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=eb473668b8a7ee44",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1789415/Senior-Technical-Program-Manager-CTJ-TS-SCI?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Redmond",
        "state": "WA"
      },
      "description": "Microsoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud\\-enabled world.  \n\n  \n\nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging \\& real\\-time analytics, and business intelligence. The products our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data\\-first applications and driving a data culture.  \n\nWithin Azure Data, the databases team builds and maintains Microsoft's operational Database systems. We store and manage data in a structured way to enable multitude of applications across various industries. We are on a journey to enable developer friendly, mission\\-critical, AI enabled operational Databases across relational, non\\-relational and OSS offerings.  \n\nWe are the Security and Compliances (S\\&C) team within the Azure Databases pillar in the Azure Data organization and our mission is to offer the most secure database services on the planet – from on\\-premises data centers to the cloud. We focus on:\n* Ensuring our customers have consistent security feature experience across Azure environments while developing and shipping industry\\-leading, differentiated security capabilities such as Always Encrypted or SQL Ledger;\n* leading and enforcing standards across the three Secure Future Initiative principles;\n* clarifying and ensuring that regulatory compliance, data privacy and secure development practices are prioritized and balanced to ensure the data our customers entrust to our services is safe and managed in a compliant manner, meeting even the most stringent federal customer requirements.\n\n\nThe Azure Databases pillar is part of the Azure Data organization and oversees all the operational data management services including Azure SQL Database, CosmosDB, as well as the services based on open\\-source relational database engines such as PostgreSQL and MySQL. Our services are a top choice for governments, enterprises, ISVs, and application developers looking to disrupt markets and transform their existing business.  \n\nThe Azure Databases pillar along with all of Azure is expanding our footprint in the Government space with our mission\\-critical cloud, delivering breakthrough innovation and security to government customers and their partners. With world\\-class security, protection, and compliance, agencies can accelerate cloud adoption with confidence, in a consistent hybrid environment designed for flexibility and scale. Azure Government enables innovation with deeply integrated cloud services, advanced analytics, and an open application platform, that provides the building blocks to rapidly develop, deploy and manage intelligent solutions. Government customers can leverage the vast network of Microsoft’s technology partners and diverse marketplace offerings, to advance their mission and serve their citizens.  \n\nWe do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served.  \n\nThe S\\&C team is looking for a **Senior Technical Program Manager** with a proven track record in managing multiple security frameworks and regulatory compliance processes and resulting certifications end\\-to\\-end. This role will be critical in ensuring our operational database cloud services meet the stringent security requirements set by the Federal Risk and Authorization Management Program (FedRAMP). The ideal candidate will have knowledge of implementing cloud computing, online services, enterprise software development, engineering and/or operations at scale. You will collaborate to ensure our portfolio of operational data stores are delivered with consistency and in a compliant manner across all clouds. You will use your experience and skills to identify and resolve complex opportunities and gaps in the implementation of compliance features and processes across offerings. Partner with software engineering, legal, Azure compliance, Azure security and other divisions to design scalable, secure, and compliant solutions that meet even the most stringent requirements of both public and private sectors. You will develop and manage governance programs and processes to ensure that specific compliance requirements and standards are met throughout the development lifecycle. You will define success criteria and performance metrics and lead teams to partner with others to collect performance metrics.  \n\nSecurity, compliances, and data privacy are top concerns for our customers and the S\\&C team plays a pivotal role in drawing new businesses to our platform by being “built on trust”.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.**Responsibilities**\n--------------------\n\n* **Analysis of Customer and Market Signals –**\n\t+ Collaborate across product offering teams, sales, compliance teams, and legal to understand and specify compliance experiences across multiple groups or divisions.\n\t+ Establish clarity of patterns of root problems and how it relates with previously seen trends across customers; determine the customers/sectors (internal and external) impacted and provides research evidence to recommend priorities.\n\t+ Ensures alignment between the customer (internal and external), compliance, internal stakeholders, and the goals of and strategy of Microsoft.\n* **Product/Service Definition –**\n\t+ Partner with engineering, compliance and legal teams to design architecture and integrate customer solutions that address priority customers and regulatory compliance needs.\n\t+ Engages in active risk management (proactive and reactive) to identify risks and propose mitigations for risks using data (e.g., telemetry, usage, net satisfaction, customer satisfaction).\n* **Product/Service Development –**\n\t+ Collaborates and coordinates across organizations to ensure alignment on product management and release, including tradeoffs, adjustments, and improvements as feasible.\n\t+ Manages governance programs and processes to ensure that specific performance requirements and standards are met throughout the development lifecycle (e.g., quality, compliance, privacy, security, safety, accessibility).\n* **Product/Service Performance –**\n\t+ Leverages customer listening systems, telemetry, engagements, etc., to develop insights into service performance, customer needs, and/or compliance adherence.\n\t+ Forms hypotheses to complex technical needs, performs experiments, and iterates to drive improvement in specific performance metrics.\n\n\nEmbody our culture and values**Qualifications**\n------------------\n\n**Required/Minimum Qualifications:*** Bachelor's Degree AND 4\\+ years’ experience in engineering, product/technical program management, data analysis, or product development\n\t+ or equivalent experience.\n* 2\\+ years’ experience managing cross\\-functional and/or cross\\-team projects\n* Professional experience in software development compliance, information protection, data security/privacy, or data governance.\n* Demonstrated knowledge of security frameworks such as NIST (National Institute of Standards and Technology) Cybersecurity Framework (including v 2\\.0\\), ISO (International Organization for Standardization) 27001/27002, SOC (Service Organization Control) 2, CMM (Capability Maturity Model) and FedRAMP (Federal Risk and Authorization Management Program)\n* Direct experience with software engineering requirements to pass the FedRAMP (Federal Risk and Authorization Management Program) Authorization Process.\n\n**Other Requirements**\nSecurity Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:* Candidates must have an **active** TS/SCI and be willing to upgrade to TS/SCI (with polygraph). This role will require candidates to maintain the TS/SCI (with polygraph) clearance. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate clearance and/or customer screening requirements may result in employment action up to and including termination.\n* **Clearance Verification**: This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment.\n* **Microsoft Cloud Background Check:** This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n* **Citizenship \\& Citizenship Verification:** This position requires verification of U.S. citizenship due to citizenship\\-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship\\-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance\n\n**Preferred/Additional Qualifications*** 1\\+ years data analysis and data analytics experience.\n* 1\\+ years of programming experience, for example, in TSQL, Powershell, RUST, Java, C\\+\\+, Python.\n* Relevant certifications such as CISSP (Certified Information Systems Security Professional) or CCSP (Certified Cloud Security Professional) are highly desirable.\n* Demonstrated leadership experience across various business functions in a highly matrixed organization structure.\n* Proven ability to engage with various business functions from engineering to executive levels.\n* Experience in cloud service engineering lifecycle and live site operation at cloud scale.\n* Demonstrated stakeholder management including identification, managing expectations, prioritizing concerns and planning.\n* Knowledge of risk management, the process of measuring, or assessing risk and then developing strategies to manage risk.\n\n\nTechnical Program Management IC4 \\- The typical base pay range for this role across the U.S. is USD $117,200 \\- $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 \\- $250,200 per year.  \n\n  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-corporate\\-pay\n  \n\n  \n\nMicrosoft will accept applications for the role until January 11, 2025\\.  \n\n\\#azdat \\#azuredata \\#azuredatabasesecurity \\#azuredatabasecompliance\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 117200.0,
        "max_amount": 250200.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-04",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-4c9da4733b33686e",
      "title": "Research Intern - Applied Science in Viva Insights",
      "company_name": "Microsoft",
      "job_url": "https://www.indeed.com/viewjob?jk=4c9da4733b33686e",
      "job_url_direct": "https://careers.microsoft.com/us/en/job/1799951/Research-Intern-Applied-Science-in-Viva-Insights?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
      "location": {
        "country": "US",
        "city": "Redmond",
        "state": "WA"
      },
      "description": "Research Internships at Microsoft provide a dynamic environment for research careers with a network of world\\-class research labs led by globally\\-recognized scientists and engineers, who pursue innovation in a range of scientific and technical disciplines to help solve complex challenges in diverse fields, including computing, healthcare, economics, and the environment.  \n\nViva Insights aims to create cultures where people and businesses thrive by improving how people and organizations work with data and science. The product enables organizations to use actionable workplace insights to increase productivity and engagement and helps them through their AI transformation journey. We are here to help employees feel better and be better at work, and organizations achieve important business outcomes. Learn more about Viva Insights here.  \n\nThe Viva Insights Applied and Data Science is a team of Data \\& Applied Scientists that work together to leverage advanced analytics, ML/AI techniques, and behavioral research to find new ways to measure human behavior, drive impactful improvements to the Viva Insights product, and conduct research to discover new interventions to help our customers thrive at work in the age of AI.**Responsibilities**\n--------------------\n\n\nResearch Interns put inquiry and theory into practice. Alongside fellow doctoral candidates and some of the world’s best researchers, Research Interns learn, collaborate, and network for life. Research Interns not only advance their own careers, but they also contribute to exciting research and development strides. During the 12\\-week internship, Research Interns are paired with mentors and expected to collaborate with other Research Interns and researchers, present findings, and contribute to the vibrant life of the community. Research internships are available in all areas of research, and are offered year\\-round, though they typically begin in the summer.  \n\nIn this role you will conduct and source research needed to back Viva Insights product directions with science and uncover innovative ideas for product growth. You will use data science, research and analytics to be at the forefront of product strategy and investment, identify new opportunities and ideas for product innovation in partnership with customers and foster our reputation as world leaders in the organizational productivity area. **Responsibilities include:*** **AI Agent Prototype Development and Impact Study:** Utilize machine learning, natural language processing, and other AI engineering techniques to design and build an AI agent capable of providing data\\-driven insights and scientific interpretations of Copilot usage data and other relevant behavioral and business data. Conduct a study to evaluate the impact of the agent on key business outcomes.\n* **Collaboration across disciplines:** Collaborate across applied science, user research, data science, product, engineering, and design to scope agent capabilities, develop a phased plan and build a working science\\-backed agent that addresses real customer needs in the employee experience and data and analytics markets.\n* **Knowledge sharing and product impact:** Provide insights and breakthroughs through prototypes, internal learning sessions, and external thought leadership, and work with product teams to incorporate findings into the existing Copilot Analytics product.\n* **Publication and internal reports:** Work towards submitting a research paper in a top conference or journal in HCI or AI applications as well as author internal reports for leadership in product.\n\n**Qualifications**\n------------------\n\n#### **Required Qualifications**\n\n* Current PhD student in computer science, artificial intelligence, data science, or related fields.\n* At least 1 year experience conducting original research in (or closely related to) Natural Language Processing, ML, Agentic technologies, HCI and/or HAI.\n\n**Other Requirements*** Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship.\n* In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.\n\n#### **Preferred Qualifications**\n\n* Familiarity with LLMs and their applications in real\\-world systems.\n* Proven experience with lightweight machine learning techniques and their integration with deep learning models.\n* Demonstrated proficiency in mixed\\-technologies and AI prototyping\n* Experience with Organizational Behavior, Computational Social Science and end\\-to\\-end data modeling.\n* Programming proficiency in Python and experience with machine learning frameworks (e.g., TensorFlow, PyTorch)\n* Demonstrates the ability to think unconventionally to derive creative and innovative solutions.\n* Published research in top\\-tier AI/ML or HCI/HAI conferences (e.g., NeurIPS, ACL, CHI etc).\n* Familiarity with human\\-computer interaction (HCI) principles and methods for studying user interactions with AI systems.\n* Strong project management skills to work with diverse teams.\n* A keen interest in translating cutting\\-edge AI research into real\\-world business impact.\n\n\nThe base pay range for this internship is USD $6,550 \\- $12,880 per month. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $8,480 \\- $13,920 per month.  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us\\-intern\\-pay\nMicrosoft accepts applications and processes offers for these roles on an ongoing basis.\n\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "company_url": "https://www.indeed.com/cmp/Microsoft",
      "company_url_direct": "http://www.microsoft.com/",
      "job_type": [
        "internship"
      ],
      "compensation": {
        "interval": "monthly",
        "min_amount": 6550.0,
        "max_amount": 13920.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-09",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Internet And Software",
      "company_addresses": "One Microsoft Way Redmond, Washington 98052-6399",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Our mission is to empower every person and every organization on the planet to achieve more.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/88813b3f866a5b58c9685073e3b87e05",
      "banner_photo_url": null,
      "job_function": null
    }
  ]
}