{
  "company_name": "NBCUniversal",
  "sector": "Media_and_Entertainment",
  "sample_size": 20,
  "total_jobs_available": 349,
  "jobs": [
    {
      "id": "in-a30eb0dbc87de1d3",
      "title": "L2 Digital Operator",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=a30eb0dbc87de1d3",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000033721565-l2-digital-operator",
      "location": {
        "country": "US",
        "city": "Stamford",
        "state": "CT"
      },
      "description": "**Company Description**  \n\nNBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world\\-renowned theme parks and a premium ad\\-supported streaming service.  \n\n  \n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever\\-changing face of the world. Click here to learn more about Comcast NBCUniversal’s commitment and how we are making an impact.\n\n **Job Description**  \n\nOur Direct\\-to\\-Consumer (DTC) portfolio is a powerhouse collection of consumer\\-first brands, supported by media industry leaders, Comcast, NBCUniversal and Sky. When you join our team, you'll work across our dynamic portfolio including Peacock, NOW, Fandango, SkyShowtime, Showmax, and TV Everywhere, powering streaming across more than 70 countries globally. And the evolution doesn't stop there. With unequalled scale, our teams make the most out of every opportunity to collaborate and learn from one another. We're always looking for ways to innovate faster, accelerate our growth and consistently offer the very best in consumer experience. But most of all, we're backed by a culture of respect. We embrace authenticity and inspire people to thrive.\n\n\nAs a Digital L2 Operator at NBC Universal (NBCU), you will be overseeing the distribution and support of NBCU's digital properties including live streams, linear and VOD assets to internal and external distribution partners and platforms. At the core, this role will oversee a team of L1 monitoring and support personnel within the NBCU Digital Network Operations Center. This team facilitates the monitoring and control of our digital distribution operation and associated internal infrastructure. You will manage the day\\-to\\-day responsibilities of the L1 team. The operation will include real\\-time monitoring of live streams, VOD delivery workflows, internal content processing and management systems, and a set of data aggregation tools across the entire distribution chain. You will act as L2 support and the primary point of escalation for the L1 team. In conjunction, you help oversee product support and delivery of video across on and off\\-domain platforms.\n\n\nLevel 1 and Level 2 support will be facilitated by this collective group, including real\\-time troubleshooting, escalation, resolution, and reporting of issues. The Digital L2 Operator will be a primary point of inbound and outbound escalations and communication on behalf of the greater Digital Operations organization. You will also be accountable for measuring and controlling quality across the on\\-air environment, by driving best practice training, technology, and workflows. This role is a unique opportunity to help grow a state\\-of\\-the\\-art, cutting\\-edge, one\\-of\\-a\\-kind facility and team that will pioneer digital delivery and distribution for the industry.\n\n**Essential Functions (Responsibilities):**\n\n* Oversee the end\\-to\\-end distribution and support (L1\\) personnel to ensure the availability and reliability of NBCUniversal assets on NBC OTT Platforms\n* Own and manage L1 support, including escalation, resolution, and reporting across the digital footprint and larger organization\n* Digital encoder set up of Tier\\- 1 event\\-based streaming across the NBC Portfolio including NFL, Premier League, The Open Championship, The Olympics, etc.\n* Assist partners and clients to resolve issues, satisfy delivery obligations, and helping execute workflow changes within our dynamic environment\n* Capture Proxy logging of consumer devices to assist Engineers and Developers in troubleshooting outages\n* Own the timely response of support tickets and escalation to Supervisors and the Incident Management team\n* Own and manage strong working relationships with internal and external partners and clients\n\n  \n\n**Qualifications** **Basic Qualifications:**\n\n* Bachelor’s degree and/or related experience\n* Minimum of 2 years’ experience in Digital Operations\n* Minimum of 2 years’ experience in Product Support or Dev Ops\n* Minimum of 2 years’ experience in a Network Operations Center or digital distribution facility\n* Minimum of 2 years’ experience in a role with a track record of effective staff management along with high energy level, and strong team skills\n* Minimum of 2 years’ experience working on a support team\n* Willingness and ability to work or be on call at any time, sometimes on short notice to support a 24/7/365 operation\n\n**Desired Characteristics:**\n\n* Extensive experience, understanding and knowledge of digital product and distribution systems, standards, and processes\n* Technical experience with digital video and audio, troubleshooting and test techniques\n* Prior experience with video encoding, delivery distribution workflows\n* Experience with scheduling and resource management\n* Strong attention to detail, communication, and interpersonal skills\n* Effectively flexible in approach, and responds well to pressure\n* A track record of meeting or exceeding performance expectations\n\n**Eligibility Requirements:**\n\n* Interested candidate must submit a resume/CV through Company website to be considered\n* Must be willing to work onsite in Stamford, CT\n* Must have unrestricted work authorization to work in the United States\n* Must be 18 years or older\n* Willingness and ability to work or be on call at any time, sometimes on short notice to support a 24/7/365 operation\n* It is the policy of Company and Company’ s affiliated businesses to consider all qualified applicants for employment without regard to race, color, religion, national origin, sex (including pregnancy) sexual orientation, age, disability, veteran status or other characteristics protected by law.\n\n*This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.*\n\n  \n\n**Compensation:** This is a full\\-time, onsite, hourly, non\\-exempt position with a pay rate of $37\\.95 per hour, based on a rotating 38\\-hour weekly schedule.\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": null,
        "max_amount": null,
        "currency": "USD"
      },
      "date_posted": "2024-12-27",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-099c46141ab36a69",
      "title": "Coordinator, Communications",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=099c46141ab36a69",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000030936900-coordinator-communications",
      "location": {
        "country": "US",
        "city": "Universal City",
        "state": "CA"
      },
      "description": "**Company Description**  \n\nNBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world\\-renowned theme parks and a premium ad\\-supported streaming service. Here you can be your authentic self. As a company uniquely positioned to educate, entertain, and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced, and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever\\-changing face of the world. Click here to learn more about Comcast NBCUniversal’s commitment and how we are making an impact.\n\n **About Us**\n\n\nUniversal Studio Group is the umbrella brand that houses NBCUniversal's four television studios: Universal Television, UCP, Universal Television Alternative Studio and Universal International Studios. Collectively, the four premium studio brands produce over 3,000 hours of programming currently airing or streaming around the globe and own one of the largest libraries in the world with over 130,000 episodes of television. Led by Chairman Pearlena Igbokwe, USG collaborates with some of the industry's most visionary storytellers to champion a diverse slate of ambitious, creative and passionate projects. Current hits include Dick Wolf’s “Law \\& Order,” “One Chicago” and “FBI”\\-branded series, Emmy® Award\\-winning “Hacks,” “The Umbrella Academy,” “The Equalizer,” “Ted,” “Apples Never Fall,” “We Are Lady Parts,” “The Wall” and longtime NBC favorite “Hollywood Game Night.” Universal Studio Group continues to house some of the greatest contemporary shows in television history, including “The Office,” “Parks and Recreation,” “Suits,” “The Good Place,” “Will \\& Grace,” “Law \\& Order,” “Monk,” “Psych,” “Friday Night Lights,” “Parenthood,” “Battlestar Galactica,” “House,” “Mr. Robot” and “Downton Abbey.” Universal Studio Group is a division of NBCUniversal, one of the world's leading media and entertainment companies.\n\n **Job Description** **Job Purpose**\n\n\nThe Coordinator, Communications will assist in the day\\-to\\-day administrative support of the EVP, Global Communications and Marketing for the Universal Studio Group division.\n\n**Essential Responsibilities**\n\n* Cover the desk (phones, strategic calendar/scheduling, preparing reports and agendas, booking travel, rectifying expenses etc.)\n* Answer telephones, screen calls, route callers, take messages, respond to internal and external inquiries, and provide routine information within scope of authority\n* Function as administrative liaison to departmental staff, other departments, external vendors and consultants\n* Maintain/update press contact database and business contacts\n* Prepare internal and external correspondence as needed\n* Track, reconcile and file departmental invoices/accounting alongside the manager of corporate communications\n* Assist in preparing key dates and other departmental reports for review\n* Assist in meeting preparation including creating presentations and reports outlining key objectives\n* Handle office administrative duties for the Communications office (schedule IT, office supply orders, coordinate drive\\-ons with security and provide check in instructions, schedule facilities, manage office share drives etc.)\n* Support Communications team on series campaigns and events as needed\n* Maintain standards of strict confidentiality with respect to all matters and documents\n\n **Qualifications** **Basic Requirements:**\n\n* 1\\+ year of public relations or entertainment industry experience, including internships\n* Experience with Microsoft Office products (i.e. Word, Excel, PowerPoint, Outlook, Canva or Equivalent Application such as Storydoc)\n* Working knowledge of PR coverage tools (i.e. Releasd, Muck Rack, Critical Mention, Cision, etc.)\n\n**Desired Characteristics:**\n\n* Bachelor’s degree\n* Superior organization and ability to meet tight deadlines in a fast\\-paced environment\n* Experience coordinating multiple assignments and projects\n* Excellent writing skills with attention to detail\n* Proactive, highly resourceful, a problem solver, strong external and internal communications skills\n* Ability to exercise a high level of discretion in handling confidential and sensitive information\n* Ability to work both independently and with a team\n* Hard worker with the desire to learn television communications and B2B studio marketing\n\n**Additional Requirements:**\n\n* Must be willing to work in Universal City, California\n* Must have work authorization to work in the United States\n* Willingness to work overtime and on weekends with short notice\n* Hybrid: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week\n\n  \n\nThis position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $50,000 \\- $60,000\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nNBCUniversal will consider for employment qualified applicants with criminal histories, or arrest or conviction records, in a manner consistent with relevant legal requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 50000.0,
        "max_amount": 60000.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-09",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-1333dafb31ff5a54",
      "title": "Associate Producer, TODAY with Jenna and Friends",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=1333dafb31ff5a54",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000034006541-associate-producer-today-with-jenna-and-friends",
      "location": {
        "country": "US",
        "city": "New York",
        "state": "NY"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n **Job Description**  \n\nAs an Associate Producer for TODAY with Jenna and Friends, you will work directly with producers and senior producers to help pitch, write, and produce entertainment, lifestyle, and pop culture content for broadcast.\n\n**Responsibilities:**\n\n* Assist with full scope of production including research, booking, and pre\\-interviewing\n* Write and produce segments\n* Gather visual elements, prep graphics, and assist with editing for segment production\n* Coordinate with technical and operations staff and outside resources selected by producers\n\n  \n\n**Qualifications**  \n\n* At least three years’ of editorial experience working in production at the network level, preferably with morning television\n* Bachelor’s degree preferred\n* Must have strong social media knowledge\n* Proficient in Outlook and iNews\n* Must be willing and able to work flexible hours, under tight deadline pressure, including breaking news; ability to work additional hours beyond scheduled shift with little or no notice if needed\n* Willing and able to work in New York, NY\n* Must have unrestricted work authorization to work in the United States\n\n**Desired Characteristics****:**\n\n* DV shooting experience\n* Knowledge of non\\-linear editing systems including Avid\n* Demonstrated strong knowledge and interest in pop culture\n* Strong interpersonal skills\n* Ability to pitch original and creative ideas\n* Strong journalistic writing and research skills, as well as editorial judgment\n* Ability to multi\\-task and prioritize assignments\n* Knowledge of NBC News Policies and Guidelines and Practices\n\n**Additional Job Requirements**:\n\n* **Hybrid**: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.\n\n\nThis position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $65,000 \\- $80,000\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 65000.0,
        "max_amount": 80000.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-30",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-560a4032a0654766",
      "title": "Analyst, Insights & Measurement",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=560a4032a0654766",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000035401894-analyst-insights-measurement",
      "location": {
        "country": "US",
        "city": "New York",
        "state": "NY"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n **Job Description**  \n\nThe Ad Sales Insights \\& Measurement team is seeking an Analyst to join our growing Impact team. We are a strategically orientated group that partners with agencies and clients to measure the effectiveness of advertiser campaigns and sponsorships across NBCU content, platforms and properties. We provide insights to our clients about how their campaign performed across the purchase funnel. We answer key questions including: How did advertising with NBCU deliver on KPIs and help solve the client’s business challenges? Which NBCU content or property or platform was the most effective in delivering client KPIs? What best practices from all measurement projects can be leveraged to maximize the effectiveness of future campaigns?\n\n\nThe Analyst position will be responsible for supporting their team in developing, executing and delivering cross\\-funnel campaign measurement. The role provides the opportunity to support measurement across linear, digital and social, as well as key tentpole events (e.g., BravoCon, Billboard Latin Music Awards, and sports properties like NFL Sunday Night Football \\& FIFA World Cup). The highly visible role also plays a critical cross\\-functional role, working across internal stakeholders, clients and agencies. Candidates should be passionate about entertainment and the media business.\n\n**In this role, you must be able to use research and:**\n\n* Pull data from research tools, dashboards and data files from vendors to gather insights about campaign performance\n* Create presentations that communicate campaign results, insights and recommendations in visually compelling formats\n* Engage with internal stakeholders and outside vendors to ensure campaign elements are measured, project milestones are adhered to, and results are delivered within deadlines\n* Support supervisor and the broader Impact team on key Sales priorities and initiatives\n* Assist in the development of case studies\nThe Ad Sales Insights \\& Measurement team is seeking an Analyst to join our growing Impact team. We are a strategically orientated group that partners with agencies and clients to measure the effectiveness of advertiser campaigns and sponsorships across NBCU content, platforms and properties. We provide insights to our clients about how their campaign performed across the purchase funnel. We answer key questions including: How did advertising with NBCU deliver on KPIs and help solve the client’s business challenges? Which NBCU content or property or platform was the most effective in delivering client KPIs? What best practices from all measurement projects can be leveraged to maximize the effectiveness of future campaigns?\n\n **Qualifications**  \n\n* Four\\-year degree (B.A., B.S.) from an accredited college or university, preferably in Marketing, Communications, Psychology, Media, Economics/Finance, Math, Statistics, Computer Science, Information Technology, Marketing Analytics or related field\n* Must be well versed in Microsoft Word and PowerPoint and an expert in Microsoft Excel (formatting, creating charts/graphs, pivot tables and formulas); data processing skills a plus\n* Experience with qualitative and quantitative research methods that support internal objectives, including writing surveys, managing survey fielding, and analyzing banners \\& crosstabs\n\n**Desired Characteristics:**\n\n* Experience at a broadcast or cable network, advertising agency or primary research vendor/provider a plus\n* Experience with syndicated and/or custom brand impact and attribution measurement partners a plus. Examples include Kantar, Dynata, EDO, Marketcast, LiveRamp / Data Plus Math, Circana, NCS, ListenFirst, Nielsen Social and YouGov\n* Proven data analyzation, interpretation, and visualization skills\n* Highly organized and detail\\-oriented with the ability to set priorities, handle multiple projects and meet tight deadlines\n* Strong communication skills necessary, both oral and written\n* Ability to work independently and as part of a team\n* Affinity for numbers and the story behind them\n* Naturally curious, resourceful and motivated\n* Open\\-minded and able to incorporate feedback and learnings into future projects\n\n**Additional Requirements:**\n\n**Hybrid**: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.\n\n\nThis position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.\n\n**Salary range:** $62,000 \\- $80,000\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 62000.0,
        "max_amount": 80000.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-08",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-428fdbbcca6393f5",
      "title": "Sr. Solution Manager, SAP Payroll (US)",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=428fdbbcca6393f5",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000030939114-sr-solution-manager-sap-payroll-us-",
      "location": {
        "country": "US",
        "city": "Orlando",
        "state": "FL"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n **Job Description**  \n\nJoin the Systems, Application and Products (SAP) HR and Payroll Systems Team to perform SAP Payroll Systems Management activities in support of business requirements, improving or adding new functionality to the existing SAP Enterprise Resource Planning (ERP) Human Capital Management (HCM) landscape as necessary.\n\n* Review existing solutions and processes to identify areas for improvement, maintain integrity of the HCM solutions by reviewing build and run changes, provide input for future solutions \\& system architecture, by applying knowledge of SAP HCM PY.\n* Assist with bridging the gap between understanding requirements, functional specifications, testing, and delivery.\n* Perform and manage configuration on SAP Payroll.\n* Manage projects and project teams to successfully deliver medium and large\\-scale projects.\n* Working with the key business stakeholder, vendors and other IT teams to gather requirements and manage customer / customer expectations and build consensus to deliver SAP Payroll solutions.\n* All other duties as assigned.\n\n  \n\n**Qualifications**  \n\n* Bachelor's degree or equivalent in Computer Engineering, Electronics Engineering, Computer Science, Information Systems, or a related technical/quantitative field and 5 years of progressively responsible post\\-Bachelor's degree related experience\n* Requires 12 years of functional experience with SAP Payroll. The experience must include:\n\t+ US Payroll – SAP US PY Taxation, Earnings and Deductions, BSI Tax Factory, W2, Tax Reporter\n\t+ Strong understanding of various benefits, benefits plans and experience with integrations with various benefits vendors e.g. 401K, Deferred Comp, H\\&W, Union PHW.\n\t+ Excellent Knowledge of SAP Payroll Schema and Rules\n\t+ In Depth experience of SAP Payroll based Interfaces and Reports\n* 5 years' experience in managing small and medium size projects as it relates SAP HR/Payroll\n* 5 years' experience managing multiple projects and working with the other members of the payroll IT team to make sure the projects are delivered on time and without any issues.\n* 10 years of experience working with the key business stakeholder, vendors and other IT teams to gather/deliver requirements and manage customer / customer expectations\n* Must have minimum experience of 3\\+ SAP US Payroll implementations\n* Excellent communication and presentation skills\n\n**Preferred Qualifications**\n\n* ABAPHR \\- experience in development in US Payroll Module\n\n**Hybrid**: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 120596.0,
        "max_amount": 152702.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-09",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-b891ddac886e2b8e",
      "title": "Specialist, Performance Marketing",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=b891ddac886e2b8e",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000030931294-specialist-performance-marketing",
      "location": {
        "country": "US",
        "city": "New York",
        "state": "NY"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n **Job Description**  \n\nAt Peacock, we know life is complicated but believe entertainment shouldn’t be. We envision a more human streaming experience that embraces the entertainment you love. Backed by 100\\+ years of NBCUniversal legacy, we know how to entertain. We combine this legacy with an insatiable itch for innovation, embracing the data and technologies that challenge the status quo. Our team is never done obsessing over how best to deliver excellence across television, film, sports, news, and more.\n\n\nThis ambition is a group effort. As challengers at heart, our secret weapon is our talented team of big thinkers, data\\-driven drivers of growth and innovation. We start by putting people first, embracing empathy and compassion to create a more dynamic, more fulfilling workplace and a better, more enjoyable product. As a company, we embrace the power of transparency and inclusion. We know the best idea can come from anywhere, so we’re committed to creating an organization where we act as one and put ego aside. We are determined to forge the next frontier of streaming through trust, teamwork, and talent.\n\n\nWe are looking for a media savvy, data driven **Specialist, Performance Marketing** to join our team. The role will support the Performance Media team in planning the Always On strategy and managing the optimization of paid social campaigns driving subscriptions across Peacock/direct\\-to\\-consumer products.\n\n**Responsibilities:**\n\n* Help manage all paid social acquisition campaigns across various platforms, including but not limited to, Facebook, Instagram, Snapchat, Twitter, TikTok, Pinterest, and Reddit.\n* Serve as a central point of contact for the performance marketing agency to plan and optimize social media campaigns towards CPA, LTV, and ROAS goals across channels, and then summarize results for a broader audience.\n* Collaborate on the creative process \\- briefing and tracking of creative assets, collecting feedback, and stakeholder management to ensure accurate and timely asset delivery.\n* Work with cross\\-functional teams to help develop test hypotheses and build out a/b test plans and ensure accurate measurement and reporting of campaign performance.\n* Analyze campaign performance data regularly, providing insightful updates on pacing, volume, optimizations, and channel contribution to business objectives.\n* Work closely with social media account reps, staying on top of industry trends, leverage new technologies and participate in open betas across the platforms.\n* Maintain optimal channel and investment mix based on MTA and MMM modeling recommendations.\n\n  \n\n**Qualifications** **Desired Qualifications:**\n\n* 2\\+ years’ experience media buying, optimizing, analyzing, and reporting on paid campaigns on social platforms (Meta, Snap, TikTok, Reddit, Twitter, Pinterest, etc)\n* In\\-platform buying experience at an agency or in\\-house team preferred\n* Strong project management and interpersonal skills, with ability to take initiative in a challenging, fast\\-paced environment of multiple priorities.\n* Proven track record optimizing media campaigns to deliver against CPA and volume objectives.\n* Familiarity with testing methodologies and incrementality\n* Entertainment, advertising or e\\-commerce industry experience a plus\n\n**Hybrid**: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.\n\n\nThis position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.\n\n\nSalary Range: $65,000 \\- $85,000\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 65000.0,
        "max_amount": 85000.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-09",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-76a353b97b853c9e",
      "title": "Sr. Manager, Global Finance Operations - Record to Report (R2R)",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=76a353b97b853c9e",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000035452040-sr-manager-global-finance-operations-record-to-report-r2r-",
      "location": {
        "country": "US",
        "city": "Universal City",
        "state": "CA"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n **Job Description** **Role Purpose:**\n\n\nThe Global Finance Operations Record\\-to\\-Report Senior Manager oversees the Record\\-to\\-Report functions, which include general ledger accounting, monthly close processes, asset accounting, account reconciliations, and various other tasks performed by both onshore and offshore teams. This role ensures that the BPO (Business Process Outsourcing) provider meets service level agreements (SLAs), delivers excellent customer service to business units as the primary point of contact, and drives efficiency through a shared service model.\n\n\nThe Senior Manager will manage monthly accounting activities to ensure compliance with generally accepted accounting principles (GAAP), Sarbanes\\-Oxley (SOX) requirements, and corporate policies. Additionally, this role plays a critical part in implementing process improvements, integrating new systems and businesses, and supporting global transformation\n\n**Responsibilities:**\n\n* Closely manage the day\\-to\\-day accounting operations performed by both on \\& offshore teams; provide analytics to key business stakeholders for decision making; execute month\\-end accounting close, review quarterly corporate submissions and reporting; provide support on both statutory and US financial audits and requests from participations and internal operational audits.\n* Ensure timeliness and accuracy of the overall monthly close activities, including account reconciliations as performed by the offshore teams; perform review and ad hoc analysis; identify areas to improve, streamline, and transform based on KPI.\n* Provide excellent customer service to business stakeholders, including addressing and resolving queries escalated by both on \\& offshore teams in a timely manner\n* Serves as a business partner by maintaining in\\-depth knowledge of the industry and accounting policies \\& principles.\n* Review monthly metrics with BPO and business stakeholders to improve processes and resolve issues.\n* Work alongside R2R Global Process Owner and R2R peers across other locations to drive forward transformation initiatives.\n* Manage the transition of new processes from business units into Global Finance Operations via robust governance and documented standard operating procedures.\n* Develop operational plans, monitor progress and outcomes against plans, and adjust priorities and resources accordingly.\n* Collaborate within and across organization on key company\\-wide initiatives and to support the Finance transformation roadmap (people, process, technology)\n* Research US GAAP as it relates to significant matters and provide accounting guidance to ensure compliance with US GAAP.\n* Manage all applicable SOX documentation compliance and provide audit support to both internal and external auditors.\n* Identifying areas of control risk. Ensure that an adequate and effective system of internal controls is maintained for reporting and analysis.\n* Successfully identifies strategic opportunities.\n* Recommends optimization for the department.\n* Promote One Team culture across Global R2R (with on/offshore team members) and other GFO Towers (P2P, O2C).\n* Other duties and special projects as needed.\n\n  \n\n**Qualifications** **Basic Requirements:**\n\n* Bachelor’s or advanced degree in accounting\n* CPA or MBA preferred\n* 8\\+ years’ experience in public or private accounting with experience directly related to key responsibilities preferred\n* 2\\+ years’ prior management experience required\n* Solid work experience in general ledger accounting, month\\-end close functions, including account reconciliations, trial balance reviews, analysis, KPI \\& metrics, and intercompany settlements\n* Prior experience in an outsourced or global shared services environment\n* Experience in implementing global processes and systems\n* Experience in driving process improvement within a Finance organization\n* Successful track record of development/delivery of complex solutions\n* Experience with S4/HANA, SAP ECC FI, or other large ERP systems and subsystems\n* Proficiency in a variety of systems, including MS Office suite of tools (Word, PowerPoint, Power BI, and high\\-level Excel spreadsheets such as familiarity with macros, pivot tables, lookup, and IF functions)\n* Exhibits a high level of resourcefulness and project management skills\n* International experience required (understanding of currencies, FX, intercompany settlement)\n* Entertainment industry preferred\n\n**Desired Characteristics:**\n\n* Ability to communicate effectively and tactfully in a multicultural environment with persons at all levels of the organization across all communication channels\n* Demonstrated customer service orientation and proficiency in working with multiple Finance and Accounting customer groups across a large global organization\n* Able to quickly build rapport and establish credibility with stakeholders\n* Excellent time management skills to perform in a fast\\-paced, high\\-pressure, high\\-volume environment and work well under tight deadlines\n* Autonomously and resourcefully delivers high\\-quality, high\\-impact work end\\-to\\-end\n* A collaborative, team player, flexible, and able to adjust to changing priorities quickly; demonstrates a high level of influence and teamwork skills\n* Supports an environment of intellectual curiosity and a culture of innovation\n* Must have a broad knowledge of US GAAP, with strong technical accounting, process, and controls background\n* Solid analytical and problem\\-solving skills, attention to detail a must\n* Experience in delivering system/process improvements and implementing projects within a finance organization\n* Flexibility to work overtime to support Global R2R agenda; travel as needed\n\n\nThis position has been designated as **hybrid**, generally contributing from the office a minimum of three days per week.\n\n\nThis position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $100,000 \\- $135,000 (bonus eligible).\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nNBCUniversal will consider for employment qualified applicants with criminal histories, or arrest or conviction records, in a manner consistent with relevant legal requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 100000.0,
        "max_amount": 135000.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-08",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-b9180a243b65682d",
      "title": "Sr Systems Engineer",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=b9180a243b65682d",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000030935695-sr-systems-engineer",
      "location": {
        "country": "US",
        "city": "Englewood Cliffs",
        "state": "NJ"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n **Job Description**  \n\nThe Production Application Engineering team is looking to fill the role of Sr Systems Engineer, joining the team to help drive improvements in workflow and technology adoption by our clients. This is a role which requires gathering project requirements from clients and implementing solutions from a combination of vendor offerings and internally developed solutions.\n\n\nProduction Engineering supports the technical infrastructure that drives studio and control room\\-based productions across NBCUniversal including News, Late Night Entertainment, and Digital. This infrastructure includes physical installation of turnkey hardware, network infrastructure \\& configuration, and public/private cloud systems. Within that group, the Production Application Engineering team focuses on initiatives like Virtualized Production Control Rooms, Augment Reality, and other Real\\-time Graphics applications.\n\n**Responsibilities:**\n\n* Become a subject matter expert on production workflows\n* Evaluate vendor software and solutions via proof of concept (POC) testing\n* Work with vendors to develop roadmaps to meet internal goals\n* Contribute to infrastructure\\- and configuration\\-as\\-code repositories\n* Conduct thorough testing of new and updated systems \\& workflows\n* Be an escalation resource for other internal teams\n* Participate in an on\\-call rotation schedule for off\\-hours escalations\n\n  \n\n**Qualifications** **Basic Requirements:**\n\n* BS in Computer Engineering, Computer Science, Information Systems, or equivalent work experience\n* 5\\+ years of experience in broadcast technology\n* Willingness and ability to work or be on\\-call outside business hours with limited notice based on production requirements\n* Familiarity with system\\-level troubleshooting of Windows or Linux operating systems\n* Previous experience with broadcast production systems (Graphics, audio mixing, video switchers, ect)\n* Experience communicating with internal clients to gather requirements and showcase new workflows\n\n**Desired Characteristics:**\n\n* Interest in or previous experience with infrastructure\\-as\\-code methodology\n* Video and audio signal flow troubleshooting experience\n* Network or IT\\-related troubleshooting and familiarity with tools like Puppet, Wireshark, Powershell\n* Previous experience with public and private cloud infrastructure\n* Experience evaluating new products or technologies and making recommendations for implementation\n* Understanding of NDI, SRT, RTMP, and other steaming video formats\n* Desire to learn, adapt, and grow if a fast\\-paced environment\n\n**Additional Requirements:**\n\n* **Fully Remote:** This position has been designated as fully remote, meaning that the position is expected to contribute from a non\\-NBCUniversal worksite, most commonly an employee’s residence.\n\n\nThis position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.\n\n\nSalary range: $105,000 \\- $135,000\n\n\nWe are accepting applications for this position on an ongoing basis.\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.\n\n*For LA County and City Residents Only:* NBCUniversal will consider for employment  \n\nqualified applicants with criminal histories, or arrest or conviction records, in a manner  \n\nconsistent with relevant legal requirements, including the City of Los Angeles' Fair Chance  \n\nInitiative For Hiring Ordinance, the Los Angeles' County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 105000.0,
        "max_amount": 135000.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-09",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-5fc6a6ba07ab67d8",
      "title": "Manager, Creative Partnerships, Development (Sports)",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=5fc6a6ba07ab67d8",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000032912634-manager-creative-partnerships-development-sports-",
      "location": {
        "country": "US",
        "city": "New York",
        "state": "NY"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n **Job Description**  \n\nAs a Manager, Creative Partnerships Development (Sports), you will be responsible for working with key NBC Sports stakeholders to market and increase sales of the properties of NBC Sports, NBCSports.com, Peacock and NBC Sports Social platforms.\n\n\nYou will be required to collaborate across the full NBCUniversal One Platform ad sales ecosystem including global and local. Reporting to the Director, Creative Partnerships Development (Sports), you will work on linear, digital, and social platforms within NBC Sports portfolio of properties that includes NFL, NBA, College Football and Basketball, NASCAR, Horse Racing, Premier League, and Telemundo Deportes.\n\n**Duties and Responsibilities**:\n\n* Work with all key stakeholders to develop sponsorable assets for sale across NBC’s portfolio of assets, primarily focused on Sunday Night Football\n* Oversee RFP process from pre\\-sale through execution\n* Create innovative marketing solutions across all platforms to drive incremental revenue\n* Work with key counterparts in Production, Programming, Promotions and Partner Leagues, as well as other teams from across NBC Universal including One Platform Marketing, Client Partnerships, Agency Partnership and Sales to ensure successful and quality execution of all sponsorship elements.\n* Develop creative tactics to tell brands’ stories within NBC’s NFL coverage through custom content and commercial creation, overseeing production ideas from pre\\- to post\\-\n* Manage the client/agency relationship from pitch phrase through implementation for all key accounts\n* Effectively lead, manage and mentor team of 1\\+ employees (Specialists, Coordinators, Interns and Pages)\n* Develop and coordinate internal training plan for junior members of the team\n* Manage, in conjunction with Specialist/Coordinator, day\\-to\\-day process of tracking all proposed and sold sponsorships and distribute game by game grid overviews to production, programming, consumer marketing, traffic and sales\n\n**Hybrid**: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.\n\n**Salary range:** $95,000 \\- $105,000 *(plus sales incentive commission)*\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 95000.0,
        "max_amount": 105000.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-19",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-6c7193499e5c93d1",
      "title": "Dir, Affiliate Growth & Optimizations, CNBC Select",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=6c7193499e5c93d1",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000035207614-dir-affiliate-growth-optimizations-cnbc-select",
      "location": {
        "country": "US",
        "city": "New York",
        "state": "NY"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n **Job Description**  \n\nAt NBCUniversal, we believe in the talent of our people. It's our passion and commitment to excellence that drives NBCU's vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world\\-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It's what makes us uniquely NBCU. Here you can create the extraordinary. Join us.\n\n\nWith CNBC in the US, CNBC in Asia Pacific, CNBC in Europe, Middle East and Africa, and CNBC World, CNBC is the recognized world leader in business news and provides real\\-time financial market coverage and business information to 410 million homes worldwide, including more than 90 million households in the United States and Canada. CNBC also provides daily business updates to 400 million households across China. The network's 15 live hours a day of business programming in North America (weekdays from 4:00 a.m. \\- 7:00 p.m. ET) is produced at CNBC's global headquarters in Englewood Cliffs, N.J., and includes reports from CNBC News bureaus worldwide. CNBC at night features a mix of new reality programming, CNBC's highly successful series produced exclusively for CNBC and a number of distinctive in\\-house documentaries.\n\n\nCNBC Digital delivers more than 55 million US multiplatform unique visitors each month. CNBC.com provides real\\-time financial market news and information to CNBC's investor audience. CNBC Make It is a digital destination focused on making you smarter about how you earn, save and spend your money by zeroing in on careers, leadership, entrepreneurship and personal finance. CNBC has a vast portfolio of digital products, offering CNBC content to a variety of platforms such as: CNBC.com; CNBC PRO, a premium service that provides in\\-depth access to Wall Street; a suite of CNBC mobile apps for iOS and Android devices; Amazon Alexa, Google Assistant and Apple Siri voice interfaces; and streaming services including Apple TV, Roku, Amazon Fire TV, Android TV and Samsung Smart TVs.\n\n\nCNBC Select is the personal finance arm of CNBC Digital. At CNBC Select, we want to help you upgrade all corners of your life starting with your money habits. Our mission is to provide our readers with high\\-quality service journalism and comprehensive consumer advice so they can make informed decisions and choose the right financial products for their lives.\n\n\nWe earn a commission from affiliate partners on many offers and links but we create all our content without input from our commercial team or any outside third parties, and we pride ourselves on our journalistic standards and ethics.\n\n\nOur personal finance product reviews are based on rigorous reporting by our editorial team. Navigating the world of financial products can be confusing. We aim to simplify the process by crunching the numbers, reviewing dozens of offers and providing you with all the information you need in one place without all the jargon.\n\n**Job Description**\n\n\nThe Director of Affiliate Growth \\& Optimizations is an exciting role working with key stakeholders to grow the CNBC Select's affiliate business through link \\& network optimizations, rate negotiations and partner management in the financial product (e.g. credit cards, investing, tax, insurance, loan) and personal finance review space. The ideal candidate has experience in financial commerce at an established personal finance review site or major affiliate network. The Manager will be part of the broader NBC News Group Commerce team encompassing TODAY Show, NBC News and CNBC and will report into the VP of Commerce for the News Group.\n\n\nMust be a self\\-starter with the ability to evaluate opportunity size, analyze affiliate revenue strategy, negotiate affiliate optimizations, manage day\\-to\\-day operations with affiliate partners, work closely with the edit, analytics, product, legal, audience development and compliance teams, monitor performance and impact, and present updates to stakeholders\n\n* Oversee affiliate monetization and optimization across CNBC Select\n* Manage day\\-to\\-day operations and conversations with our affiliate partners\n* Analyze financial impact of changes to affiliate strategy and provide recommendations to optimize revenue and growth; Lead discussions and provide strategic insights to key stakeholders on performance (Editorial \\& analytics teams)\n* Work with affiliate networks to ensure optimal rates across all links and placements\n* Evaluate \\& onboard new affiliate partners/networks as needed to match editorial or business initiatives\n* Build and maintain a calendar of commission updates and financial impact\n* Act as CNBC Select liaison for flagship advertising opportunities.\n* Work with compliance and product managers to implement, QA and monitor changes\n* Report to cross\\-functional partners monthly on progress\n\n**Additional Information:** This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $115,000\\-$150,000\\. (bonus eligible)\n\n **Qualifications**  \n\n* Minimum of five years' experience in a marketing, business or partner management role at a personal finance or commerce publisher or affiliate network\n* Bachelor's degree or equivalent experience required\n* Advanced Excel skills required along with strong data analysis and affiliate commerce financial modeling experience\n* Partner management experience\n* Ability to collaborate across a number of functions and departments\n* Attention to detail\n* Creative\\-problem solving abilities and an eagerness to contribute to a fast\\-growing digital commerce business with an eye towards the reader and their needs\n* Strong prioritization skills with the ability to handle multiple completing deliverables\n* Possesses a high degree of emotional intelligence and can be flexible to adapt easily\n* Quick learner and problem solver who thinks outside the box to find solutions with a track record of successful results delivery\n* Established executive presence\n* Excellent verbal and written communication skills, including formal presentation skills\n* Strong business acumen, analytical and project management skills.\n\n**Additional Requirements:**\n\n* Interested candidates must submit a resume/CV through nbcunicareers.com to be considered.\n* Candidates must have unrestricted work authorization to work in the United States\n* **Hybrid:** This position has been designated as hybrid, generally contributing from the office a minimum of three days per week\n\n  \n\n**Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 115000.0,
        "max_amount": 150000.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-07",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-800ff4add331f311",
      "title": "Executive Producer – NBC Boston & Telemundo Nueva Inglaterra",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=800ff4add331f311",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000031578193-executive-producer-nbc-boston-telemundo-nueva-inglaterra",
      "location": {
        "country": "US",
        "city": "Needham",
        "state": "MA"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n\nNBCUniversal Local is NBCUniversal’s local media division that delivers English and Spanish\\-speakers and bilingual audiences in 31 U.S. markets and Puerto Rico, the very best in local sports, news, weather, consumer and investigative reporting, and lifestyle entertainment across any platform and screen. NBCUniversal Local is comprised of three individual media groups including the NBC Owned Television Stations, the NBC Sports Regional Networks and the Telemundo Station Group. The division is also home to multicast networks NBCLX, COZI TV and TeleXitos, the regional cable news network NECN, as well as NBC Spot On, an advanced video advertising business designed for local/regional CTV and OTT advertisers and several in\\-house companies including production company LXTV, marketing and promotions company Skycastle, its out\\-of\\-home business NBC Everywhere, and the Arthouse, a graphics design group. With seven regional sports networks and 42 NBC and Telemundo stations serving 38 percent of U.S. homes, NBCUniversal Local is the only network\\-owned local media division that is home to the largest bilingual local newsrooms within the country’s top 10 TV markets. NBCUniversal Local’s stations and networks serve diverse audiences and communities across linear, streaming, OTT, digital web, mobile and audio, and cable platforms and work together to keep local audiences informed anytime and anywhere. For more information, visit NBCUniversal.com.\n\n **Job Description**  \n\nNBC10 Boston \\& Telemundo Nueva Inglaterra are looking for a dynamic leader who can effectively oversee evening coverage and editorial decisions for both the NBC and Telemundo owned stations in Boston. This includes oversight of NBC10 Boston News at 7pm, 11pm and Telemundo Nueva Inglaterra News at 11pm. The ideal candidate will also be responsible for assisting with newsroom operations and supervising editorial content for multi\\-platform delivery. The candidate must have a critical combination of both excellent news judgement and communication skills, focusing on optimizing duopoly collaboration.\n\n**Essential Responsibilities:**\n\n* Responsible for all content and coverage decisions for NBC10 Boston Telemundo Nueva Inglaterra multiplatform\n* Lead a team of newscast Producers, Content Producers, Reporters, Photographers and Assignment Editors to gather news across New England\n* Strong editorial judgment as well the ability to respond and make decisions in a breaking news situation for cross\\-platform\n* Works with all facets of the duopoly including production, IT, engineering and newsroom to ensure smooth and seamless show productions and the most accurate and compelling local coverage.\n* Collaborates with newsroom leadership, other NBC Owned Television stations and NBC News for special events planning as well as day\\-to\\-day coverage\n* Communicate with news management and assignment desk personnel to shape newscasts and determine the composition and flow of all assigned platforms\n* Responsible for scheduling editorial staff (Producers and Content Producers) to ensure proper coverage\n* Participate in the performance appraisal process for assigned editorial staff in conjunction with the VP of News for NBC10 Boston Telemundo Nueva Inglaterra\n* Works with news leadership to ensure necessary training and coaching is provided for Producers and Content Producers\n* Participate in the NBC10 Boston Telemundo Nueva Inglaterra recruitment efforts and facilitate the newsroom orientation of new employees when needed\n* Track market competitive trends, develop and implement show content and format changes, and articulate vision to employees\n* Works with Creative Services to craft promotions that attract a wide audience\n\n  \n\n**Qualifications**  \n\n* Bachelor’s Degree in Journalism or related field, or equivalent work experience\n* Minimum 5 years’ experience working in news management or main show producing in a top 10 market.\n* Minimum 10 years of newsroom newsgathering and/or production experience in top 20 market\n* Minimum 10 years’ experience writing, producing and desktop editing\n* Experience copyediting scripts\n* Experience selecting, managing, developing, and motivating a team of experienced editorial news professionals\n* Proficiency in working with the latest newsroom technologies (both hardware and software)\n* Ability to help set and communicate newsroom policies\n\n**Desired Characteristics**\n\n* Solid news judgment, strong writing, and research skills\n* Proven strong journalistic leadership, with the ability to assign, direct and supervise broadcast and digital news coverage\n* Demonstrated ability to lead a staff effectively, solve problems, prioritize decisions, and successfully manage multiple assignments concurrently in a fast paced, breaking news, environment\n* Competitive success in delivering both ratings and rank success\n* Bilingual in English and Spanish\n* Ability to select, manage and develop strong editorial news professionals\n* Basic understanding and demonstration of editorial judgment and journalistic ethics in all platforms, including a current knowledge of laws of libel, slander and applicable FCC rules and regulations\n* Demonstrated ability to drive process improvements\n* Good collaborative and interpersonal skills to communicate at all levels\n* Understanding of emerging news production techniques and technology, with a pioneering spirit with a desire learn emerging technologies and invent the future\n* Believes that teams are smarter and more dynamic together\n\n**Eligibility Requirements:**\n\n* Interested candidates must submit a resume/CV through nbcunicareers.com to be considered\n* Must be willing to work in Needham, MA\n* Must be able to work flexible hours including weekends, holidays, and overnights\n* Must have unrestricted work authorization to work in the United States\n* **Required on\\-site:** This position is required to be performed full\\-time from an NBCUniversal\\-designated worksite.\n\n  \n\n**Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 98045.0,
        "max_amount": 124147.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-12",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-b369606c085177d7",
      "title": "Director, Trade Marketing, Sports and Olympics",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=b369606c085177d7",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000034511853-director-trade-marketing-sports-and-olympics",
      "location": {
        "country": "US",
        "city": "New York",
        "state": "NY"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n **Job Description**  \n\nAs the Director, Trade Marketing \\- Sports and Olympics, you will be responsible for working with key stakeholders across NBC Sports Group and NBCUniversal to market and drive demand for cross\\-platform Olympics advertising sales.\n\n**Duties and Responsibilities:**\n\n* Work across sales, communications, research, and development to create the value proposition for the Olympics offering specifically Milan 2026 Winter Games and LA 2028 Summer Games\n* Develop go\\-to\\-market strategies with the value proposition both externally and internally\n* Develop sales collateral and materials that illustrate the value proposition including presentations, sizzle videos, e\\-blasts and more\n* Build and develop product and audience\\-driven trade marketing campaigns that drive awareness to the benefits of buying Olympics\n* Liaise across multiple NBC Sports Groups such as production, marketing and programming teams to gather all of key information to develop offering\n* Oversee event management \\& premium development (content strategy, event ideation, branding, list management \\& execution) in collaboration with sales and corporate events\n* Develop immersive \\& one\\-of\\-a\\-kind experiences and activations that help build sales relationships and drive awareness for Olympics properties\n\n  \n\n**Qualifications**  \n\n* 7\\+ years' experience with a league, agency, client or media company sales organization background, where the individual was responsible for supporting team in the development of presentations, sponsorship, creative and promotion\n* Olympic media experience preferred\n* Ability to tell compelling stories by distilling and analyzing data into insights, positioning, and value propositions\n* Ability to project manage marketing campaigns including branding, collateral, merchandise \\& event execution in a timely manner\n* Bachelor’s Degree\n\n**Eligibility Requirements:**\n\n* Interested candidates must submit a resume/CV through nbcunicareers.com to be considered.\n* Willingness to travel and work overtime, and on weekends with short notice.\n* Must be willing to work at the office in New York, NY in a hybrid capacity. Monday and Friday virtual; Tuesday \\- Thursday on site. Flexibility to adjust as business needs dictate required.\n* Must be willing to submit to a background investigation.\n* Must have unrestricted work authorization to work in the United States.\n* Must be 18 years or older.\n\n**Desired Characteristics:**\n\n* General understanding of sports \\& Olympics advertising marketplace across various platforms\n* Experience in media marketing and the advertising sales process\n* Strong interpersonal skills (i.e., the ability to interact with all levels of management)\n* Self\\-Starter with strong organizational, project \\& event management skills\n* A detail\\-oriented individual with the ability to work in a cross\\-functional and fast\\-paced environment on multiple projects under tight deadlines\n* Highly innovative with positive \\& flexible attitude\n* Excellent oral and written skills\n* A comprehensive understanding of the suite of Microsoft Office tools, other presentation platforms, etc. (Adobe Photoshop \\& Illustrator and Ceros experience is preferred)\n\n**Hybrid**: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.\n\n\nThis position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.\n\n**Salary range:** $110,000\\- $125,000 \\+ sales incentive commission and long\\-term incentive eligible\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 110000.0,
        "max_amount": 125000.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-02",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-52c562d8fd298fb3",
      "title": "Project Manager - Emerging Technologies",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=52c562d8fd298fb3",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000034700102-project-manager-emerging-technologies",
      "location": {
        "country": "US",
        "city": "Universal City",
        "state": "CA"
      },
      "description": "**Company Description**  \n\nNBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world\\-renowned theme parks and a premium ad\\-supported streaming service.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create.\n\n **Job Description**  \n\nThe Universal Pictures Film Technology Department is seeking a Technical Project Manager to join our team as we envision the future of entertainment media. In this role you will be hands on with emerging technologies in film marketing and production including blockchain and AR/VR by taking ownership of the project management of multiple initiatives. You will work in close collaboration with technologists, product managers, creative producers, and studio executives to communicate and execute on agreed deliverables aimed to excite the next generation of consumers. This person will also manage the business relationships our team has with various technology and creative partners. A successful candidate will possess solid fundamentals in project management of technology products, have an understanding of Agile software development principles, be familiar with working in a media company and have strong organizational, communication, and administration skills.\n\n**Responsibilities**\n\n* Responsible for the project management and task execution tracking for multiple ongoing Innovation projects\n* Schedule and facilitate meetings with engineering, internal stakeholders and external vendors\n* Maintain and update key project information for the department portfolio\n* Setup and deliver new tech product and content demos for both an internal\\-facing audience to introduce new industry tech trends to the FilmTech group and broader audiences across the larger NBCU organization Provide regular updates to project stakeholders\n\n  \n\n**Qualifications**  \n\n* Minimum of 3 years of experience in immersive media technology or related field\n* Baseline/novice understanding of, and comfort with Microsoft Programs (Outlook/Word/Excel/PowerPoint) with an emphasis on comfort with Excel as it plays a significant role in job duties\n* Professional experience working in emerging media technology production\n* Experience with agile software development processes and project management\n* Experience in creating and maintaining project plans at both the individual project level and at a department portfolio level.\n* Expertise in using project planning tools such as Smartsheets, JIRA, Excel, and Google for Business\n* Experience in scheduling and facilitating meetings using Microsoft Outlook\n* Familiarity with different large storage systems such as Sharepoint, Dropbox, Google Drive, and Frame.io\n* Basic technical knowledge of uploading files from a local computer and organizing digital files in both Windows and Mac OS\n* Experience with and efficient in creating presentations and pitch decks (MS PowerPoint or Keynote)\n* Ability to demo and present ideas and project updates to large groups and senior executives\n\n**Eligibility Requirements:**\n\n* Interested candidate must submit a resume/CV through www.nbcunicareers.com to be considered\n* Must have unrestricted work authorization to work in the United States\n\n**Desired Characteristics:**\n\n* Highly organized with excellent administration skills and a high standard for documentation accuracy\n* Deep Interest and passion for content created for and/or with emerging technologies\n* Ability to adapt to fast\\-paced environment and demonstrates the ability to grasp new concepts and technologies quickly\n* Self\\-motivated and effective in an end\\-to\\-end project ownership\n* Ability to prioritize responsibilities, demonstrate follow\\-through, and be solutions\\-oriented\n* Collaborative team player: skilled at working across teams and external vendors\n* Strong communication skills\n\n**Additional Requirements:**\n\n**Hybrid**: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.\n\n\nThis position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website\n\n***Salary range:******$115,000\\.00 \\- $140,000\\.00 (bonus eligible)***\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nNBCUniversal will consider for employment qualified applicants with criminal histories, or arrest or conviction records, in a manner consistent with relevant legal requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 115000.0,
        "max_amount": 140000.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-03",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-6587eb4f45dbc89e",
      "title": "Pastry Sous Chef",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=6587eb4f45dbc89e",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000030932707-pastry-sous-chef",
      "location": {
        "country": "US",
        "city": "Universal City",
        "state": "CA"
      },
      "description": "**Company Description**  \n\nEach day Universal Studios Hollywood creates unforgettable experiences for our guests from around the world. We bring to life the ultimate Hollywood experience with our real working movie studio and heart\\-pounding rides, shows and attractions that put you inside some of the world’s most popular movies and TV shows. USH offers something for everyone from thrill seekers to movie lovers to family fun for all ages. Our Team Members are passionate individuals who create memorable moments whether it’s on the studio lot, or in our conference rooms, theaters, or kitchens. We believe in the talent of our team members. It’s our passion and commitment to excellence that drives our business to succeed in everything we do across the park. We believe in a culture of family and fun, here you can make a difference and build your career!  \n\n  \n\nNBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world\\-renowned theme parks and a premium ad\\-supported streaming service.  \n\n  \n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever\\-changing face of the world. Click here to learn more about Comcast NBCUniversal’s commitment and how we are making an impact.\n\n **Job Description**  \n\nThe Sous Chef would primarily be responsible for all culinary offerings in a designated area of Universal Studios Hollywood. This position will be responsible for ensuring the highest quality of food and service at all levels. This position in culinary is responsible for supervising and developing teams working across Universal Studios Hollywood.\n\n **Responsibilities:**\n\n* Proper and consistent production of all food products at all times\n* Conduct daily inspections of the facility and complete the “daily walk through” reports for all areas\n* Maintain all kitchens in a sanitary condition at all times\n* Work in conjunction with facilities to insure proper maintenance of all equipment\n* Accurately complete and maintain the daily production log and weekly production plan\n* In partnership with the Food Warehouse and the Fresh Product Receiving Clerk, inspect all received product\n* Create and maintain production recipes and specification book and photos.\n* Ensure that all charges into and out of the restaurants are current and correct.\n* Communicate with the information technology group to insure that all recipes are updated and accurate\n* Partner with the EATEC Team to insure all inventories are correct\n* Support the culinary team within the Theme Park and Catering, as assigned\n* Assist in the creation of innovative menus for new products as needed.\n* Practice effective organizational skills at all times\n* Work within all health and sanitation guidelines\n* Assist in the development of all food staff.\n* Establish and maintain effective control of cost of goods and waste\n* Uphold exceptional standards and practices at all times\n* Ability to foster and maintain strong working relationships across all functions within the park.\n* Provide operational analysis understanding to culinary and operational teams\n* Ensure the success of the food service waste management program.\n* Utilize all excess food items and insure it is transferred and or repurposed\n* Organize and execute skills training sessions for culinary team.\n* Partner with Human Resources for developing and/or improving training, including new hire training, for the culinary team\n* Understand the role that culinary plays in supporting our internal customers so that they are able to provide excellent products and services to our paying guests\n* Interact with guests in order to positively impact their experiences while visiting the Theme Park\n* Perform other duties as assigned\n\n\nThis position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $66,500 \\- $75,000\n\n **Qualifications** **Qualifications/Requirements:**\n\n* Proven knowledge of Word and Excel\n* Minimum 3 years of culinary experience, which includes working in a high volume fast pace restaurant or similar high production environment\n* Proven ability to work within a fast paced, guest oriented and highly collaborative environment.\n* ServSafe Certification\n\n **Desired Characteristics**\n\n* L.A. County Food Handlers Certification\n* HACCP trainingpris\n* 3 years management culinary experience\n* Must be able to express ideas clearly and logically that are fact based.\n* Must demonstrate good judgment and a strong sense of ethics in deciding how to respond to internal (TMs) and external customers’ (guests) concerns and issues while keeping company business models in mind\n* Must be highly collaborative and professional at all times\n* Must have excellent written and verbal skills to effectively communicate with all levels of the organization\n* Must be proficient in MS Word, Excel, food related Point of Service system (i.e. EATEC \\& Clarity)\n* Strong customer service, interpersonal and organizational skills\n* Able to provide creative solutions to guest situations\n* Ability to work in a high paced, repetitive team work environment\n* Experience managing in a union environment\n* Strong interpersonal and analytical skills\n* Quick thinker with the ability to make sound decisions\n* Able to manage effectively under deadlines\n* Previous experience with creating and managing budgets\n\n  \n\n**Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nNBCUniversal will consider for employment qualified applicants with criminal histories, or arrest or conviction records, in a manner consistent with relevant legal requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 66500.0,
        "max_amount": 75000.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-09",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-ac9c408ae25f09f4",
      "title": "Supervisor People Operations, Custodial Night Shift",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=ac9c408ae25f09f4",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000030934068-supervisor-people-operations-custodial-night-shift",
      "location": {
        "country": "US",
        "city": "Universal City",
        "state": "CA"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nEach day Universal Studios Hollywood creates unforgettable experiences for our guests from around the world. We bring to life the ultimate Hollywood experience with our real working movie studio and heart\\-pounding rides, shows and attractions that put you inside some of the world’s most popular movies and TV shows. USH offers something for everyone from thrill seekers to movie lovers to family fun for all ages. Our Team Members are passionate individuals who create memorable moments whether it’s on the studio lot, or in our conference rooms, theaters, or kitchens. We believe in the talent of our team members. It’s our passion and commitment to excellence that drives our business to succeed in everything we do across the park. We believe in a culture of family and fun, here you can make a difference and build your career!\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n **Job Description**  \n\nWe are seeking a dedicated and experienced Supervisor of Night Operations to lead our Custodial team in maintaining the cleanliness, sanitation, and safety of our Theme Park. This individual is responsible for managing the Night Operations team of 200\\+, including the night\\-to\\-night operation of the theme park. This individual will ensure that the theme park environment is clean, safe, maintained in a presentable fashion, while complying with all procedures \\& regulatory requirements. In addition, this individual will continue to strive in exceeding and providing extraordinary results for our internal and external guest as well as being responsible for implementing departmental programs focusing on team member \\& guest satisfaction as we strive to achieve Operational Excellence.\n\n**Key Responsibilities:**\n\n* **Team Leadership:**\n\t+ Supervise and guide night shift custodial staff to ensure efficient and effective cleaning operations.\n\t+ Conduct regular performance evaluations, provide constructive feedback, and support employee development.\n\t+ Promote a positive and collaborative work environment that emphasizes safety, teamwork, and high standards of service.\n\t+ Lead workforce planning; reward and recognition; Team Member events.\n* **Operations Oversight:**\n\t+ Implement and monitor nightly cleaning schedules to maintain the park’s cleanliness and safety standards.\n\t+ Ensure compliance with health, safety, and sanitation regulations.\n* **Safety Management:**\n\t+ Enforce safety protocols and guidelines, ensuring all staff adhere to best practices.\n\t+ Conduct regular safety training sessions and drills to keep the team prepared for any emergencies.\n\t+ Identify, investigate, and resolve safety hazards or incidents promptly.\n* **Resource Management:**\n\t+ Manage and track the usage of cleaning supplies and equipment, ensuring efficient use and timely replenishment.\n\t+ Assist in the maintenance and repair of janitorial equipment, coordinating with the maintenance team as needed.\n* **Quality Assurance:**\n\t+ Perform regular inspections of park areas to ensure cleanliness and safety standards are met.\n\t+ Address and resolve any cleaning\\-related issues or guest complaints efficiently.\n* **Training and Development:**\n\t+ Train new hires on cleaning procedures, safety protocols, and proper use of equipment and chemicals.\n\t+ Provide ongoing training to existing staff to ensure continuous improvement and adherence to standards.\n* **Administrative Duties:**\n\t+ Maintain accurate records of staff schedules, cleaning logs, safety training, and inventory.\n\t+ Prepare the night operations budgets, including labor, supplies, and operational equipment.\n\t+ Maintain accurate records of schedules, inspections, maintenance, safety training, and inventory.\n\t+ Report on operational metrics and provide updates to the Manager of Night Operations.\n\n  \n\n**Qualifications**  \n\n* High school diploma or related field preferred.\n* Minimum of 2 years of experience in janitorial or custodial services, with at least 1 years in a supervisory or management role.\n* Strong leadership and team\\-building skills with a proven ability to manage a large and diverse workforce.\n* Excellent organizational and time management skills.\n* Strong communication skills, both verbal and written.\n* Proficiency in Microsoft Office Suite and experience with janitorial management software preferred.\n* Strong knowledge of health, safety, and sanitation regulations.\n* Ability to work overnight shifts and weekends as required.\n\n**Physical Requirements:**\n\n* Ability to stand and walk for extended periods.\n* Ability to lift and carry up to 50 pounds.\n* Comfortable working in a variety of indoor and outdoor environments, including exposure to varying weather conditions.\n\n**Required On\\-Site**: This position is required to be performed full\\-time from an NBCUniversal\\-designated worksite.\n\n\nThis position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $25\\.00 \\- $28\\.00\\.\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nNBCUniversal will consider for employment qualified applicants with criminal histories, or arrest or conviction records, in a manner consistent with relevant legal requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 25.0,
        "max_amount": 28.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-09",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-7d4fa8a9ee2b123e",
      "title": "Producer, NBC Boston & NECN",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=7d4fa8a9ee2b123e",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000031816345-producer-nbc-boston-necn",
      "location": {
        "country": "US",
        "city": "Needham",
        "state": "MA"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n\nNBCUniversal Local is NBCUniversal’s local media division that delivers English and Spanish\\-speakers and bilingual audiences in 31 U.S. markets and Puerto Rico, the very best in local sports, news, weather, consumer and investigative reporting, and lifestyle entertainment across any platform and screen. NBCUniversal Local is comprised of three individual media groups including the NBC Owned Television Stations, the NBC Sports Regional Networks and the Telemundo Station Group. The division is also home to multicast networks NBCLX, COZI TV and TeleXitos, the regional cable news network NECN, as well as NBC Spot On, an advanced video advertising business designed for local/regional CTV and OTT advertisers and several in\\-house companies including production company LXTV, marketing and promotions company Skycastle, its out\\-of\\-home business NBC Everywhere, and the Arthouse, a graphics design group. With seven regional sports networks and 42 NBC and Telemundo stations serving 38 percent of U.S. homes, NBCUniversal Local is the only network\\-owned local media division that is home to the largest bilingual local newsrooms within the country’s top 10 TV markets. NBCUniversal Local’s stations and networks serve diverse audiences and communities across linear, streaming, OTT, digital web, mobile and audio, and cable platforms and work together to keep local audiences informed anytime and anywhere. For more information, visit NBCUniversal.com.\n\n **Job Description**  \n\nThe NBC10 Boston News Producer will be responsible for news of the day, special coverage, in\\-depth stories, breaking news and other news\\-related content as needed.  \n\n  \n\n**Job Duties:**\n\n* Responsible for the content and overall production of the local newscasts\n* Oversee all details of the broadcast while working closely with all members of the news team\n* Stack the rundown and manage the on\\-air broadcast from the control room\n* Contribute story ideas for the newscast and work closely with reporters to execute those ideas\n* Produce news stories and specials as assigned\n* Oversee and write the news briefs and daily promos when needed\n* Respond quickly and aggressively to breaking news and getting information on the air\n* Copy\\-edit reporter scripts as well as all newscast copy\n* Must work a flexible schedule when needed to cover other shifts and breaking news\n* Field produce stories for the on\\-air newscast and other news content platforms\n* Ensure accuracy of and update information for the on\\-air news ticker/crawl at the bottom of the screen\n\n  \n\n**Qualifications** **Required Qualifications:**\n\n* Minimum of 3 years of television news line producing experience\n* Minimum of 3 years of technical skills in news production including creating show rundowns\n* Must be proficient in desktop editing\n* College degree or equivalent experience in Journalism required\n\n**Desired Qualifications:**\n\n* Interested candidate must submit a resume/CV through www.nbcunicareers.com to be considered\n* Must be willing to work in Needham, MA\n* High degree of flexibility in scheduling and assignments with a willingness to travel and work overtime and on weekends with short notice\n* Ability to work any of a 24/7 shift, holidays, weekends and respond to breaking news events\n* Excellent tease\\-writing skills\n* Driven interest in current events \\& local issues\n* Must have unrestricted work authorization to work in the United States.\n* Must be 18 years or older.\n* Must be covered by Solutions, NBCU’s Alternative Dispute Resolution Program\n* **Required On\\-Site:** This position is required to be performed full\\-time from an NBCUniversal\\-designated worksite.\n\n  \n\n**Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 95914.0,
        "max_amount": 121449.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-13",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-4f24e5ff02c3a5f2",
      "title": "Reporter, NBC 5 Dallas-Fort Worth",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=4f24e5ff02c3a5f2",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000030928345-reporter-nbc-5-dallas-fort-worth",
      "location": {
        "country": "US",
        "city": "Fort Worth",
        "state": "TX"
      },
      "description": "**Company Description**  \n\nNBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world\\-renowned theme parks and a premium ad\\-supported streaming service. Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever\\-changing face of the world. Click here to learn more about Comcast NBCUniversal’s commitment and how we are making an impact.\n\n **Job Description**  \n\nNBCUniversal’s KXAS is seeking a highly motivated and driven News Reporter to join its team in the Dallas\\-Fort Worth area. In this role, you will gather, investigate, and report breaking news, delivering compelling content across multiple platforms, including on\\-air, online, and streaming.\n\n\nThe ideal candidate will have a passion for investigative journalism and experience covering law enforcement, with a proven ability to build strong sources within the community. We’re looking for someone who thrives in a breaking news environment, excels under tight deadlines, and consistently pitches unique and impactful enterprise stories.\n\n\nAt KXAS, you will have the opportunity to collaborate with a talented team of photographers and producers, helping to create some of the most engaging news content in the industry. If you are an ambitious reporter with a keen eye for the lead story, a drive for storytelling, and a commitment to excellence, we want to hear from you!\n\n **Qualifications**  \n\n* Minimum 5 years of television reporting experience\n* Bachelor’s Degree or equivalent experience\n* Proven track record of live reporting and strong storytelling skillset\n* Proven experience working on investigative stories\n* Experience building deep sources in community\n* The ability to collaborate across broader newsroom\n* Excellent writing skillset\n* Excellent communication and time management skills\n* Experience contributing to non\\-linear platforms\n* Must be able to handle intense deadline pressure\n* Must be able to ad\\-lib effortlessly in various types of situations, particularly breaking news\n\n**Desired Characteristics**\n\n* Bilingual in English \\& Spanish reading, speaking, and writing\n* General assignment reporting skills preferred\n* Ability to enterprise stories\n* Experience with digital editing and photography a plus\n* Experience working simultaneously on web products\n* Strong knowledge of social networking in relygard to content gathering and distribution\n\n**Eligibility Requirements**\n\n* Must be willing to work in Fort Worth, TX, just south of DFW airport\n* Must submit a video/reel/demo of work to be considered\n* Must have a valid driver’s license\n* Must be 18 years or greater\n* Must have unrestricted work authorization to work in the United States\n* Must be able to work long hours and a variety of shifts, when necessary\n* Must accept Solutions as NBCUniversal’s Alternative Dispute Resolution program\n\n  \n\n**Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 93860.0,
        "max_amount": 118847.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-09",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-32e2493ded22020a",
      "title": "Freelance Motion Graphics Designer - NBC Sports, (Live On Air Graphics)",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=32e2493ded22020a",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000035379149-freelance-motion-graphics-designer-nbc-sports-live-on-air-graphics-",
      "location": {
        "country": "US",
        "city": "Stamford",
        "state": "CT"
      },
      "description": "**Company Description**  \n\nNBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world\\-renowned theme parks and a premium ad\\-supported streaming service.  \n\n  \n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever\\-changing face of the world. Click here to learn more about Comcast NBCUniversal’s commitment and how we are making an impact.\n\n **Job Description** ***This is a freelance full\\-time hours project / limited term position with an estimated duration of up to 4 \\- 12 months, unless otherwise amended or terminated as deliverables within this project are completed. Conversion to full\\-time staff could be a consideration for this role.***\n\n\nThe NBC Sports On Air Graphics Team is looking for a ***freelance full\\-time staff broadcast motion*** graphics designer for its rapidly growing portfolio of live sports properties and studio shows. Join a team of sports fanatics that have an equal appreciation for typography, design and information layout. Your day\\-to\\-day responsibilities will include hands\\-on production of ground\\-up broadcast motion design work, as well as updating existing elements and templates for properties such as Sunday Night Football, NBA, Premier League, College Football and more. Every day you will be working in After Effects, Photoshop, Illustrator, and Cinema 4D, and having a strong handle on these tools is essential.\n\n\nSince you will be working with a tight group of sports design creatives, a collaborative and engaging spirit is essential to the success of this role, elevating the craft with a ‘get\\-to\\-air’ urgency.\n\n**JOB RESPONSIBILITIES:**\n\n* Work closely with a small creative team, establishing design tonality and graphic look\\-and\\-feel for various properties in the NBC Sports Group portfolio\n* Responsible for the creation of graphic and animated elements including in\\-game insert and interstitial graphics, show packages, opens and titles\n* Effectively communicate concepts and ideas to the Art Director and design team\n* Able to work on multiple packages and projects at the same time, while maintaining consistency with the overall graphic package\n* Able to interface and work well with multiple producers and departments under tight deadlines, and short timelines\n* Must be willing to work at the NBC Sports Group facility in Stamford, CT at least 3 days of the week\n\n  \n\n**Qualifications**  \n\n* College graduate with degree in graphic design or fine arts\n* 5\\+ years experience working at a network or broadcast design agency\n* Understanding of the implementation of design elements in network television and live sports environments a must\n* Passion for show packaging and knowledge of current trends in graphic design\n* Passion for smart, functional design, and an understanding of the balance between information and entertainment\n* Strong at concept \\& storyboard design\n* Strong design and typography skills\n* Strong understanding of the value of good motion theory\n* Strong presentation and communication skills\n* Must be flexible, detail\\-oriented, deadline driven and a good collaborator\n* Expert knowledge of Adobe Photoshop and Illustrator\n* Expert knowledge of Adobe After Effects\n* Extensive knowledge of Maxon Cinema 4D, including modeling, texturing, lighting, animating, use of dynamics, MoGraph, render optimization, Red Shift, etc.\n* Love of sports a plus\n\n**Additional Requirements:**\n\n* Interested candidate must submit a resume/CV through www.nbcunicareers.com to be considered\n* Must be willing to work in Stamford, CT\n* *Must be willing to work nights and weekends as needed*\n* Must have unrestricted work authorization to work in the United States\n* Must be 18 years or older\n* It is the policy of NBCUniversal and NBCUniversal’ s affiliated businesses to consider all qualified applicants for employment without regard to race, color, religion, national origin, sex (including pregnancy) sexual orientation, age, disability, veteran status or other characteristics protected by law.\n\n***Hybrid****: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.*\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 67670.0,
        "max_amount": 85686.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-08",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-b88cec374a714cd9",
      "title": "Manager of Data Quality - Data Engineering, Peacock",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=b88cec374a714cd9",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000030927044-manager-of-data-quality-data-engineering-peacock",
      "location": {
        "country": "US",
        "city": "New York",
        "state": "NY"
      },
      "description": "**Company Description**  \n\nWe create world\\-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad\\-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world\\-renowned theme parks and attractions through Universal Destinations \\& Experiences. NBCUniversal is a subsidiary of Comcast Corporation.\n\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n **Job Description**  \n\nOur Direct\\-to\\-Consumer (DTC) portfolio is a powerhouse collection of consumer\\-first brands, supported by media industry leaders, Comcast, NBCUniversal and Sky. When you join our team, you’ll work across our dynamic portfolio including Peacock, NOW, Fandango, SkyShowtime, Showmax, and TV Everywhere, powering streaming across more than 70 countries globally. And the evolution doesn’t stop there. With unequalled scale, our teams make the most out of every opportunity to collaborate and learn from one another. We’re always looking for ways to innovate faster, accelerate our growth and consistently offer the very best in consumer experience. But most of all, we’re backed by a culture of respect. We embrace authenticity and inspire people to thrive.\n\n\nAs part of the Direct\\-to\\-Consumer Decision Sciences team, the Manager of Data Quality will be responsible for overseeing a critical function that bridges data management with operational excellence. The role requires strong cross\\-functional collaboration skills to effectively engage with software engineering, data analytics, and elements of machine learning to understand data quality requirements and deliver effective solutions.\n\n\nIn this role, the Manager of Data Quality will share responsibilities in the development and operation of Data Quality monitors, automation to optimization of data quality pipelines that facilitate deeper analysis and reporting by the business, as well as support ongoing operations related to the Direct to Consumer data ecosystem. The candidate will act as a liaison between data engineering and other teams, advocating for data\\-driven decision making and best operational practices.\n\n**Responsibilities include, but are not limited to:**\n\n* Help manage a high\\-performance team of Data Quality Engineers and Data Quality Analysts\n* Contribute to and lead the team in design, build, testing, scaling and maintaining Data Quality monitors built in\\-house as well as 3rd party products, according to business and technical requirements.\n* Evaluate and select appropriate technologies and tools for data quality monitoring, ensuring alignment with organizational goals and industry best practices\n* Help Data Engineering organization deliver observable, reliable and secure data quality monitors, embracing “you build it you run it” mentality, and focus on automation and GitOps.\n* Continually work on improving the codebase and have active participation and oversight in all aspects of the team, including agile ceremonies.\n* Take an active role in story definition, assisting business stakeholders with acceptance criteria.\n* Work with Data Engineering Directors to share and contribute to the broader technical vision.\n* Develop and champion best practices, striving towards excellence and raising the bar within the department.\n* Research methods of data anomaly detection using broad range of techniques, including statistical and Machine Learning\n\n  \n\n**Qualifications**  \n\n* 5\\+ years relevant experience in Data Engineering or Data Analytics or Machine Learning\n* Strong leadership skills with the ability to lead and mentor a team of data engineers Experience in using techniques such as infrastructure as code and CI/CD\n* Experience with graph\\-based data workflows using Apache Airflow\n* Programming skills in one or more of the following: Python, Java, Scala, R and experience in writing reusable/efficient code to automate analysis and data processes Experience in processing large volumes of data using parallelism techniques/tooling, such as Apache Spark\n* Experience in processing structured and unstructured data into a form suitable for analysis and reporting with integration with a variety of data metric providers ranging from advertising, web analytics, and consumer devices\n* Experience in basic Machine Learning techniques is a big plus\n* Experience with working in large scale SQL\n* Understanding of pillars of Data Quality: Completeness, Timeliness, Validity, Uniqueness, Consistency, Accuracy (or similar)\n* Bachelors’ degree with a specialization in Computer Science, Engineering, Physics, other quantitative field or equivalent industry experience.\n\n**Desired Characteristics**\n\n* Experience with large\\-scale video assets\n* Ability to work effectively across functions, disciplines, and levels\n* Team\\-oriented and collaborative approach with a demonstrated aptitude, enthusiasm and willingness to learn new methods, tools, practices and skills\n* Ability to recognize discordant views and take part in constructive dialogue to resolve them\n* Pride and ownership in your work and confident representation of your team to other parts of NBCUniversal\n\n**Additional Requirements:**\n\n**Hybrid**: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.\n\n\nThis position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. **Salary range: $130,000\\-$170,000** *(bonus and long\\-term incentive eligible).*\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 130000.0,
        "max_amount": 170000.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-09",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-67c9329fed5992bb",
      "title": "Universal Destinations & Experiences Summer 2025 Internship - Business Analytics & Industrial Engineering",
      "company_name": "NBCUniversal",
      "job_url": "https://www.indeed.com/viewjob?jk=67c9329fed5992bb",
      "job_url_direct": "https://jobs.smartrecruiters.com/NBCUniversal3/744000030928070-universal-destinations-experiences-summer-2025-internship-business-analytics-industrial-engineering",
      "location": {
        "country": "US",
        "city": "Universal City",
        "state": "CA"
      },
      "description": "**Company Description**  \n\nEach day Universal Studios Hollywood creates unforgettable experiences for our guests from around the world. We bring to life the ultimate Hollywood experience with our real working movie studio and heart\\-pounding rides, shows and attractions that put you inside some of the world’s most popular movies and TV shows. USH offers something for everyone from thrill seekers to movie lovers to family fun for all ages. Our Team Members are passionate individuals who create memorable moments whether it’s on the studio lot, or in our conference rooms, theaters, or kitchens. We believe in the talent of our team members. It’s our passion and commitment to excellence that drives our business to succeed in everything we do across the park. We believe in a culture of family and fun, here you can make a difference and build your career!  \n\n  \n\nNBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world\\-renowned theme parks and a premium ad\\-supported streaming service.  \n\n  \n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever\\-changing face of the world.\n\n **Job Description**  \n\nUSH Capacity Studies \\- time studying, data collections, data analysis, at various USH attractions to look at general improvements. Also look at the variety of ways Attractions tracks Delays and enhance it to one or fewer solutions.\n\n**RESPONSIBILITIES**\n\n* To assist the Business Analytics and Industrial Engineering Department in accomplishing tasks\n* These tasks include time studies, data collection, data analysis, metric development and execution, and small projects pertaining to increasing efficiency, reducing costs, impacting sales, and improving ride throughput\n* Collect and compile observational data\\-time and motion studies\n* This data can be used to make business decisions around (but not limited to) ride capacity and utilization, Food and Merchandise sales, labor utilization, and standards\n* Assist in set\\-up and data entry of data for Technical Services, Operations, Merchandise, Foods, Entertainment, Park Services\n* Perform various traditional Industrial Engineering tasks as required\n* Ability to prioritize effectively and problem solve to ensure all tasks are completed in an effective and timely manner\n* Excellent interpersonal, presentation and facilitation skills\n* Energetic, strong communicator, highly motivated\n* Experience with data and statistical analysis and working in Microsoft Excel\n* Understands and actively participates in Environmental, Health \\& Safety responsibilities by following established USH policy, procedures, training, and team member involvement activities\n* Performs other duties as assigned\n\n**Pay Range:** $18\\-$25/hour\n\n\nPlease note this is a hybrid internship.\n\n **Qualifications** **EDUCATION**\n\n\nIn pursuit of Bachelor’s degree from a four year college or university in an accredited Industrial Engineering program\n\n **Additional Information**  \n\nAs part of our selection process, external candidates may be required to attend an in\\-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.\n\n\nNBCUniversal will consider for employment qualified applicants with criminal histories, or arrest or conviction records, in a manner consistent with relevant legal requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.\n\n\nIf you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.",
      "company_url": "https://www.indeed.com/cmp/Nbcuniversal",
      "company_url_direct": "http://www.nbcuni.com/",
      "job_type": [
        "internship"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 18.0,
        "max_amount": 25.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-09",
      "emails": [
        "AccessibilitySupport@nbcuni.com"
      ],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": "Media News And Publishing",
      "company_addresses": "30 Rockefeller Plaza\r\nNew York, NY 10112",
      "company_num_employees": "10,000+",
      "company_revenue": "$5M to $25M (USD)",
      "company_description": null,
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/6f526b41731090a4120566c102ae17d8",
      "banner_photo_url": null,
      "job_function": null
    }
  ]
}