{
  "company_name": "Cisco",
  "sector": "Technology",
  "sample_size": 20,
  "total_jobs_available": 257,
  "jobs": [
    {
      "id": "in-891dcf76742a0a49",
      "title": "Warehouse Mixing",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=891dcf76742a0a49",
      "job_url_direct": "http://www.indeed.com/job/warehouse-mixing-891dcf76742a0a49",
      "location": {
        "country": "US",
        "city": "Indianapolis",
        "state": "IN"
      },
      "description": "Position Overview\n\nWe are looking for an energetic individual who is self motivated and a team player. The mixing department creates batch seed mixes, including turf seed, cover crop seed, forage seed, and bird seed. Candidates must be detail oriented and able to multi task.\n\nResponsibilities\n\n* Add seed ingredients to mixers\n* Bag out mixes into 2,000 pound totes or 50 pound bags\n* Use small pack machine to create 5,10, and 25 pound mixes\n* Assist in other warehouse functions as needed\n* Will be trained in picking products and could move into a picking role, if needed\n* Assist inventory control\n* Adhere to safety procedures and promote safe work practices\n* Maintain attendance and punctuality as required by assigned work schedule.\n* Maintain a courteous and positive relationship with coworkers\n* Proactively assist with general housekeeping and other duties as assigned.\n\nJob Type: Full\\-time\n\nPay: $18\\.00 \\- $18\\.50 per hour\n\nBenefits:\n\n* 401(k)\n* Dental insurance\n* Health insurance\n* Paid time off\n* Vision insurance\n\nSchedule:\n\n* Monday to Friday\n* Weekends as needed\n\nWork Location: In person",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 18.0,
        "max_amount": 18.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-07",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-a50449972d0f77ca",
      "title": "Physical Design Engineer",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=a50449972d0f77ca",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Physical-Design-Engineer/1427282",
      "location": {
        "country": "US",
        "city": "San Jose",
        "state": "CA"
      },
      "description": "**The application window is expected to close on 11/30/2024****This is an onsite role and will require working out of the Milpitas/San Jose office location.** **Who We Are**  \n\nThe Common Hardware Group (CHG) delivers the silicon, optics, and hardware platforms for Cisco's core Switching, Routing, and Wireless products. We design the networking hardware for Enterprises and Service Providers of various sizes, the Public Sector, and Non\\-Profit Organizations across the world. Cisco Silicon One (\\#CiscoSiliconOne) is the only unifying silicon architecture in the market that enables customers to deploy the best\\-of\\-breed silicon from Top of Rack (TOR) switches all the way through web scale data centers and across service provider, enterprise networks, and data centers with a fully unified routing and switching portfolio. Come join us and take part in shaping Cisco's ground\\-breaking solutions by designing, developing and testing some of the most complex ASICs being developed in the industry. **Who You'll Work With**  \n\nYou will be in the Silicon One development organization as an ASIC Implementation Technical Lead in San Jose, CA with a primary focus on Design\\-for\\-Test. You will work with Front\\-end RTL teams, backend physical design teams to understand chip architecture and drive DFT requirements early in the design cycle. As a member of this team you will also be involved in crafting groundbreaking next generation networking chips. You will help lead to drive the DFT and quality process through the entire Implementation flow and post silicon validation phases with additional exposure to physical design signoff activities**.** **What You'll Do**  \n\nYou will be part of ASIC physical design Team which is responsible for full Chip physical implementation from RTL to GDSII. As Physical Verification Engineer your main responsibilities will include:* Perform full chip DRC/LVS/ERC/ANT checks, review and debug the issues, provide solutions and ensure signoff clean results\n* Work with block and top level implementation teams to understand physical aspects and feedback on necessary updates\n* Work closely with block and TOP level physical implementation, IP development teams and to resolve PV issues and address to proper owners\n* Deploy and improve physical verification flows and methodologies. Develop custom check as per need for verification robustness\n* Support block and TOP implementation teams to solve local PV issues\n\n **Minimum Qualifications:*** BS/MS in Electrical Engineering or Computer Science, with 7\\+ year minimum of hands\\-on experience in ASIC implementation and Physical verification\n* Prior experience in deep submicron CMOS technologies\n* Prior experience with physical verification (DRC, LVS, ERC, ANT), debug and solution\n* Prior experience in one of the scripting languages (Python, Tcl, Skill)\n\n**Preferred Qualifications:*** Tapeout Experience on 7nm nodes and below\n* Prior experience working with semiconductor foundries on installation, and maintenance of process design kits (PDKs) for SOC physical design teams\n* 7\\+ years of experience working with block or full chip physical verification and/or owning Physical Verification CAD flow development and support\n* Previous work experience working with Package and floorplan teams to define padring and bump\\-map design\n* Background in industry\\-standard physical verification EDA tools\n\n **Why Cisco**\n\\#WeAreCisco \\- We connect everything: people, processes, data, and things. We innovate everywhere, taking bold risks to shape the technologies that give us smart cities, connected cars, and handheld hospitals. And we do it in style with unique personalities who aren't afraid to change the way the world works, lives, plays and learns.  \n\nWe are thought leaders, tech geeks, pop culture aficionados, and we even have a few purple haired rock stars. We celebrate the creativity and diversity that fuels our innovation. We are dreamers and we are doers.\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 148676.0,
        "max_amount": 188257.0,
        "currency": "USD"
      },
      "date_posted": "2024-10-22",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-3ce2ba26e9f09c4b",
      "title": "Account Executive Services & Buying Programs - MO or TN - 1433465",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=3ce2ba26e9f09c4b",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Account-Executive-Services-Buying-Programs-MO-or-TN-1433465/1433465",
      "location": {
        "country": "US",
        "city": "Clayton",
        "state": "MO"
      },
      "description": "Application window expected to close 1/20/25\\.Job posting may be removed earlier if the position is filled or if a sufficient number of applications are received\n-------------------------------------------------------------------------------------------------------------------\n\n\nCandidate must be located in TN or MO**Meet the Team**\n-----------------\n\n\nAt Cisco, you'll be part of a diverse and passionate team, dedicated to making a difference and shaping the future of technology. We offer a supportive environment where innovation is celebrated, and career growth is actively encouraged. Join us in our mission to empower an inclusive future for all and be at the forefront of innovative solutions that redefine connectivity and security.\n**Your Impact**\n---------------\n\n\nYour role will combine the expertise of an Account Executive for Cisco’s Premium Services with the skill of an Account Executive for Strategic Buying Programs. As an Integrated Services and Buying Programs Account Executive, you are responsible for leading customer value realization bringing to bear services to ensure adoption and curating a value\\-driven software consumption strategy. You will focus on Professional Services, Premium Support Services (Point of Sale, Uncovered, and Renewal upsell), and Enterprise Agreements. You will understand your customers' business, success metrics, decision criteria, and create compelling solutions that align with the defined business outcomes, financial needs, and long\\-term objectives. Applying the Cisco End\\-to\\-End Selling method and Lifecycle Selling approach, you will drive incremental value for our customers and growth for Cisco.\n\n\n* Become a subject matter expert in our professional services and buying programs.\n* Collaborate and coordinate cross\\-functionally to ensure that we present ourselves as One Cisco, simplifying the customer experience and amplifying our impact.\n* Establish strong customer relationships and build credibility as a business advisor by focusing on relevant use cases for Cisco’s premium services and buying programs.\n* Cultivate relationships with ecosystem partners and develop strategies for mutual success.\n* Formulate the sales strategy for your territory, solidify your value as an advisor to our regional leadership, and lead initiatives to bridge gap to goal.\n* Lead internal and external alignment discussions, coordinating resources to accurately scope and quote opportunities, while maintaining a focus on the desired outcome.\n* Demonstrate expertise in the Cisco buying programs value proposition, including understanding cost, benefit, and risk drivers.\n* Identify customer critical metrics, quantify challenges, and build value propositions for customers (return on investment/total cost of ownership).\n* Build a robust pipeline across four rolling quarters.\n* Accurately qualify, forecast, and close opportunities.\n* Negotiate pricing and other deal terms effectively.\n* Collaborate with key stakeholders to develop business cases that drive support upsell during renewals, positioning premium offers and buying programs that enhance the customer experience.\n* Be responsible for the expansion of buying programs and ensure accurate forecasting of true forward.\n\n**Minimum Qualifications**\n--------------------------\n\n* Bachelor's degree or equivalent experience.\n* 3\\+ years experience in Services and/or Software/HW sales, with a track record of meeting or exceeding sales quotas.\n* Strong understanding of support, professional services, and enterprise software agreements.\n\n**Preferred Qualifications**\n----------------------------\n\n\nA consultative seller and strategic problem solver whose primary goal is to deliver outstanding business outcomes to your customer. You hold yourself accountable for driving new and incremental business within your customer base. You are collaborative and recognize the importance of the collective team. You are a sales professional who has shown success in the industry. You are motivated to get results and exceed sales goals. You will use your natural curiosity and compassion to establish relationships and provide the best solutions to our customers. You lead with optimism will be tenacious in the hunt and closure of sales opportunities. You have a commitment to operational excellence.\n\n\n* Ability to develop trusted relationships based on deep understanding of the customer’s perspective.\n* Ability to understand and articulate customer business outcomes and financial needs.\n* Excellent communication skills.\n* Proficiency in sales methodologies, deal construction, and negotiation.\n* Ability to work with cross\\-functional teams through influence of desired outcomes: sales teams, renewals, delivery, customer success, business entities, and partners.\n* Proficiency with SFDC and the Microsoft Office Suite.\n* Travel required, amount dependent upon location.\n\n**\\#WeAreCisco**\n----------------\n\n\\#WeAreCisco where every individual brings their unique skills and perspectives together to pursue our purpose of powering an inclusive future for all.\n\n\nOur passion is connection—we celebrate our employees’ diverse set of backgrounds and focus on unlocking potential. Cisconians often experience one company, many careers where learning and development are encouraged and supported at every stage. Our technology, tools, and culture pioneered hybrid work trends, allowing all to not only give their best, but be their best.\n\n\nWe understand our outstanding opportunity to bring communities together and at the heart of that is our people. One\\-third of Cisconians collaborate in our 30 employee resource organizations, called Inclusive Communities, to connect, foster belonging, learn to be informed allies, and make a difference. Dedicated paid time off to volunteer—80 hours each year—allows us to give back to causes we are passionate about, and nearly 86% do!\n\n\nOur purpose, driven by our people, is what makes us the worldwide leader in technology that powers the internet. Helping our customers reimagine their applications, secure their enterprise, transform their infrastructure, and meet their sustainability goals is what we do best. We ensure that every step we take is a step towards a more inclusive future for all. Take your next step and be you, with us!\n\n**@Cisco \\#CiscoJobs \\#WAreCisco**\n----------------------------------\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 115835.0,
        "max_amount": 146673.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-06",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-f2b743beef453dbe",
      "title": "Principal Engineer - SONiC Data-Plane Engineer",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=f2b743beef453dbe",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Principal-Engineer-SONiC-Data-Plane-Engineer/1432029",
      "location": {
        "country": "US",
        "city": "San Jose",
        "state": "CA"
      },
      "description": "The application window is expected to close on: 2/3/2025\\. Job posting may be removed earlier if the position is filled or if a sufficient number of applications are received. **Meet the Team**  \n\nWe are the Cisco Distributed System Engineering (DSE) group is at the forefront of developing products that power the largest networks in the world. The networking industry is going through a massive transformation to build the next generation infrastructure to meet the needs of AI/ML workloads and continuously increasing internet users and application. We are uniquely positioned to capture that market transition. This team builds products by harnessing the potential of open\\-source technologies while pushing the boundaries on Systems and Silicon Architecture. **Your Impact**  \n\nAs a Principal Engineer on our team, you are curious and a problem solver. You love to learn and grow and work in an environment that is constantly evolving. You will have the opportunity to make a significant impact on the future of AI and ML networking infrastructure. You will be at the forefront of developing innovative solutions that enhance backend network capabilities, directly supporting cutting\\-edge AI and ML developments. You'll also join an agile team engaged in the design, development and testing of the Management Plane required for the Cisco 8000 platforms. You will have the opportunity to:* Design, develop and validate:\n+ Manageability agents for Netconf, GNMI and Telemetry.\n+ Yang models for operational and configuration data on the embedded system.\n\n* Design and develop High\\-scale statistics streaming infrastructure on the embedded system that feed onbox/offbox analytics engines.\n* Develop test framework to validate embedded system manageability software modules.\n* Contribute to the Open\\-Source SONiC community.\n* Interact and communicate directly with our customers.\n* Mentoring more junior team members.\n\n**Minimum Qualifications:*** Bachelor’s in computer science or a like technical field with 15 \\+ years of relevant work experience, or a Masters with 12 \\+ years of related experience.\n* Programming experience is C, C\\+\\+ or Python.\n* Experience with Networking technologies such as data\\-plane, L2/L3, IPv4/IPv6, Overlay networks, etc.\n* Software development experience with Linux based platforms or other like network operating systems.\n* Experience working directly with stakeholders and customers to provide direct technical solutions.\n\n**Preferred Qualifications:*** Exposure to SONiC or experience working with the SONiC open\\-source community.\n* Experience working with SDKs, preferred with SAI library development for switches, NPUs or DPUs.\n* Exposure to ML and AI related technologies.\n* Strong knowledge of networking technologies including:\n+ Layer 2: VLAN, Port Channel, MCLAG.\n+ Layer 3: IPv4, IPv6, VxLAN, Tunnels.\n+ QoS: Queuing, Policers, WRED, PFC, ECN.\n+ ACL: L2, L3, Ingress, Egress, ACL based forwarding.\n\n* Ability to work collaboratively in a cross\\-functional team environment across software and silicon teams.\n\n**\\#WeAreCisco**\n\n\n\\#WeAreCisco where every individual brings their unique skills and perspectives together to pursue our purpose of powering an inclusive future for all.\n\n\nOur passion is connection—we celebrate our employees’ diverse set of backgrounds and focus on unlocking potential. Cisconians often experience one company, many careers where learning and development are encouraged and supported at every stage. Our technology, tools, and culture pioneered hybrid work trends, allowing all to not only give their best, but be their best.\n\n\nWe understand our outstanding opportunity to bring communities together and at the heart of that is our people. One\\-third of Cisconians collaborate in our 30 employee resource organizations, called Inclusive Communities, to connect, foster belonging, learn to be informed allies, and make a difference. Dedicated paid time off to volunteer—80 hours each year—allows us to give back to causes we are passionate about, and nearly 86% do!\n\n\nOur purpose, driven by our people, is what makes us the worldwide leader in technology that powers the internet. Helping our customers reimagine their applications, secure their enterprise, transform their infrastructure, and meet their sustainability goals is what we do best. We ensure that every step we take is a step towards a more inclusive future for all. Take your next step and be you, with us!\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 207660.0,
        "max_amount": 262944.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-06",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-c632bea6e5f33aac",
      "title": "Customer Success Specialists (CSS), Security",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=c632bea6e5f33aac",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Customer-Success-Specialists-CSS-Security/1431273",
      "location": {
        "country": "US",
        "city": "San Jose",
        "state": "CA"
      },
      "description": "**Application window is expected to close on 12/20/2024**\n---------------------------------------------------------\n\n**Who we are:**\n\n\nThe Customer Success Specialist (CSS) role is a critical, strategic advisor and technical expert that engages with customers to accelerate their adoption of Cisco products \\& solutions that transform their business and drive business outcomes. The role resides within the Cisco Customer Experience (CX) organization.\n\n\n**What you’ll do:**\n\n\nCSSs are subject matter experts in their aligned product or architecture. They deliver targeted engagements to increase product awareness, share best practices, and drive product consumption and business value. CSSs bring strategic vision, the latest technology from Cisco Engineering, and tactical expertise to ensure successful customer engagements. They also participate in the global CSS Community to share best practices and success stories. Combining deep technical knowledge with business acumen, CSSs provide consultative solutions to help customers realize value faster. Mastery of relationship management, account handling, and soft skills, along with a keen understanding of the competitive landscape and how Cisco's solutions are differentiated in the market, will be key to driving adoption and ensuring customers achieve accelerated business outcomes.\n\n\nThis highly technical role supports customers with adoption challenges across the security architecture, specifically with the following Solution Domains:\n\n\n+ Integrated Security Operations\n+ Cloud \\& Network Security\n+ Zero Trust Network Access\n\nExperience with integrating Cisco’s security products is essential.\n\n\n**Key Responsibilities:**\n\n\n* **Customer Engagement**: Conduct targeted consultative sessions and interactive technical presentations to increase product awareness, share best practices, and drive software adoption and business value.\n* **Technical Expertise**: Utilize deep technical knowledge, business acumen, and automation skills to provide consultative solutions and ensure successful customer engagements.\n* **Risk Management**: Identify and mitigate renewal risks, including those associated with low technical adoption, to ensure successful product integration and consistently meet customer expectations.\n* **Collaboration**: Work closely with Account teams, Customer Success, and Partners to enhance customer adoption, address product concerns, and drive growth.\n* **Product Feedback** **and Advocacy**: Provide feedback to Engineering and Product Management Teams for product improvements, promote the CX offer strategy, and highlight feature opportunities.\n* **Strategic Advice and Adoption Journey:** Guide customers on deployment decisions and long\\-term business outcomes, develop onboarding and adoption journeys, lead architectural initiatives, and address product challenges.\n\n  \n\n**Who You Are:**\n\n\n* **Technical Expert:** Possesses deep technical knowledge with a focus on connecting Cisco solutions to customer use cases, continuously learning new technologies and best practices.\n* **Customer\\-Centric Mindset:** Proactively understands customer needs and drives decisions to enhance customer value and satisfaction.\n* **Cross\\-Team Collaborator:** Works seamlessly across internal and external teams to encourage technical implementation decisions, operating effectively in both remote and face\\-to\\-face environments.\n* **Business Acumen:** Understands high\\-level business landscapes, strategic priorities, and the competitive marketplace to align technical solutions with business goals.\n* **Results Oriented:** Demonstrates proven execution ability with relevant technologies, driving successful customer outcomes.\n* **Effective Communicator:** Delivers complex information clearly and convincingly to diverse audiences, with the ability to engage both technical architects and C\\-level executives, ensuring understanding and alignment.\n\n  \n\n**Minimum Required Experience:*** 7\\+ years of experience in technical consulting or direct customer interfacing/engagement role with a deep understanding of industry best practices related to the security domain\n* Expert\\-level technical knowledge a must for:\n+ Zero Trust Network Access\n+ Secure Firewall and Cloud Security\n+ SecOps\n+ Minimum two of the following Cisco Security Suites:\n- Breach Protection Suite or\n- User Protection Suite\n- Cloud Protection Suite\n\n* Proven experience engaging with key customers, understanding their unique needs, and applying industry best practices to drive successful outcomes.\n* Delivered consultative sessions, interactive technical presentations, and collaborating on quarterly business reviews (QBRs).\n* Conducted product and solution demos to drive product adoption with a strong understanding of software licensing models and running competitive SWOT analyses.\n\n  \n\n**Desired Qualifications:**\n\n* Expert\\-level knowledge of integrating across multiple architectures.\n* Demonstrated success with complex technologies and conducting high\\-risk architecture reviews.\n* Provided strategic advice on deployment decisions, led architectural initiatives, incorporating best practices and validated designs from across Cisco to ensure successful implementation and adoption with customers.\n* Demonstrated ability to apply deep understanding of relevant Cisco products to define how technology solves Customers’ business challenges. This includes baselining customer environments, capturing heatmaps of products and tools (including third\\-party), and developing comprehensive on\\-boarding and adoption journeys.\n* Expert understanding and experience with public cloud providers such as AWS, Azure, and GCP, as well as knowledge of virtualization technologies.\n* Expertise in automation, including leveraging APIs and programmability to orchestrate workflows and integrate with existing ecosystems (e.g., ITSM, Open Source).\n* Suggested Certifications: DevNet, CCNA, CCNP, or CCDP required; CCIE, CISM, CISSP or equivalent strongly preferred.\n* Suggested Cisco Success Management certifications: Cisco Certified Success Specialist.\n* BS in Engineering, Computer Science; Masters preferred.\n\n  \n\n**Why Cisco**\n\n\n\\#WeAreCisco, where individuality and teamwork drive us to power an inclusive future. Embracing digital transformation, we innovate beyond hardware into software and security, creating intuitive networks that adapt and protect. Our culture fosters innovation, creativity, and learning from failures. We give our best, take accountability, and embrace diversity and equality. Whether you have colorful hair, tattoos, or a passion for technology and world\\-changing ideas, be yourself with us!\n\n  \n\n\n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings. Employees receive up to twelve paid holidays per calendar year, which includes one floating holiday, plus a day off for their birthday. Employees accrue up to 20 days of Paid Time Off (PTO) each year and have access to paid time away to deal with critical or emergency issues without tapping into their PTO. We offer additional paid time to volunteer and give back to the community. Employees are also able to purchase company stock through our Employee Stock Purchase Program.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings. Employees receive up to twelve paid holidays per calendar year, which includes one floating holiday, plus a day off for their birthday. Employees accrue up to 20 days of Paid Time Off (PTO) each year and have access to paid time away to deal with critical or emergency issues without tapping into their PTO. We offer additional paid time to volunteer and give back to the community. Employees are also able to purchase company stock through our Employee Stock Purchase Program.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 160596.0,
        "max_amount": 203350.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-19",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-81fa8c06cbed6d9b",
      "title": "Customer Success Manager",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=81fa8c06cbed6d9b",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Customer-Success-Manager/1433367",
      "location": {
        "country": "US",
        "city": "Minneapolis",
        "state": "MN"
      },
      "description": "**Application window is expected to close on 12/20/2025**\n---------------------------------------------------------\n\n**Ideal candidate will currently reside in Minnesota, South Dakota, Tennessee, Michigan, Illinois, Iowa or Ohio.**\n------------------------------------------------------------------------------------------------------------------\n\n**Meet the Team**\n-----------------\n\nYou will work closely with a diverse range of Customer Experience (CX) resources, including Customer Success Specialists (CSS), Renewals teams, and Partners. Your role involves partnering with Sales and Renewals teams to drive Annual Recurring Revenue (ARR) growth. This collaborative environment will enable you to leverage the expertise and support of various team members to achieve shared goals and deliver exceptional value to our customers.\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Your Impact**\n---------------\n\nAs a Customer Success Manager, you play a crucial role in helping our customers successfully adopt and use Cisco technologies, driving value realization and growth. You will be the primary point of contact for customers, guiding them through software adoption and enabling them to accomplish their business and technical goals.\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nYou are a technical professional whose sweet spot is in customer relationships and success. You are proactive and strategic, with a passion for driving software utilization to accelerate business outcomes. You excel at creating and implementing Technical Adoption Plans that lead software outcomes and optimize Return on Investment. Your ability to connect Cisco's offerings to success measures and remove adoption barriers is unmatched. You focus on driving ARR growth and work collaboratively with Renewals and Sales teams. You have a keen eye for identifying new opportunities and are dedicated to ensuring customer success and satisfaction.\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n* Acting as a technology advocate, providing feedback to Cisco’s product teams for development and enhancements, and staying current with the latest Cisco technologies, competitive landscape, and industry trends.\n* Offering expert guidance to customers, ensuring they achieve their business and technical goals with Cisco technologies.\n* Driving software utilization and value realization, leading to customer renewals and business growth.\n* Proactively handling renewal risks, demonstrating insights to increase customer retention, and facilitating workshops to review adoption progress and ensure successful onboarding.\n* Building strong relationships with customer partners to understand their challenges and objectives, and collaborating with Sales, Customer Success, Renewals, and Business Entities to identify use cases that drive value and business outcomes.\n* Advocating for the customer within Cisco, ensuring their needs are met and that they receive a high\\-quality customer experience.\n* Build and implement Technical Adoption Plans in partnership with Customer Success Specialists (CSS) that align with customer goals to maximize their technology investments and promote the full use of our technologies.\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Minimum Qualifications**\n--------------------------\n\n* 8 \\+ years working in a customer facing role in an IT company or in an Enterprise IT organization\n* Understanding of fundamental networking concepts \\- skills and knowledge to set up, manage, fix, and troubleshoot small to medium\\-level networks.\n* Experience developing software adoption plans across technology portfolio\n* Experience driving software adoption with customer executives and technical leaders\n* Experience leading cross\\-functional teams in a matrix organization\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Preferred Qualifications:**\n-----------------------------\n\n* Financial, Renewal, and/or adoption forecasting experience\n* Experience as a technology advocate\n* Proven ability to offer expert guidance to customers, helping them achieve business and technical goals\n* Experience driving software utilization and value realization (Customer renewals)\n* Proficiency in proactively managing renewal risks, demonstrating insights to increase customer retention\n* Strong relationship\\-building skills\n* Experience collaborating with teams to drive value and business outcomes.\n* Advocacy skills\n* Experience building and implementing Technical Adoption Plans\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n**\\#WeAreCisco**\n----------------\n\n\\#WeAreCisco where every individual brings their unique skills and perspectives together to pursue our purpose of powering an inclusive future for all.\n-------------------------------------------------------------------------------------------------------------------------------------------------------\n\nOur passion is connection—we celebrate our employees’ diverse set of backgrounds and focus on unlocking potential. Cisconians often experience one company, many careers where learning and development are encouraged and supported at every stage. Our technology, tools, and culture pioneered hybrid work trends, allowing all to not only give their best, but be their best.\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nWe understand our outstanding opportunity to bring communities together and at the heart of that is our people. One\\-third of Cisconians collaborate in our 30 employee resource organizations, called Inclusive Communities, to connect, foster belonging, learn to be informed allies, and make a difference. Dedicated paid time off to volunteer—80 hours each year—allows us to give back to causes we are passionate about, and nearly 86% do!\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nOur purpose, driven by our people, is what makes us the worldwide leader in technology that powers the internet. Helping our customers reimagine their applications, secure their enterprise, transform their infrastructure, and meet their sustainability goals is what we do best. We ensure that every step we take is a step towards a more inclusive future for all. Take your next step and be you, with us!\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 162789.0,
        "max_amount": 206127.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-10",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-38ab52cceb3ccdf7",
      "title": "ASIC Package Signal/Power Integrity Engineer",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=38ab52cceb3ccdf7",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/ASIC-Package-Signal-Power-Integrity-Engineer/1432869",
      "location": {
        "country": "US",
        "city": "San Jose",
        "state": "CA"
      },
      "description": "The application window is expected to close on: 01/05/2025\\.  \n\nJob posting may be removed earlier if the position is filled or if a sufficient number of applications are received.  \n\nMeet the Team  \n\nCisco Silicon One is a business organization with a long track record of building complex and high\\-performance Silicon ASICs. Our silicon devices drive the world’s most complex networks and carry over 90% of IP traffic. We are a highly specialized ASIC team with experts in all aspects of advanced IC package design and heterogeneous system integration. Our substrates use the latest 2\\.5D fanout technologies for large\\-scale integration, using the latest signaling and data transfer technologies.  \n\nYour Impact  \n\nCisco SiliconOne ASIC team is looking for an expert in Signal and Power Integrity to help us develop our next generation ASIC packaging. You will work on cutting\\-edge FCBGA substrates that push the boundaries on power, speed, and fabrication / assembly technology. You will drive ASIC package power and signal integrity rules and layout analysis to enable on\\-time, high\\-quality manufacturing releases. You will actively implement the latest SERDES speeds and technologies while developing creative solutions for these signaling and power distribution challenges.* Develop design rules for ultra\\-high speed signaling\n* Analyze substrate SI/PI and provide feedback for layout\n* Collaborate with the layout team to develop the best overall solution\n* Collaborate with system partners to achieve the best combined power and signal integrity across the interposer, substate, and PCB.\n* Document design rules and post layout extraction results\n\n  \n\nMinimum Qualifications:* Bachelor’s degree in electrical engineering or related field\n* 7\\+ years of experience in Signal and/or Power Integrity\n* Strong background in Electromagnetics\n* Good understanding of scattering and impedance network parameters\n* Proficient in Ansys EM flow\n* Proficient with Cadence APD for layout review\n* Fluent in Keysight ADS\n* Working knowledge of SPICE\n\n  \n\nPreferred Qualifications:  \n\n* Master’s degree in electrical engineering or related field\n* Experience with MATLAB or Python scripting\n* Experience with SI/PI of 2\\.5D advanced ASIC packaging\n* Experience with Raptor\\-X\n* Working knowledge of Vector Network Analysis\n* Basic knowledge of IBIS\n\n  \n\n  \n\n\\#WeAreCisco  \n\n\\#WeAreCisco where every individual brings their unique skills and perspectives together to pursue our purpose of powering an inclusive future for all.  \n\nOur passion is connection—we celebrate our employees’ diverse set of backgrounds and focus on unlocking potential. Cisconians often experience one company, many careers where learning and development are encouraged and supported at every stage. Our technology, tools, and culture pioneered hybrid work trends, allowing all to not only give their best, but be their best.  \n\nWe understand our outstanding opportunity to bring communities together and at the heart of that is our people. One\\-third of Cisconians collaborate in our 30 employee resource organizations, called Inclusive Communities, to connect, foster belonging, learn to be informed allies, and make a difference. Dedicated paid time off to volunteer—80 hours each year—allows us to give back to causes we are passionate about, and nearly 86% do!  \n\nOur purpose, driven by our people, is what makes us the worldwide leader in technology that powers the internet. Helping our customers reimagine their applications, secure their enterprise, transform their infrastructure, and meet their sustainability goals is what we do best. We ensure that every step we take is a step towards a more inclusive future for all. Take your next step and be you, with us!\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 155623.0,
        "max_amount": 197054.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-06",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-1c4d60904a6ec920",
      "title": "Optics Reliability Engineer",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=1c4d60904a6ec920",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Optics-Reliability-Engineer/1433463",
      "location": {
        "country": "US",
        "city": "Carlsbad",
        "state": "CA"
      },
      "description": "The application window is expected to close on: January 21, 2025\\.\n\nJob posting may be removed earlier if the position is filled or if a sufficient number of applications are received.\n\nThis role is based out of Carlsbad, CA, and requires being on site 10\\+ days/month.\n**Meet the Team**  \n\nWe are Cisco’s optics engineering product development team, developing world\\-class, leading\\-edge, silicon\\-photonics based optical transceiver products. You will be part of a growing team primarily involved in the characterization, validation, and reliability of current and next generation transceivers implemented in industry standard modules and custom integrated/on\\-board optics.\n**Your Impact*** Develop, schedule/coordinate, and execute product\\-level / optical transceiver module reliability test plans for optical transceiver modules, chip/chipsets, optical subcomponents including environmental stress, mechanical integrity, and regulatory testing.\n* Collaborate with production/operations teams to develop test plans to support 2nd source material qualifications, PCN qualifications, Factory qualifications, Process qualifications, and ORT (Ongoing Reliability Test).\n* Oversee reliability lab \\- operating, ensure safety compliance, schedule jobs with other teams, allocate chambers.\n* Qualify and coordinate testing with outside test services.\n* Perform data analysis, write detailed reports, develop tools for automating these tasks.\n* Involvement and coordination of debug, failure analysis activities.\n* Represent Common Optics Group (COG) organization in front of customer to present approach, plans, review reports, address issues/questions, etc.\n* Collaborate on development/design of tests, test methods, hardware, test setups, test automation for reliability qualification testing purposes.\n**Minimum Qualifications:*** Bachelor’s degree in Electronics Engineering, Physics, or Material Science or related degree and 8\\+ years of experience in the development and validation of high\\-speed optical transceiver modules (or optics) and components.\n* Experience in device physics and circuit operations.\n* Experience with optical integration and packaging technologies.\n* Experience with data processing and statistical analysis.\n**Preferred Qualifications:*** Master’s degree in Electronics Engineering, Physics, or Material Science or related degree and 6\\+ years of experience in the development and validation of high\\-speed optical transceiver modules (or optics) and components.\n* Experience with silicon photonics.\n* Experience with test / characterization automation development.\n* Experience with post\\-silicon validation / DVT including in high\\-speed test, SERDES, PLL, CDR, TX/RX analog front\\-end characterization, optical circuits (Drivers, modulators, TIAs, PDs, Lasers, GCs, Mux/Demux, FAUs).\n* Lab and measurement experience, including with related lab instruments such as high\\-speed oscilloscope, analyzers, etc.\n* Programming experience using Python.\n* Demonstrated ability in analytical thinking, problem\\-solving, and debugging.\n* Proven skills in teamwork, communication, and organization.\n* Program management experience.\n**\\#WeAreCisco**  \n\n\\#WeAreCisco where every individual brings their unique skills and perspectives together to pursue our purpose of powering an inclusive future for all.\n\nOur passion is connection—we celebrate our employees’ diverse set of backgrounds and focus on unlocking potential. Cisconians often experience one company, many careers where learning and development are encouraged and supported at every stage. Our technology, tools, and culture pioneered hybrid work trends, allowing all to not only give their best, but be their best.\nWe understand our outstanding opportunity to bring communities together and at the heart of that is our people. One\\-third of Cisconians collaborate in our 30 employee resource organizations, called Inclusive Communities, to connect, foster belonging, learn to be informed allies, and make a difference. Dedicated paid time off to volunteer—80 hours each year—allows us to give back to causes we are passionate about, and nearly 86% do!\n\nOur purpose, driven by our people, is what makes us the worldwide leader in technology that powers the internet. Helping our customers reimagine their applications, secure their enterprise, transform their infrastructure, and meet their sustainability goals is what we do best. We ensure that every step we take is a step towards a more inclusive future for all. Take your next step and be you, with us!\n\n\\#LI\\-LM4\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 135854.0,
        "max_amount": 172021.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-20",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-d1f097bc62e1e233",
      "title": "Solutions Engineer - Irvine, CA Area",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=d1f097bc62e1e233",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Solutions-Engineer-Irvine-CA-Area/1432634",
      "location": {
        "country": "US",
        "city": "Irvine",
        "state": "CA"
      },
      "description": "Posting will be posted until 1/5/25\\. Successful candidate must live or plan to relocate within the Irvine, CA area.\n--------------------------------------------------------------------------------------------------------------------\n\n**What You'll Do**\n------------------\n\nWe are looking for a passionate technologist for this Cisco Solutions Engineer role, covering US Commercial customers in the Irvine, CA area. This role covers various verticals and the full scope of Cisco’s technology portfolio. As the technical lead on the portfolio team, you will be responsible for approximately 20 accounts. You will be paired with a sales counterpart, working hand in hand to drive strategic outcomes for your accounts. While you will represent the entire cisco portfolio, you will be aligned with technical specialists in each Architecture. This is a highly motivated team, with a track record of success and a strong team culture of support and fun!\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n+ Be a trusted advisor and influence businesses in a key market for Cisco\n+ Use Cisco’s extensive portfolio to solve customer business challenges\n+ Be a technical consultant to our customers, helping them think past status quo and driving towards positive business outcomes\n+ Deliver technical presentations, deliverables, and demos on cisco solutions\n+ Collaborate with customers to build Architecture Roadmaps that will influence the long\\-term direction for your customers\n+ Partner with your Account Manager and Specialists to drive customer outcomes\n+ Learn new technologies and continuously build your skillset\n**Who You Are**\n---------------\n\n+ 2\\+ years of experience in one or more of our key technical pillars: Enterprise Networks, Data Center \\& Cloud, Collaboration, Artificial Intelligence, and Security.\n+ You thrive on architecting solutions that resolve real world business problems.\n+ You love competing and stay plugged into the industry learning new technologies\n+ You are willing to be in the field, in\\-person with the team, partners, and customers (usually within driving distance) to customer sites 50% of the time\n+ Bring a confidence to presenting and commanding the room\n+ Are a collaborative, positive team player\n+ Excellent written and oral presentation skills.\n+ Network Automation skills desired\n+ CCNP desired\n**Our minimum requirements for this role:**\n-------------------------------------------\n\n+ 2\\+ years of presales customer\\-facing experience in relevant technologies or 4\\+ years in industry and deep technical expertise\n+ Cisco Certification and/or industry certifications required CCNA certification or equivalent (eg. Cloud Provider certification)\n**Our preferred qualifications for this role:**\n-----------------------------------------------\n\n+ Previous Cisco experience preferred\n+ Bachelor's degree preferred\n\n\nWhy Cisco?\n\\#WeAreCisco. We are all unique, but collectively we bring our talents to work as a team, to develop innovative technology and power a more inclusive, digital future for everyone. How do we do it? Well, for starters – with people like you!\n\n\nNearly every internet connection around the world touches Cisco. We’re the Internet’s optimists. Our technology makes sure the data traveling at light speed across connections does so securely, yet it’s not what we make but what we make happen which marks us out. We’re helping those who work in the health service to connect with patients and each other; schools, colleges, and universities to teach in even the most challenging of times. We’re helping businesses of all shapes and sizes to connect with their employees and customers in new ways, providing people with access to the digital skills they need and connecting the most remote parts of the world – whether through 5G, or otherwise.\n\n\nWe tackle whatever challenges come our way. We have each other’s backs, we recognize our accomplishments, and we grow together. We celebrate and support one another – from big and small things in life to big career moments. And giving back is in our DNA (we get 10 days off each year to do just that).\n\n\nWe know that powering an inclusive future starts with us. Because without diversity and a dedication to equality, there is no moving forward. Our 30 Inclusive Communities, that bring people together around commonalities or passions, are leading the way. Together we’re committed to learning, listening, caring for our communities, whilst supporting the most vulnerable with a collective effort to make this world a better place either with technology, or through our actions.\n\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! \\#WeAreCisco\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 134091.0,
        "max_amount": 169789.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-16",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-9c02da75f3d187bd",
      "title": "Business Analyst, Security Capacity Planning",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=9c02da75f3d187bd",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Business-Analyst-Security-Capacity-Planning/1430904",
      "location": {
        "country": "US",
        "city": "Phoenix",
        "state": "AZ"
      },
      "description": "The application window is expected to close on January 16, 2025\\.\n  \n\n  \n\n**Who We Are**\n\n\nCapacity Planning (CCP) is the central planning function within Platform organization focusing on forecasting, capacity planning, and HW planning for all Platform services including Cloud and Platform operated internal data centers. The function closely partners with Engineering, Finance, Supply Chain, Data Centers and Deployment organizations to plan capacity. Compute Forecasting and Planning team is chartered with building an accurate, and affordable plan for rolling 12\\-month horizon to help scale Compute products and services.\n\n**What You’ll Do**\n\n\nAs a Business Analyst, you will be an integral part of the team that owns the demand and capacity planning process within Cisco Security. In this role, you will:\n\n* Analyze current capacity levels and utilization across various products and services.\n* Forecast future capacity requirements based on historical data, market trends, and business growth projections.\n* Develop models and scenarios to predict capacity needs and identify potential bottlenecks.\n* Identify opportunities for improving efficiency and reducing costs.\n* Collaborate with department heads to develop long\\-term capacity planning strategies.\n* May deliver presentations and training courses including measurement analysis, improvement, and control.\n* Communicates team progress. Performs cost and benefit analyses.\n\n**Minimum Requirements**\n\n* Bachelor’s Degree \\+ 7 years or industry experience or Master’s Degree \\+ 4 years of industry or equivalent experience, to include experience within an engineering organization\n* 4 years of experience using service management tools such as Jira, ServiceNow or Atlassian\n* 4 years or experience with Excel for capacity and/or resource planning\n\n**Preferred Qualifications:**\n\n* Experience in data center deployment and infrastructure procurement\n* Experience in data visualization using Tableau, Looker, Power BI, or equivalent platforms.\n* Proactive and results\\-oriented, with strong prioritization skills\n* Experience in analytics automation and dashboarding.\n* Experience working on large data projects\n\n**Why Cisco?**\n\n\n\\#WeAreCisco. We are all unique, but collectively we bring our talents to work as a team, to develop innovative technology and power a more inclusive, digital future for everyone. How do we do it? Well, for starters – with people like you!\n\n\nNearly every internet connection around the world touches Cisco. We’re the Internet’s optimists. Our technology makes sure the data traveling at light speed across connections does so securely, yet it’s not what we make but what we make happen which marks us out. We’re helping those who work in the health service to connect with patients and each other; schools, colleges, and universities to teach in even the most challenging of times. We’re helping businesses of all shapes and sizes to connect with their employees and customers in new ways, providing people with access to the digital skills they need and connecting the most remote parts of the world – whether through 5G, or otherwise.\n\n\nWe tackle whatever challenges come our way. We have each other’s backs, we recognize our accomplishments, and we grow together. We celebrate and support one another – from big and small things in life to big career moments. And giving back is in our DNA (we get 10 days off each year to do just that).\n\n\nWe know that powering an inclusive future starts with us. Because without diversity and a dedication to equality, there is no moving forward. Our 30 Inclusive Communities, that bring people together around commonalities or passions, are leading the way. Together we’re committed to learning, listening, caring for our communities, whilst supporting the most vulnerable with a collective effort to make this world a better place either with technology, or through our actions.\n\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! \\#WeAreCisco\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 131718.0,
        "max_amount": 166784.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-02",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-9e8051800569b23f",
      "title": "Technical Marketing Engineer",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=9e8051800569b23f",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Technical-Marketing-Engineer/1428987",
      "location": {
        "country": "US",
        "city": "San Jose",
        "state": "CA"
      },
      "description": "Application deadline has been extended and now to close on Nov 12, 2024\\. **Who We Are:**\n\nThe Cisco UCS Performance team optimizes and benchmarks the performance of UCS products, including B\\-Series and C\\-Series servers, Fabric Interconnects, and UCS Manager.\n\n\nThe Cisco UCS Performance TME team is looking for a highly motivated and dedicated technical marketing engineer (TME) to define, validate and drive Network (VIC/Fabric) performance on Cisco UCS and Nutanix HCI platforms.\n\n **What You’ll Do:**\n\nThe Cisco UCS Compute BU is looking for a subject matter expert, Technical Marketing Engineer (TME) for Network performance on Cisco UCS platforms and help resolve issues faced by customers. The right candidate will have an opportunity to validate Network/Fabric performance on various Cisco platforms.\n\n\nThe technologies you would be exposed but not limited to are the following:\n\n* **Compute:** Cisco UCS B\\-Series and C\\-Series servers, Intersight and UCS Manager.\n* **Networking:** Fabric Interconnects, Nexus 9k, Catalyst \\& MDS switches.\n* **Virtualization:** VMware vSphere, Microsoft Hyper\\-V, KVM.\n* **Storage Systems:** SAN, NAS, FCoE, iSCSI performance.\n\n**Role also includes the following:**\n\n* Extensive experience in leading Cisco VICs (Virtual Interface card), UCS systems, 3rd party network adapters and advanced networking protocols.\n* Independently lead and drive the end\\-to\\-end Technical Marketing efforts of UCS Networking including Smart NIC, the path breaking VIC and Fabric Interconnect technologies.\n* Optimize network performance for AI\\-centric use cases, including low\\-latency data transfer, high bandwidth needs, and efficient prioritization.\n* Optimize UCS platforms to support high\\-performance AI/ML training and inference workloads.\n* Responsible for crafting performance measurements, testing and analyzing results, and developing technical marketing collateral such as white papers, best practice guides, and technical presentations\n* You will play a pivotal role in making the UCS networking product and its technology stand out in the compute market.\n* Technical advisor for the product and its current and future capabilities, through innovation and problem\\-solving.\n  \n\n  \n\n**Who You Are:**\n\n\nThe ideal candidate must be a self\\-starter and a team player with experience in compute, network, and storage. They should be flexible, enthusiastic, and capable of learning new products and technologies. Experience working with compute and datacenter networking products is essential, along with a good understanding of how to craft enterprise datacenter fabrics. The candidate should have the ability to set and meet deadlines, possess excellent troubleshooting and problem\\-solving skills, and demonstrate good communication skills. Additionally, they should have experience in crafting standard process guides and technical white papers.\n\n **Minimum Qualifications:**\n\n* Bachelors with 7\\+ years of experience in Compute, Networking background.\n* Experience working on Ethernet, Fiber Channel, FCoE, iSCSI protocols, and virtual networking technologies in the datacenter environment.\n* Experience configuring SR\\-IOV, QoS, VLANs, and advanced networking protocols in data center environments.\n* Experience working with compute and data center networking products.\n* Experience with Cisco Nexus switches, and network automation tools.\n  \n\n  \n\n**Preferred Qualifications:**\n\n* In\\-depth knowledge of Cisco UCS systems, Fabric interconnects, and VIC adapters.\n* Deep understanding of the networking architecture within Cisco UCS environments, along with hands\\-on experience in tuning the performance of Cisco Virtual Interface Cards (VICs) and fabric interconnects.\n* Cisco Certified Network Professional (CCNP) in Datacenter or Routing \\& Switching.\n* Good understanding of AI/ML frameworks.\n* Meticulous and curious to know how things work at their most atomic level\n* Experienced working with people and groups within an organization (engineering, customers, support organization, sales) to remove roadblocks and deliver against your vision with measurable results.\n* Excellent communication and collaboration skills, with the ability to work effectively with cross\\-functional teams.\n  \n\n  \n\n**Why Cisco?**\n\n\\#WeAreCisco. We are all unique, but collectively we bring our talents to work as a team, to develop innovative technology and power a more inclusive, digital future for everyone. How do we do it? Well, for starters – with people like you!\n\n\nNearly every internet connection around the world touches Cisco. We’re the Internet’s optimists. Our technology makes sure the data traveling at light speed across connections does so securely, yet it’s not what we make but what we make happen which marks us out. We’re helping those who work in the health service to connect with patients and each other; schools, colleges, and universities to teach in even the most challenging of times. We’re helping businesses of all shapes and sizes to connect with their employees and customers in new ways, providing people with access to the digital skills they need and connecting the most remote parts of the world – whether through 5G, or otherwise.\n\n\nWe tackle whatever challenges come our way. We have each other’s backs, we recognize our accomplishments, and we grow together. We celebrate and support one another – from big and small things in life to big career moments. And giving back is in our DNA (we get 10 days off each year to do just that).\n\n\nWe know that powering an inclusive future starts with us. Because without diversity and a dedication to equality, there is no moving forward. Our 30 Inclusive Communities, that bring people together around commonalities or passions, are leading the way. Together we’re committed to learning, listening, caring for our communities, whilst supporting the most vulnerable with a collective effort to make this world a better place either with technology, or through our actions.\n\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! \\#WeAreCisco\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 162792.0,
        "max_amount": 206131.0,
        "currency": "USD"
      },
      "date_posted": "2024-10-04",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-c8115b7c1306822f",
      "title": "Principal Hardware Engineer",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=c8115b7c1306822f",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Principal-Hardware-Engineer/1427767",
      "location": {
        "country": "US",
        "city": "Milpitas",
        "state": "CA"
      },
      "description": "**Who We Are**\n--------------\n\n  \n\nJoin our new and critically important team inside Cisco's Common Hardware Group (CHG). Dedicated to supporting hyperscale products and customers, this team collaborates with customers, the field, and various departments such as hardware design, silicon engineering, manufacturing, and quality functions to ensure the successful mass deployment, operation, and quality of Cisco's hyperscale products.**Who You'll Work With**\n------------------------\n\n  \n\nYou will work with other senior technical talent composed of the brightest problem solvers and innovators in the Common Hardware Group. Located in San Jose, the team is responsible for driving the highest standards of performance, quality, and continuous improvement to current and next\\-generation hyperscale products.\n\n**Who You Are**\n---------------\n\n  \n\n* You are a self\\-starter passionate about learning technologies and solving and debugging complex hardware systems.\n* Your good interpersonal skills, critical thinking, problem\\-solving capabilities, and ability to stay focused while working under pressure make you an outstanding fit for our team.\n\n**What You'll Do**\n------------------\n\n  \n\n* Apply your extensive knowledge of hardware technology, product design, architecture, and implementation to diagnose complex issues that Hyperscale customer’s encounter.\n* Exercise a wide range of influence in developing, qualification, manufacturing, and deploying complex products for the Hyperscale market, ensuring they optimally support customer needs.\n* Drive multi\\-functional initiatives with ASIC teams, hardware teams, vendors, and manufacturers; work with quality assurance teams to implement standard hardware validation and testing processes.\n* Provide technical leadership by clearly communicating and conveying technical concepts to internal and/or external forums, including executives and demanding customers.\n  \n\n  \n\n**Minimum Qualifications:**\n---------------------------\n\n  \n\n* Bachelor's degree in Electrical Engineering or Computer Engineering with 15\\+ years of related work experience.\n* Experience in hardware design and problem solving.\n* Experience with reliability engineering and failure analysis for large\\-scale deployments.\n* Experience in several of the following areas: power systems, networking systems, ASIC/Silicon, and high\\-speed signal integrity.\n* Experience in driving multi\\-functional technology initiatives and presenting work to customers and executives.\n  \n\n  \n\n**Preferred Qualifications:**\n-----------------------------\n\n  \n\n* Master's degree in Electrical or Computer Engineering or a relevant degree and 12\\+ years of related work experience.\n* Experience articulating and conveying technical concepts and architectures in various internal and/or external forums, including with demanding customers/problem resolution.\n* Familiarity with hyperscale data center architectures and requirements.\n* Proficiency in developing test automation.\n  \n\n  \n\n**Why Cisco?**\n\n\\#WeAreCisco. We are all unique, but collectively we bring our talents to work as a team, to develop innovative technology and power a more inclusive, digital future for everyone. How do we do it? Well, for starters – with people like you!\n\n\nNearly every internet connection around the world touches Cisco. We’re the Internet’s optimists. Our technology makes sure the data traveling at light speed across connections does so securely, yet it’s not what we make but what we make happen which marks us out. We’re helping those who work in the health service to connect with patients and each other; schools, colleges, and universities to teach in even the most challenging of times. We’re helping businesses of all shapes and sizes to connect with their employees and customers in new ways, providing people with access to the digital skills they need and connecting the most remote parts of the world – whether through 5G, or otherwise.\n\n\nWe tackle whatever challenges come our way. We have each other’s backs, we recognize our accomplishments, and we grow together. We celebrate and support one another – from big and small things in life to big career moments. And giving back is in our DNA (we get 10 days off each year to do just that).\n\n\nWe know that powering an inclusive future starts with us. Because without diversity and a dedication to equality, there is no moving forward. Our 30 Inclusive Communities, that bring people together around commonalities or passions, are leading the way. Together we’re committed to learning, listening, caring for our communities, whilst supporting the most vulnerable with a collective effort to make this world a better place either with technology, or through our actions.\n\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! \\#WeAreCisco\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 177089.0,
        "max_amount": 224235.0,
        "currency": "USD"
      },
      "date_posted": "2024-11-27",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-4c71b6186c3c8187",
      "title": "Senior Software Engineering Technical Leader",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=4c71b6186c3c8187",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Senior-Software-Engineering-Technical-Leader/1426995",
      "location": {
        "country": "US",
        "city": "San Jose",
        "state": "CA"
      },
      "description": "**Application window is expected to close on 09/30/2024****What You’ll Do**\n\n\nAs a software engineering technical leader, you will be a key member of a team of skilled engineers crafting, maintaining and supporting embedded chassis management software for Cisco’s Unified Computing System (UCS) family of products. Cisco UCS brings together compute, networking, and storage, all in a single system to power your applications.\n\n\nhttps://www.cisco.com/site/us/en/products/computing/servers\\-unified\\-computing\\-systems/index.html\n\n**Who You’ll Work With**\n\n\nYou’ll be working in the UCS Chassis Management Controller team responsible for all aspects of chassis management and working with all the other software teams that collectively deliver the entire UCS architecture. We work closely with many other teams within Cisco to deliver our industry leading products at high quality and on schedule.\n\n**Who You Are**\n\n\nIdeally you will have prior experience developing application and low\\-level software that runs inside a Chassis Management Controller or Baseboard Management Controller (CMC or BMC). Broad experience with embedded systems is crucial for success in this role. You must be capable and willing to learn.\n\n\nWe are seeking candidates experienced in system\\-level and low\\-level device programming. Candidates must have strong C programming skills and experience developing software that runs in an embedded Linux environment.\n\n\nWe are seeking candidates with the ability to:\n\n* Lead feature development from early technical design through completion\n* Develop, review, integrate, test and debug code across the entire embedded software stack\n* Drive architectural decisions with emphasis on reliability and security\n* Create software requirements specifications, architecture, and design documents\n* Work with cross\\-functional teams across different locations to coordinate project scope and develop and maintain products\n* Contribute improvements to our software and our software development processes\n\n**Our Minimum Qualifications for this role:**\n\n* 12\\+ years of C programming experience or equivalent experience.\n* 12\\+ years of Linux embedded software development experience or equivalent experience.\n* Linux Networking knowledge.\n\n**Our Preferred Qualifications for this role:**\n\n* Chassis power and/or thermal management experience.\n* Prior Linux kernel and/or driver experience.\n* Prior CMC/BMB experience.\n* Experience with Redfish, IPMI and/or SNMP.\n* Socket\\-based programming experience.\n* Bash scripting experience.\n* Ability to read schematics is a plus. Dedication to quality and attention to detail.\n* Prior people management experience.\n\n**Why Cisco?**\n\n\n\\#WeAreCisco. We are all unique, but collectively we bring our talents to work as a team, to develop innovative technology and power a more inclusive, digital future for everyone. How do we do it? Well, for starters \\- with people like you!\n\n\nNearly every internet connection around the world touches Cisco. We're the Internet's optimists. Our technology makes sure the data traveling at light speed across connections does so securely, yet it's not what we make but what we make happen which marks us out. We're helping those who work in the health service to connect with patients and each other; schools, colleges, and universities to teach in even the most difficult of times. We're helping businesses of all shapes and sizes to connect with their employees and customers in new ways, providing people with access to the digital skills they need and connecting the most remote parts of the world \\- whether through 5G, or otherwise.\n\n\nWe tackle whatever challenges come our way. We have each other's backs, we recognize our accomplishments, and we grow together. We celebrate and support one another \\- from big and small things in life to big career moments. And giving back is in our DNA (we get 10 days off each year to do just that).\n\n\nWe know that powering an inclusive future starts with us. Because without diversity and a dedication to equality, there is no moving forward. Our 30 Inclusive Communities, that bring people together around commonalities or passions, are leading the way. Together we're committed to learning, listening, caring for our communities, whilst supporting the most vulnerable with a collective effort to make this world a better place either with technology, or through our actions.\n\n\nSo, you have colorful hair? Don't care. Tattoos? Show off your ink. Like polka dots? That's cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!\n\n**\\#WeAreCisco**\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 170910.0,
        "max_amount": 216410.0,
        "currency": "USD"
      },
      "date_posted": "2024-09-10",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-f73b20a6fb25d3a7",
      "title": "Senior Corporate Counsel: US Public Sector (SLED)",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=f73b20a6fb25d3a7",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Senior-Corporate-Counsel-US-Public-Sector-SLED/1434199",
      "location": {
        "country": "US",
        "city": "Washington",
        "state": "DC"
      },
      "description": "**The application window has been extended and is expected to close: 1/10/2025** **Job posting may be removed earlier if the position is filled or if a sufficient number of applications are received.**\n\n  \n\n**This is a remote position.**\n\n**Meet the Team**\n=================\n\n  \n\nWe have an exciting opportunity for an experienced transactional lawyer to join the Public Sector Legal Sales team, as part of Americas Legal Sales operation. You would be part of a dynamic in\\-house legal department that is using technology to transform both its own legal department and how the law is practiced around the world. Our legal department works in a fast\\-paced environment, with a passion to drive Cisco’s business and enable our customers’ digital transformation.\n\n**Your Impact**\n===============\n\n  \n\nIn this role, you will deliver excellent legal support to Public Sector \\- a $7B\\+/year sales organization. You will support the public sector sales, ensuring alignment between the business and Legal. Your role will involve supporting deals, resolving critical issues, negotiating with sometimes complicated customers. You will be accountable for overall quality of your Legal work product and ensuring the needs of the business are appropriately balanced against the risk to Cisco.  \n\n\n\n  \n\nYou will also:\n\n  \n\n* Build strong internal and external relationships while balancing the needs in Cisco's Public Sector sales theater with Cisco's global strategy and priorities;\n* Provide deep knowledge of relevant aspects of federal, state and local, U.S. laws concerning government contracting, data privacy/governance, and cybersecurity;\n* Negotiate outbound product, software license, sales channel and strategic alliance sales, cloud service, system integrator contracts;\n* Anticipate changes to relevant laws impacting Cisco's public sector activities and its customers;\n* Support the shaping of sophisticated transactions, including developing strategic relationships;\n* Provide improvement of standard form agreements, playbooks, contract templates, and legal processes;\n* Effectively advise and educate on and assist in the enforcement of Cisco's policies and compliance programs;\n* Implement pivotal projects that advance Cisco's business including Cisco's priorities and initiatives.\n  \n\n  \n\n**Minimum Qualifications for this role:**\n=========================================\n\n  \n\n* Bar admission in any jurisdiction with good standing with a minimum of 8\\+ years of proven experience with in depth knowledge of state and local procurement and contract law.\n* Strong familiarity with the operational, legal and business issues presented by selling product, software, services and SaaS contracting contexts.\nKnowledge of intellectual property, anti\\-corruption, privacy and data protection law and an understanding of \\- and experience applying * \\- revenue recognition and other financial principles common to an US\\-based publicly traded company.\n* Proven ability to communicate, negotiate, and draft complex agreements to a specific goal with minimal direction. Creative mentality with the ability to use design thinking and other tools to innovate and problem solve.\n* Practical experience in RFP review, issue spotting and responses; drafting and negotiating a variety of legal documents associated with doing business in a commercial market including product sales and services contracts (direct and reseller), data privacy agreements, data security agreements.\n  \n\n  \n\n**Preferred Qualifications:**\n=============================\n\n  \n\n* Excellent business judgment, advocating for acceptable legal risk to enable business outcomes and in knowing when and how to escalate issues to the appropriate level and propose solutions.\n* Ability to operate optimally in a team environment and pursue common goals. Commitment to deliver exceptional customer service to internal clients and external customers, including anticipating and responding to customer/client requirements promptly and consistently meeting commitments and deadlines.\n* Strong leadership skills, wanting to supply to a team culture focused on shared success.\n* Proven ability to be a change agent and readily embrace new and innovative approaches.\n* CIPP/E certification is a plus.\n  \n\n  \n\n**\\#WeAreCisco**\n================\n\n  \n\n\\#WeAreCisco where every individual brings their unique skills and perspectives together to pursue our purpose of powering an inclusive future for all.  \n\n\n\n  \n\nOur passion is connection—we celebrate our employees’ diverse set of backgrounds and focus on unlocking potential. Cisconians often experience one company, many careers where learning and development are encouraged and supported at every stage. Our technology, tools, and culture pioneered hybrid work trends, allowing all to not only give their best, but be their best.  \n\n\n\n  \n\nWe understand our outstanding opportunity to bring communities together and at the heart of that is our people. One\\-third of Cisconians collaborate in our 30 employee resource organizations, called Inclusive Communities, to connect, foster belonging, learn to be informed allies, and make a difference. Dedicated paid time off to volunteer—80 hours each year—allows us to give back to causes we are passionate about, and nearly 86% do!  \n\n\n\n  \n\nOur purpose, driven by our people, is what makes us the worldwide leader in technology that powers the internet. Helping our customers reimagine their applications, secure their enterprise, transform their infrastructure, and meet their sustainability goals is what we do best. We ensure that every step we take is a step towards a more inclusive future for all. Take your next step and be you, with us!\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 218583.0,
        "max_amount": 276775.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-23",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-799f4637fc8b1706",
      "title": "Software Developer",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=799f4637fc8b1706",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Software-Developer/1431522",
      "location": {
        "country": "US",
        "city": "San Jose",
        "state": "CA"
      },
      "description": "**Application window is expected to close on 01/17/24**\n-------------------------------------------------------\n\n\nThe successful applicant will provide ownership of and be performing work in FedRAMP or IL\\-5 type environments, and therefore, must be a U.S. Person (i.e. U.S. citizen, U.S. national, lawful permanent resident, asylee, or refugee). This position may also perform work that the U.S. government has specified can only be performed by a U.S. citizen on U.S. soil.\n**What You'll Do**\n------------------\n\n\nYou will be part of Cisco Identity team. We provide the best common identity platform experience to our world\\-class customers using cisco products across Networking, Security and Collaboration. You will work on state\\-of\\-the\\-art microservices based cloud software in a dynamic and agile environment. You will develop multi\\-threaded Java server side software and deploy with Docker\\-based microservices in Kubernetes environment. You'll develop software that will utilize popular data management infrastructure like Postgres, Apache Cassandra, Redis, Kafka, Elasticsearch in multi\\-cloud environments. You'll participate in the entire product life cycle including: requirement analysis, architecture design, code implementation, functional and performance testing, deployment and support. Working with a small scrum team, you'll utilize agile development practices.\n\n**Who You'll Work With**\n------------------------\n\n\nYou'll be collaborating with a team of experienced and dedicated Java server\\-side developers and cloud/web technology architects from around the world. The team is a unique mix of engineers/architects from a promising cloud\\-based start\\-up acquired by Cisco and seasoned engineers that worked in Cisco cloud software for years.\n\n**Who You Are**\n---------------\n\n\nYou thrive in a fast\\-paced, dynamic environment that requires a rare blend of innovation, risk taking and speed of execution. You're an entrepreneurial problem solver as well as collaborator. You're passionate about contributing to a larger picture. You're able to prioritize among multiple projects. An exemplary communicator and standout colleague, you strive for self\\-improvement.\n\n* Develop scalable, secure solutions that meet high standards of quality and efficiency.\n* Collaborate closely with designers and product managers to deliver impactful production experiences.\n* Participate in on\\-call rotation to promptly address customer issues and deliver technical support.\n* Contribute to process improvement initiatives to enhance team efficiency and software quality.\n* Actively contribute to design reviews, code reviews and other technical discussions.\n\n**Minimum Qualifications:**\n---------------------------\n\n* BS or MS in Computer Science or related field\n* 2\\+ years of proven server\\-side software development experience with Java.\n* Familiar with Java spring and/or spring boot framework\n* Working knowledge of REST, JSON \\& HTTP Web Service Programming\n\n**Preferred Qualifications:**\n-----------------------------\n\n* Experience with Postgres RDS, Cassandra, Apache Kafka, Redis, or Apache tomcat\n* Experience with AWS services such as RDS, S3, CloudFront and/or Elastic Cache with Redis\n* Knowledge about Identity Management (SCIM), Authentication / Authorization (OAuth2\\), OpenID\\-Connect is a plus\n* Have experience with Maven, GIT, CI/CD pipeline, REST API, Agile development methodologies\n* Proficiency in multi\\-threading programming with Java\n* Experience with front\\-end frameworks and libraries like Angular, React\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 134070.0,
        "max_amount": 169763.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-09",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-768fcf4f3e66caae",
      "title": "Senior Software Engineer-Management Plane--Security Innnovation",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=768fcf4f3e66caae",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Senior-Software-Engineer-Management-Plane-Security-Innnovation/1433556",
      "location": {
        "country": "US",
        "city": "San Jose",
        "state": "CA"
      },
      "description": "***The application window is expected to close on January 31st, 2025\\.******Job posting may be removed earlier if the position is filled in a sufficient of applicants are received.***\n\n **Who We Are**\n\nAs part of Cisco’s Security Business Group, the Security Innovation team incubates ideas for the leading provider of network security services, which enables the world to connect with confidence on any device, anywhere, anytime. Our product portfolio includes the cloud delivered firewall, Web proxy, Zero Trust Proxy, NaaS integrations, and inspection services as highly available distributed systems using cloud engineering practices. We are now engineering a highly available distributed security fabric that brings it all together, Cisco Hypershield. We are highly passionate about the interconnected SASE world, and this is part of our continued commitment to offer customer\\-focused security products at the edge of technology.\n\n\n**Cisco Hypershield** protects applications, devices and data across public and private data centers, clouds and physical locations \\- anywhere customers need it. Designed and built with AI in mind from the start, Hypershield enables organizations to achieve security outcomes beyond what has been possible with humans alone.\n\n\n**Who You Are**\n\nThe **management plane** acts as the brains of Hypershield. We seek an innovative backend engineer interested in building security features of significance. You will develop novel features associated with managing Hypershield’s security assets deployed by customers. Your work will bring together network events of significance, AI engines, the generation of security policies, administration, deployment, enforcement and orchestration of security policies. You will also work on featuresets that enrich the customer experience along this journey – features ranging from deployment, to configuration, monitoring, logging and storage. We are a small team driving the next evolution of security at Cisco.Typical responsibilities may include:\n\n\n* Proactively identify and participate in the resolution of complex problems that impact the direction of the business\n* Develop and deliver innovative strategies that benefit customers and or clients\n* Lead the development and implementation of software development life cycle and agile engineering strategies across applicable teams in anticipation of the changing software development environment\n* May represent or present team outputs at external events\n* Communicate product or program priorities deadlines and shifts in requirements in the context of engineering priorities and user needs\n* Negotiate and drive tradeoffs in timing design and specifications to meet the needs of users and cross functional partners\n* Lead, mentor and influence other engineering team members\n\n\nThe ideal candidate for this role will be comfortable leading design discussions with other architects and engineers. They can present architecture designs and solutions to multiple teams across organizations, gathering feedback that will help us drive consensus and gain alignment. We need someone not afraid to be creative, and use innovative programming languages, technologies, and tools to drive groundbreaking new products.\n\n\n**Minimum Qualifications for this Role:**\n\n\n* 5\\+ years professional programming with TypeScript, Golang, C, JavaScript or similar languages; experience must include the design of features of enterprise grade security solutions.\n* Linux development environment experience\n* Bachelor’s degree in computer science or related field\n\n\n**Preferred Qualifications and Experience:**\n\n* Strong background in applications or network security, protocols and policies. (e.g. firewalls, secure web gateways, and/or SASE/SSE)\n* Strong handle of algorithms and data structure concepts\n* Prior experience architecting management planes, or components related to control, monitoring or deployment of security policies to assets\n* Experience integrating third party solutions\n* Proven track record collaborating with UX/UI Design, Product, and Senior management\n* Development team leadership, mentorship to other engineers on the team\n\n\n**Why Cisco Secure?**\n\nWe're global, we're adaptable, we're diverse, and our security portfolio is as extensive as it is groundbreaking. Have you heard of Threat, Detection \\& Response, Zero Trust by Duo, Common Services Engineering, or Cloud \\& Network Security? Those are only a few of our product teams! The only thing we're missing is YOU.\n\n\nJoin an enterprise security leader with a start\\-up culture, committed to driving innovation and giving you the opportunity to make an impact. We \\#InnovateToWin and we know we're better together, that's why we're dedicated to inclusivity, collaboration, and diversity in everything we do.\n\n\nWe're proud to be the Best Small and Mid\\-Size Enterprises Security Solution Cisco Secure continues to grow and evolve year after year with 100% of Fortune 100 Companies using our products, and we're excited to see the new heights we'll reach with your passion for security, your customer focus, and your desire to change things up!\n\n\nThere are so many amazing reasons to join Cisco. Learn more here!\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 193896.0,
        "max_amount": 245516.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-08",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-13db535a8dbd7f58",
      "title": "ESG Finance Manager",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=13db535a8dbd7f58",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/ESG-Finance-Manager/1431143",
      "location": {
        "country": "US",
        "city": "Research Triangle Park",
        "state": "NC"
      },
      "description": "Members of the Finance organization at select locations will generally be expected to follow a hybrid work model, which includes two days of in\\-office attendance each week, with limited exceptions.\nApplication window deadline is 1/17/2025\\.\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n**What you'll do:**\n-------------------\n\n\nYou will be joining Cisco’s ESG Finance team reporting to the ESG Controller. Your responsibilities will span the entire Finance organization and you will work closely with Cisco’s Chief Sustainability Office, Legal, and the People, Process and Purpose organization as well as Engineering, Operations, and other functional teams across the company on Cisco's Environmental, Social and Governance (ESG) initiatives and commitments.\nYou will part of a small and mighty team leading Cisco’s ESG reporting efforts. Cisco has a long history of social and environmental commitments. Delivering on important ESG goals is not just critical for society but also for our business. We believe that keeping these goals at the forefront makes us stronger in the long run, and our customers, partners, current and former employees, and governments demand it. We’ve been creating and measuring progress and outcomes of our ESG initiatives and commitments on a global scale for many years. By setting clear goals, measuring our progress, and visibly reporting our impact, we’re able to provide an account of the difference we are making and to learn from our outcomes. In short, Cisco’s purpose is to Power an Inclusive Future for All. To achieve our purpose, we use our technology and inspire our people to make a positive impact in communities worldwide and on the planet. The ESG Finance team are key to ensuring that Cisco meets its commitments, ensures clarity in its reporting, and develops and implements the vital systems, processes, and controls to ensure success.\n\n**Specifically, you will:**\n---------------------------\n\n* You will be part of our global ESG Finance team and you will be responsible for designing, developing and implementing our ESG Integrated Reporting Strategy. This strategy will be the approach we use to meet all ESG reporting requirements. We need to develop a single data set that can be used for all reporting requirements, whether required or voluntary. Our strategy must also be able to incorporate new regulations as they emerge over time.\n* Develop a detailed plan to enable the transition from voluntary to mandatory reporting including working closely with SMEs (Subject Matter Experts) in ESG topics to drive the plan to achieve the overall strategy and specific objectives for Cisco. The resulting reporting and underlying disclosures will be audit ready.\n* Conduct bench marking and develop programmatic data\\-driven insights and research to advise strategic decisions and thought leadership and incorporate this into the detailed plan.\n* Present to senior leadership on a regular basis on our status and progress on implementation of strategy\n* You will also help shape the overall system architecture approach to ESG and collaborate cross functionally to create a comprehensive end to end ESG solution. In particular you will need to focus on creating a single source of truth to enable Integrated Reporting plus robust “last mile reporting” to ensure efficient and accurate financial statement reporting.\n* Other focus areas of the role include:\n* Develop a deep knowledge and expertise on ESG trends, frameworks, regulations\n* Review of ESG metric calculations to ensure compliance with reporting regulations and integration into our net zero plan; along with review of metric enhancements, data sources, methodology and timing.\n* Be a trusted partner to our corporate wide social, environmental and governance teams on all finance related matters.\n* Working cross functionally to support the launch of any new public goals and integrate into the quarterly goal tracking process including ongoing support for quarterly tracking of all public goals.\n* Data validation for all voluntary reporting submissions (ensuring aligned and integrated reporting)\n* Ensuring compliance of all public communications with our internal policies and our external goals\n\n**This role will give you an excellent opportunity to:**\n--------------------------------------------------------\n\n* You will be part of an organization that believes that we have the opportunity and the responsibility to do more for the world than we ever thought possible. We are committed to delivering on important ESG goals that are critical for society as well as our business.\n* You will learn a tremendous amount on highly relevant ESG topics that are critically important worldwide\n* You will be part of a team that works cross\\-functionally across all areas of our business including key partners across various functions\n* Develop an understanding of Cisco's ESG reporting, data, processes, controls, and business operations\n* Develop expertise in technical ESG reporting requirements including new US and International regulations, various frameworks, financial reporting, compliance and controls\n\n**Who you'll work with:**\n-------------------------\n\n\nYou'll get opportunities to interact with senior leaders in the Controllership organization and broader Finance, the office of the CSO (Chief Sustainability Office), Supply chain, Legal, People and Communities, Engineering, Investor Relations, and Workplace Resources, among others.\n\n\nThe Controllership organization is comprised of several groups that are committed to supporting business processes through developing, influencing and implementing global financial policy, processes, and effective partnering while conducting itself with the highest level of integrity and credibility.\n\n**Who you are:**\n----------------\n\n\nYou are a highly motivated, self\\-starter, results\\-oriented with an ability to work on multiple deliverables at the same time and drive large scale projects to completion with excellent interpersonal and communication skills. You are eager to learn, and have a strong Finance background with a good understanding of ESG regulations. You are able to implement in a sophisticated, fast\\-paced large corporate environment. You are confident in your ability to drive resolution of sophisticated issues, work with senior executives, and can optimally work cross\\-functionally.\n\n* Have detailed knowledge of ESG regulations including CSRD, ISS and SEC rules\n* Ability to motivate change on a large scale \\- have validated experience in leading large cross functional projects and driving them to a successful conclusion\n* Good communication and validated cross\\-functional collaboration and teamwork skills; good at building and cultivating strong relationships with business partners both internally and externally\n* Ability to connect with, and influence senior leadership\n* Take the initiative to work independently and report out on progress with the ability to apply specific knowledge to new situations and requests\n* Be agile – able to change directions and reprioritize as required to address new and changing regulations\n* Have expertise with financial reporting systems and applications implementation.\n\n**Minimum requirements for this role:**\n---------------------------------------\n\n* Bachelors’ degree or equivalent experience\n* 10\\+ years of strong finance background, experience in ESG and/or financial reporting, processes, internal controls, systems\n* You can determine solutions and lead teams and processes to achieve those solutions\n* You bring a strong attention to detail and a high degree of accuracy\n* You are agile and innovative and handle pressure in ambiguous situations\n* You bring previous experience working in sophisticated, unstructured environments and driving organizational level change\n\n **Why Cisco**\n\\#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.\n\n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box!\n\n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)\n\n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\n\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 151287.0,
        "max_amount": 191563.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-03",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-820e9aeb19786da2",
      "title": "Technical Leader - Test Automation",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=820e9aeb19786da2",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Technical-Leader-Test-Automation/1431424",
      "location": {
        "country": "US",
        "city": "San Jose",
        "state": "CA"
      },
      "description": "**The application window is expected to close on 02/03/2025**\n-------------------------------------------------------------\n\n**Meet the Team**\n-----------------\n\n\nAt Cisco, we are a global leader in networking and IT, driving innovation and redefining how people connect, communicate, and collaborate. Our mission is to shape the future of the internet by creating outstanding value and opportunity for our customers, employees, investors, and ecosystem partners. We are committed to encouraging a diverse and partnership environment where everyone can thrive and encourage our collective success.\nAs a senior member, you'll join a tight\\-knit, highly skilled team with a passion for learning and expanding core knowledge. Our engineers are driven to excel, supporting both customers and colleagues. Embracing the motto \"Work hard, play harder,\" the team blends engineers with experience ranging from 3 to over 20 years in Cisco technologies, each bringing exceptional value. We have a global presence, with team members located in the US, Canada, and India.\n\n\n**Your Impact**\n---------------\n\nAs a Technical Leader, Test Engineer, you will be responsible for designing, automating, configuring, and qualifying customer use cases for IOS\\-XR on ASR9K, NCS5500, NCS5000, and 8000 platforms. Your role includes generating test plans and dynamically prioritizing tasks to meet customer demands, while enhancing technical expertise across relevant areas. You will design and develop innovative test frameworks and tools, as well as web\\-based GUIs that utilize analytics and machine learning to effectively display and analyze execution results. You will drive test cases both manually and through automation, manage defects and fixes, and continuously seek improvements in test coverage, execution, and automation to optimize performance and configuration dimensioning.\n\n\nAdditionally, you will reproduce customer issues in internal test labs, generate test execution reports and technical whitepapers, and collaborate with teams across multiple continents. Your passion for qualifying and automating SP and web networking solutions will ensure smooth deployment for customers. Experience in qualifying, deploying, fixing, and maintaining SP/web networking technologies, especially XR platforms, is essential for this role.\n\n**Minimum Qualifications**\n--------------------------\n\n* Bachelor's degree in a STEM field with 8\\+ years of engineering experience, or a Master's degree in a STEM field with 6\\+ years of engineering experience.\n* Experience with Networking Automation and Software Quality Assurance, protocol testing, and supporting Web/Service\\-provider customers.\n* Experience with routing hardware, platform forwarding architecture, and networking technologies, such as, but not limited to, OpenFlow, Netconf, and REST API.\n* Experience with Python and/or GoLang, and familiarity with network automation tools such as, but not limited to, pyATS, Ansible, Jenkins, or Robot framework.\n\n**Preferred Qualifications**\n----------------------------\n\n* CCIE certification in areas such as Routing \\& Switching, Service Provider, or Data Center.\n* Extensive experience with platforms such as ASR9K, NCS5500, NCS5000, NCS540/NCS560, NCS6K, CRS, and 8000\\.\n* Advanced knowledge of UNIX/Linux systems, including CentOS, Redhat, and Ubuntu, with expertise in Bash/Unix Shell Scripting.\n* Proficiency in configuring and troubleshooting advanced networking protocols such as ISIS/OSPF, BGP, L2/L3 VPN, EVPN, SegmentRouting, IPv6, MPLS\\-LDP/RSVP\\-TE, Multicast, SNMP, Telemetry, gNMI, gRPC, Netconf, and OpenConfig Yang Models.\n\n**\\#WeAreCisco**\n----------------\n\n\\#WeAreCisco where every individual brings their unique skills and perspectives together to pursue our purpose of powering an inclusive future for all.\n\n\nOur passion is connection—we celebrate our employees’ diverse set of backgrounds and focus on unlocking potential. Cisconians often experience one company, many careers where learning and development are encouraged and supported at every stage. Our technology, tools, and culture has paved the way for hybrid work trends, allowing all to not only give their best, but be their best.\n\n\nWe understand our outstanding opportunity to bring communities together and at the heart of that is our people. One\\-third of Cisconians collaborate in our 30 employee resource organizations, called Inclusive Communities, to connect, cultivate belonging, learn to be advised allies, and make a difference. Dedicated paid time off to volunteer—80 hours each year—allows us to give back to causes we are passionate about, and nearly 86% do!\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 144653.0,
        "max_amount": 183163.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-03",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-cb8daa4373c88481",
      "title": "Senior Product Manager, Hardware Platforms",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=cb8daa4373c88481",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Senior-Product-Manager-Hardware-Platforms/1429684",
      "location": {
        "country": "US",
        "city": "Research Triangle Park",
        "state": "NC"
      },
      "description": "Application window has been extended and expected to close on 1/17/2025\n-----------------------------------------------------------------------\n\nJob posting may be removed earlier if the position is filled or if a sufficient number of applications are received.\n--------------------------------------------------------------------------------------------------------------------\n\nPreference will be given to candidates local to Austin, TX and RTP, NC\n----------------------------------------------------------------------\n\n**What You'll Do**\n==================\n\n\nYou'll be responsible for delivery/operations and life cycle management of Cisco Secure Firewalls. Salient activities are new product introduction, forecasting, supply chain engagements, compliance/certifications and customer delivery.\nYou'll also evangelize Cisco's Security solution and represent the Security Business Group at regional events as the need arises, both internal to Cisco and external.\n\n\nWorking with the Cisco Secure Firewall portfolio and the broader Cisco business involves driving a dynamic business undergoing transformation in a fast\\-paced environment.  \n\n\n\n  \n\n**Who You Are**\n===============\n\n\nThe Product Manager is central hub within the organization for crucial decision\\-making about the security products and have key insights into market, competition, customers, prospects, and many other constituencies.\n\n* You possess a good understanding of customers and the competitive landscape, as well as regulatory requirements.\n* You have strong leadership skills and the ability to successfully operate in a cross\\-functional, globally distributed team driving tangible revenue growth.\n* Experience building customer\\-facing roadmaps, managing feature priority/backlog.\n* You have experience presenting technical topics to large audiences.\n* You are dedicated to customer success and have a bias for action.\n\nMinimum Qualifications\n----------------------\n\n* 5\\+ years of Hardware Product Management experience.\n* 2\\+ years of professional experience in the security industry, specifically involving firewalls.\n* Technical background in networking technologies and solutions.\n\nPreferred Qualifications\n------------------------\n\n* Excellent verbal, written and presentation abilities: effective interpersonal skills, with the ability to communicate effectively with both technical and non\\-technical individuals.\n* Bachelor's degree in Computer Science, Information Systems, Engineering, or related degree or equivalent experience\n\n**Why Cisco Secure**\n--------------------\n\n\nWe're global, we're adaptable, we're diverse, and our security portfolio is as extensive as it is groundbreaking. Have you heard of Threat, Detection \\& Response, Zero Trust by Duo, Common Services Engineering, or Cloud \\& Network Security? Those are only a few of our product teams! The only thing we're missing is YOU.\n\n\nJoin an enterprise security leader with a start\\-up culture, committed to driving innovation and giving you the opportunity to make an impact. We \\#InnovateToWin and we know we're better together, that's why we're dedicated to inclusivity, collaboration, and diversity in everything we do.\n\n\nWe're proud to be the Best Small and Mid\\-Size Enterprises Security Solution Cisco Secure continues to grow and evolve year after year with 100% of Fortune 100 Companies using our products, and we're excited to see the new heights we'll reach with your passion for security, your customer focus, and your desire to change things up!\n\n\nThere are so many amazing reasons to join Cisco. Learn more here!\n\n\n\\#LI\\-VS1  \n\n\\#LI\\-LM1\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 162876.0,
        "max_amount": 206237.0,
        "currency": "USD"
      },
      "date_posted": "2024-10-28",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-0ade9c8c4742e05f",
      "title": "Executive Assistant - SVP, Social Impact and Inclusion",
      "company_name": "Cisco",
      "job_url": "https://www.indeed.com/viewjob?jk=0ade9c8c4742e05f",
      "job_url_direct": "https://jobs.cisco.com/jobs/ProjectDetail/Executive-Assistant-SVP-Social-Impact-and-Inclusion/1432951",
      "location": {
        "country": "US",
        "city": "San Jose",
        "state": "CA"
      },
      "description": "Application window has been extended and expected to close on 1/13/2025\\.\nPreference for candidates local to the San Jose office, able to be onsite a few times a month, open to other hybrid locations.\n\n\n**Meet the team**\n=================\n\n\nCisco is seeking an Executive Assistant Professional to provide support for the Senior Vice President of Social Impact and Inclusion.\n\n**Responsibilities include:**\n-----------------------------\n\n* Calendar Management: Management of SVP's calendar and daily schedule to include prioritizing conflicting meeting requests, supervising action items and commitments of executive and following\\-up to ensure completion. This will require outstanding organization skills, prioritizing multiple priorities and keeping a lively executive on track and on schedule.\n* Event Speaking Engagement Coordination: Responsible for a running list of SVP's engagements and works closely with communications team to ensure content needs are understood and set in motion so the SVP is prepared for each engagement.\n* Meeting Planning and Organization: Assisting Senior VP in planning and coordinating meetings by taking ownership for assembling the agenda, location, accommodating technology requirements based upon participant needs, and all other meeting logistics. May further prepare meeting briefing documents by taking and disseminating notes and formulating post meeting action item list.\n* Travel Briefing Preparation: Crafting travel packs for international trips. This work includes combining all event information in addition to coordinated logistics of travel and also customer/team asks.\n* Correspondence/Approvals: Supporting SVP by acting as proxy for communications and approvals as authorized. Answering general questions as crucial, referring (filtering) routine matters to appropriate parties, and following up to ensure accurate disposition. Taking initiative to resolve issues within specified policies and guidelines, and providing mentorship to administrative community members on problem solving. Resolving when executive action is required and supplying a recommendation where appropriate.\n* Travel and Expense Management: Responsible for making in\\-depth global travel arrangements for SVP. Carefully considers and decides the optimum travel arrangements and itinerary for calendared meetings while handling Cisco expenses. Works diligently to go above and beyond, working with the airlines directly to accommodate Global Services benefits for upgrades whenever they are available.\n* Special Projects: Providing analytical support to assist executive on special projects. Researching issues, analyzing problems, compiling data, and preparing reports.\n* Large Corporate Events: Prepare and brief itinerary as well as accompany VP for large Corporate Events such as GSX, where EA's are used for executive support.\n* Confidentiality: Candidate will deal expertly with highly critical and confidential matters and materials.\n* Mentor new Executive Administrative Assistants and other administrators. Participates in a cross\\-functional EA network and will lead the organization’s community of Admins.\n\n\nIn addition to general administrative duties of an EA, daily tasks are carried out at a higher level of complexity. Specifically, the critical behaviors of this role are:\n\n* Self\\-motivated and proactive around needs of the SVP and the Organization\n* Able to operate successfully with limited direction and ambiguity\n* Use tact, subtlety and a practical knowledge of company policies, practices and procedures\n* Responsiveness to all levels of inquiry\n* Challenge ‘the way we’ve always done it’ and provide a deeper more innovative way of doing things\n* Keep the big picture in mind when making independent decisions that affect the SVP’s calendar\n* Have the ability to exercise critical and independent judgment with the SVP’s calendar and time\n* Organized and efficient with their own time\n* Able to think creatively and calmly when it comes to quick and unplanned changes in schedule\n* Earn administrative community respect and have the ability to work with and through others as needed\n\n**Your Impact**\n===============\n\n\nYou take initiative, can handle a full desk with ease and thrive in a lively environment. You have high\\-energy with a passion for thinking bigger and broader than the role itself. This position requires strong interpersonal skills, independent judgment, utmost integrity and ability to balance both strategic and tactical actions. You have outstanding attention to detail and the ability to handle confidential information. You enjoy a collaborative environment, are committed to improvement, solve problems and make decisions. You have a proven ability to multitask and work in a focused manner. You are comfortable working without instruction on routine tasks and very little instruction on new projects.\n\n**Minimum Qualifications:**\n===========================\n\n* 5\\+ years’ experience in administrative environment, and a minimum of 2 years supporting at the VP level or above.\n* Expert level knowledge of Windows desktop computer applications: Word, Excel, and PowerPoint.\n* Experience in calendar management, planning meetings and coordinating travel.\n* Excellent verbal and written communication skills including the ability to connect with all levels of Executive/Senior staff and clients.\n* Ability to navigate web and email at high competency knowledge.\n\n**Preferred Qualifications:**\n=============================\n\n* BA/BS or equivalent experience\n* Past work experience in the high\\-tech industry\n\n**\\#WeAreCisco**\n----------------\n\n\n\\#WeAreCisco where every individual brings their unique skills and perspectives together to pursue our purpose of powering an inclusive future for all.\n\n\nOur passion is connection—we celebrate our employees’ diverse set of backgrounds and focus on unlocking potential. Cisconians often experience one company, many careers where learning and development are encouraged and supported at every stage. Our technology, tools, and culture pioneered hybrid work trends, allowing all to not only give their best, but be their best.\n\n\nWe understand our outstanding opportunity to bring communities together and at the heart of that is our people. One\\-third of Cisconians collaborate in our 30 employee resource organizations, called Inclusive Communities, to connect, foster belonging, learn to be informed allies, and make a difference. Dedicated paid time off to volunteer—80 hours each year—allows us to give back to causes we are passionate about, and nearly 86% do!\n\n\nOur purpose, driven by our people, is what makes us the worldwide leader in technology that powers the internet. Helping our customers reimagine their applications, secure their enterprise, transform their infrastructure, and meet their sustainability goals is what we do best. We ensure that every step we take is a step towards a more inclusive future for all. Take your next step and be you, with us!\n\n\n  \n**Message to applicants applying to work in the U.S. and/or Canada:**  \n\n  \n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full\\-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non\\-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have **access** to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long\\-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non\\-exempt employees), plus a day off for their birthday. Non\\-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4\\.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80\\) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\n\nEmployees on sales plans earn performance\\-based incentive pay on top of their base salary, which is split between quota and non\\-quota components. For quota\\-based incentive pay, Cisco typically pays as follows:\n\n\n.75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n\n1\\.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\n\nFor non\\-quota\\-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
      "company_url": "https://www.indeed.com/cmp/Cisco",
      "company_url_direct": "http://www.cisco.com",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 99620.0,
        "max_amount": 126141.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-06",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "San Jose, CA",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology. Be you, with us! #WeAreCisco!",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b799172fd63cfb12d47f7d0f8f79a90b",
      "banner_photo_url": null,
      "job_function": null
    }
  ]
}