{
  "company_name": "Verizon",
  "sector": "Telecommunications",
  "sample_size": 20,
  "total_jobs_available": 384,
  "jobs": [
    {
      "id": "in-8335b8a3bf8283cc",
      "title": "Client Executive-Business Sls",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=8335b8a3bf8283cc",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1061999/client-executive-business-sls/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Irving",
        "state": "TX"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n\nIn this role, you'll help our most important customers move their business forward. As a trusted advisor, you'll create value for Verizon and our customers by solving their business problems. You’ll be responsible for an assigned territory of existing large enterprise clients, and will provide a consultative approach to sell advanced solutions and reduce churn while also strengthening relationships. Collaborating with both internal and external teams, your critical role will help ensure that Verizon is providing solutions that meet our customers technical and business needs. The primary accountabilities associated with the position include:\n\n\n* Developing deep relationships with your customers while getting to know their businesses, markets and the challenges they face.\n* Identifying and pursuing new sales leads.\n* Developing and orchestrating sales strategy and driving innovation.\n* Crafting creative solutions to help customers realize their goals.\n* Creating and providing winning outcomes for Verizon and its customers.\n* Collaborating cross\\-functionally to deliver outcomes.\n* Demonstrating value so that customers choose Verizon solutions.\n* Growing our business while making customers happy.\n\n\nWhether you're early in your career or a seasoned sales professional, join today and earn a competitive lucrative salary, which includes base pay and target individual\\-based commission. Planning to go above and beyond? Our commission program allows unlimited opportunity which could allow top earners to exceed compensation plans and compete for various sales incentives. Compensation varies by geography and performance and experience.\n\n\nOur comprehensive benefits (starting day one) and perks are designed to help you move forward in your career and in your life outside of Verizon. From health and well\\-being benefits to investment in your education and career, we've got you covered!\n\n* Best in class medical, dental and vision\n* Verizon 401(k) plan with matching contributions up to 6% of eligible participant contributions to the plan, qualified student loan repayments, or a combination of both.\n* $5,000 or more stock grant per year, part of Verizon's Stock Together award program\n* Engage your clients with Verizon's Velocity Selling methodology. Using AI and advanced CRM tools, the Velocity Selling methodology boosts efficiency, productivity, and decision\\-making through automation, predictive analysis, and personalized customer approach. Providing you with a competitive edge and leverage to boost your own success and career growth.\n* Sales recognition programs that have, in the past, awarded top performers with all inclusive travel to domestic and international destinations, gifts, and other incentives\n* Lucrative paid time off, five weeks of paid time off (vacation, holidays, and personal days)\n* 8 weeks of paid parental leave for eligible new parents (for new moms, when paired with short\\-term disability, this benefit provides up to 16 weeks of paid time\\-off)\n* Up to $8k per year in tuition assistance\n* Expand your knowledge through various industry certifications through Verizon’s Get Certified program\n* Discounts up to 50% off on Verizon products and services, Fios, high\\-speed home internet solutions to accessories and exclusive Verizon features, including 50% off Verizon wireless calling plans and much more.\n* From Employee discounts to pet insurance, we offer additional perks to ensure V\\-teamers and their loved ones are supported holistically\n\nToo good to be true? Come see for yourself! From our in\\-person new hire experience and award\\-winning training programs to our inclusive culture of learning and amazing benefits, you'll be able to apply your skills while elevating your career.\n\n### **What we’re looking for...**\n\n\nYou enjoy digging deep to really understand the customer's vision along with their unique needs and challenges. You work collaboratively and are agile when cutometer needs change. You like putting things together in new and creative ways to best solve the customer's most pressing needs.\n\n\nYou'll need to have:\n\n* Bachelor's degree or four or more years of work experience.\n* Four or more years of relevant work experience.\n* Previous account development experience.\n* A valid driver's license.\n* Willingness to travel.\n\nEven better if you have one or more of the following:\n\n* A Masters or Bachelor’s degree.\n* The drive to meet or exceed challenging sales targets.\n* A proven track record of exceeding sales goals.\n* Experience having developed large multinational and Fortune 1000 account relationship.\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this mobile role, you'll primarily work from customer or field location(s), with occasional visits to a Verizon location for in\\-person training and meetings.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 108323.0,
        "max_amount": 137161.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-10",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-2c57f4e68c093dcb",
      "title": "IT Consultant - Enterprise Risk Management Controls Assurance",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=2c57f4e68c093dcb",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1057221/it-consultant-enterprise-risk-management-controls-assurance/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Basking Ridge",
        "state": "NJ"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n\nWhat you’ll be doing...\n\n\nThe ERM Controls Assurance team partners with Business \\& IT Leaders overseeing enterprise wide initiatives, to ensure IT and Business Process controls are sufficiently being designed and implemented to mitigate financial and and other operational risks.\n\n\nAs an IT Consultant on the Controls Assurance team, you will be leading ITGC, SDLC and Automated Business Process Control risk identification and control design efforts impacted by major System Integrations/Migrations and Business Process changes. You will be working directly with IT and Business stakeholders, and partnering with other ERM Controls Assurance team members, to make strategic control design decisions that meet Verizon’s compliance needs, but also take IT and Business stakeholders’ needs into consideration. Your work will help us improve our processes and discover ways to make our control environment even stronger.\n\n* Demonstrating a high level of competency evaluating regulatory risks and control design, especially related to Sarbanes\\-Oxley (SOX) and Data Governance.\n* Assessing IT risks within Business Processes (interfaces, key reports, automated controls).\n* Working closely with Business partners to identify financial reporting and regulatory risks, and designing controls to mitigate those risks.\n* Working closely with IT partners to identify ITGC related risks, and designing controls to mitigate those risks.\n* Testing System Development Life Cycle (SDLC) controls for new system implementations.\n* Developing process flow diagrams that accurately summarize Business Processes, highlighting relevant risks and key control points.\n* Coordinating with Verizon’s external auditors to ensure alignment on relevant risk areas, and the sufficiency of controls designed to address those risks.\n* Reviewing work performed by consulting partners supplementing our team to ensure strong team integration and timeliness/quality of deliverables.\n* Performing test of design procedures over internal controls.\n* Executing on time sensitive issues and bringing them to appropriate conclusions.\n* Providing training and coaching to professional staff on all areas of risk and control design.\n* Preparing and presenting materials on control decisions and project status to executive and senior management.\n\n  \n\nWhat we’re looking for...\n\n\nYou’re a great communicator, winning the trust of team members, internal customers, and external suppliers. No stranger to a fast\\-paced environment and tight deadlines, you can adapt to changing circumstances, balance competing priorities, and combine a sense of urgency with due care and attention to detail. You get personal satisfaction from analyzing problems and delivering solutions to improve business processes.\n\n\nYou’ll need to have:\n\n* Bachelor’s degree in Accounting, Finance, Economics, Math, or Information Systems or four or more years of work experience.\n* Four or more years of relevant work experience.\n* Experience designing and testing internal controls (Business Process and ITGCs).\n* Project management experience.\n\n  \n\nEven better if you have one or more of the following:\n\n* A Master's degree in Business Administration.\n* A Project Management Professional (PMP) certification.\n* A Professional certification (CPA, CIA, CISA, CFE).\n* Experience using data analytic tools (ACL, Tableau, Qlik).\n* Experience driving complex solutions and analytics to provide ongoing and automated monitoring of key risks.\n* Experience formulating, interpreting and implementing policies and processes.\n* Telecommunications experience.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 111199.0,
        "max_amount": 140803.0,
        "currency": "USD"
      },
      "date_posted": "2024-11-22",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-f404119bb2996659",
      "title": "Experience Specialist",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=f404119bb2996659",
      "job_url_direct": "https://wireless-zone-sanford-maine.VZwirelessjobs.com/j/02h06ry",
      "location": {
        "country": "US",
        "city": "Sanford",
        "state": "ME"
      },
      "description": "We are looking for a high\\-energy, reliable individual with outstanding customer service skills to assist our Sales Associates when selling and helping our customers with their Verizon Wireless service and products.  \n\n  \n\nIf you are outgoing with amazing energy and love to talk about cool technology. We have the job for you. As an Experience Specialist, you will get to know our communication technology inside and out, and you will be the one everyone else looks to when it comes to what's next in wireless and technology solutions. It is good to be the expert.  \n\n  \n\n**Benefits/Perks**  \n\n* Competitive hourly pay\n* Periodic goal\\-based incentives in addition to hourly compensation\n* Paid time off\n* Huge discounts off Verizon monthly service plans\n* 401K with company match\n* Medical Insurance\n* Dental Insurance\n* On\\-going training on the latest technology\n* A fun, fast paced work environment\n* A growing company with lots of opportunity\n* Easily move into a Sales Associate position or to our Business to Business Sales Team\n* Informative Training on the latest devices and new services\n\n  \n\n**Responsibilities**  \n\n* Educating and engaging customers through product demonstrations\n* Interacting with customers and providing prompt and courteous customer service to all customers in person or via phone\n* Assist our tenured Sales Associates with all aspects of the sales process and customer service duties to enhance the customer experience\n* Help with operational duties within the store\n\n  \n\n**Requirements**  \n\n* Must be 18yrs old\n* Works well with others in a customer service focused, friendly team environment\n* Staying current on the latest data/entertainment technology and devices\n* Working a variety of hours, including weekends, evenings, and holidays, involving occasional overtime\n\n  \n\n**Desired Qualifications:**  \n\n* Some retail customer service or experience preferred, but not required\n\n  \n\n**About Us**  \n\nWireless Zone®, A Verizon Wireless Authorized Retailer is the nation's largest wireless retail franchise with over 400 stores and growing. As a Verizon Authorized Retailer, Wireless Zone® combines the power of Verizon with the dedication of a locally owned business.  \n\n  \n\n Our communities need more than just a wireless retailer and our employees want more than just a job. We are committed to taking great care of our employees, customers, and giving back to the community that supports us. We believe that with this philosophy our business will continue to thrive!  \n\n  \n\n E.O.E (Equal Opportunity Employer)",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": 17.0,
        "max_amount": 20.0,
        "currency": "USD"
      },
      "date_posted": "2024-11-23",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-c157fa382e141b0c",
      "title": "State Tax Audit - Senior Manager",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=c157fa382e141b0c",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1051130/state-tax-audit-senior-manager/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Basking Ridge",
        "state": "NJ"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n**What you’ll be doing...**\n\n\nThe Senior Tax Manager of the State Income Tax Audit team is responsible for managing an inventory of Verizon state income tax and franchise tax audits. This position partners with other tax groups (e.g., Compliance, Legal, Research, and Tax IT) to ensure a favorable resolution of the audit period. This person will work to understand applicable law, detail facts, develop audit strategies, and negotiate favorable audit settlements. Additionally, this person will be working with their Senior Director on presentations to upper management. This position and the related accounting will directly impact cash taxes, free cash flow, and earnings per share. You will be considered a valuable business partner and your contributions will make a difference!\n\n**Responsibilities include:**\n\n* Clear communication skills and strong research skills.\n* Ability to develop strategy, respond to inquiries, negotiate settlements, present audit impacts, and manage related accounting.\n* Working independently and within a team in a fast\\-paced environment with changing priorities and time constraints.\n* Demonstrate an understanding of state income and franchise tax laws, audit acumen, and ability to negotiate and advocate favorable outcomes.\n* Demonstrate a high degree of data analytic skills including extracting and presenting large amounts of data for claims, audit support, and other needs.\n* Identify and calculate FIN 48/FAS 5 reserve needs.\n\n**What we’re looking for...**\n\n**You'll need to have:**\n\n* Bachelor's Degree or six or more years of work experience.\n* Six or more years of relevant experience required, demonstrated through one or a combination of work and/or military experience, or specialized training.\n* Experience in Sales, Use, and/or Gross Receipts Tax.\n* Experience with transaction tax audits including advanced tax audit techniques (e.g., sampling).\n* Experience in tax research analysis.\n\n**Even better if you have one or more of the following:**\n\n* CPA or Master's Degree in Taxation.\n* An advanced degree in Law, Accounting, Taxation, Finance, Management Information Systems, or Computer Science.\n* A professional certification (e.g., CPA, CMA).\n* Experience with digital automation.\n* Experience with data visualization technology (e.g., Alteryx, QLIK).\n* Experience in the sales/use and gross receipts tax field for Big 4 accounting firms and/or Fortune 500 corporate tax departments.\n* Experience in the technology and/or telecommunications industry.\n* Knowledge in Enterprise Resource Planning such as SAP.\n* Experience as an auditor for a taxing authority.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 140162.0,
        "max_amount": 177476.0,
        "currency": "USD"
      },
      "date_posted": "2024-09-30",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-e04da19d07461473",
      "title": "Data Engineer",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=e04da19d07461473",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1055432/data-engineer/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Ashburn",
        "state": "VA"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n\nAs a Data Engineer, you’ll work with world\\-class team members to help drive telecom business to its full potential. We are building data products/assets for telecom wireless and wireline business, which includes consumer analytics, telecom network performance and service assurance analytics. We are working on cutting\\-edge technologies like digital twin to build these analytical platforms and provide data support for varied AI ML implementations.\n\n\nYou’ll collaborate with business product owners, coaches, data scientists, and system architects to develop strategic data solutions. You will enable the required data sets from different sources both structured and unstructured data into our data warehouse and data lake with real\\-time streaming and/or batch processing to generate insights and perform analytics for business teams within Verizon.\n\n* Understanding the business requirements and converting them to technical design.\n* Working on Data Ingestion, Preparation, and Transformation.\n* Developing data streaming applications.\n* Debugging the production failures and identifying the solution.\n* Working on ETL/ELT development.\n* Understanding DevOps process and contributing for DevOps pipelines\n\n**What we’re looking for...**\n\n\nYou’re curious about new technologies and the game\\-changing possibilities it creates. You like to stay up\\-to\\-date with the latest trends and apply your technical expertise to solving business problems.\n\n**You’ll need to have:**\n\n* Bachelor’s degree or four or more years of work experience.\n* Four or more years of relevant work experience.\n* Experience with Data Warehouse concepts and Data Management life cycle.\n* Experience in GCP cloud platform \\- (BigQuery, Cloud Composer, Data Proc (or Hadoop \\& Spark), Cloud Function).\n* Experience in any programming language, preferably Python.\n* Experience in troubleshooting the data issues.\n* Experience in writing complex SQL and performance tuning.\n* Experience in DevOps\n\n **Even better if you have:**\n\n* Proficiency in graph data modeling, including experience with graph data models and graph query language\n* Any relevant Certification on ETL/ELT developer.\n* Certification in GCP\\-Data Engineer.\n* Exposure to working on GenAI use cases.\n* Good problem\\-solving, analytical, and research capabilities.\n* Good verbal and written communication.\n* Experience presenting to and influencing stakeholders.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 103102.0,
        "max_amount": 130550.0,
        "currency": "USD"
      },
      "date_posted": "2024-11-06",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-8ab032c8be851084",
      "title": "Retail Sales Associate - Kiosk",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=8ab032c8be851084",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1061727/retail-sales-associate-kiosk/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Northglenn",
        "state": "CO"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n\nAs a full\\-time Verizon Retail Sales Associate in the mobile department at a National Retailer, you'll have the opportunity to grow your career with a team focused on unlocking your full potential and sales success within one of our National Retailer locations. Here's what you can expect:\n\n* Generate retail sales by using your passion for cutting\\-edge technology and customer service to expand the Verizon network.\n* Learn and uncover customers' needs by creating connections and asking the right questions.\n* Position product insights and solution recommendations to provide customers with a complete sales solution.\n* Close sales by using phenomenal communication skills to fulfill customer needs with simple and intuitive tech solutions.\n* Continuously develop yourself through ongoing training and up\\-skill in operational functions across merchandising and inventory.\n* Potential to grow your customer base by placing outbound calls and sending text messages to current Verizon customers who are interested in our products and services.\n\n\nWe’re hiring immediately and this isn't your average entry\\-level position! Whether you're early in your career or an experienced sales professional, join today and earn from $47,500 to $57,000 a year, which includes base pay and target individual\\-based commission. Planning to go above and beyond? Our commission program allows unlimited opportunity which could allow top earners to make an extra $10,000 or more per year in addition to the compensation range quoted earlier. Compensation varies by geography and performance.\n\n\nOur comprehensive benefits (starting day one) and perks are designed to help you move forward in your career and in your life outside of Verizon. From health and well\\-being benefits to investment in your education and career, we've got you covered!\n\n* Best in class medical, dental and vision\n* Verizon 401(k) plan with matching contributions up to 6% of eligible participant contributions to the plan, qualified student loan repayments, or a combination of both (effective January 1, 2024\\)\n* $2,500 stock grant per year, part of Verizon's Stock Together award program\n* Sales recognition programs that have, in the past, awarded top performers with all inclusive travel to domestic and international destinations, gifts, and other incentives\n* Five weeks of paid time off (vacation, holidays, and personal days)\n* 8 weeks of paid parental leave for eligible new parents (for new moms, when paired with short\\-term disability, this benefit provides up to 16 weeks of paid time\\-off)\n* Up to $8k per year in tuition assistance\n* Discounts up to 50% off on Verizon products and services\n* Additional employee discounts on attractions, automotive, travel, and more\n\n\nToo good to be true? Hear from our Verizon Retail Team Members on what it's like to be part of a team that invests in you. From our in\\-person new hire experience and award\\-winning training programs to our inclusive culture of learning and amazing benefits, you'll be able to apply your skills while elevating your career.\n\n### **What we’re looking for...**\n\n\nYou’ll need to have:\n\n* High school diploma or GED.\n* One or more years of work experience.\n* Willingness to work evenings, weekends, and holidays (you'll know your schedule four weeks in advance).\n* Openness to pick up and earn more income, typically during the summer months, November through December, and/or during peak vacation periods.\n\n\nEven better if you have one or more of the following:\n\n* Experience working in a commission\\-based environment.\n* Demonstrated experience communicating with customers to find solutions.\n* Customer service experience.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n\nThis job posting will close on **February 8, 2025**\n\n### **Where you’ll be working**\n\n\nIn this worksite\\-based role, you'll work onsite at a defined location(s).### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.\n\n\nOur benefits are designed to help you move forward in your career, and in areas of your life outside of Verizon. From health and wellness benefits, short term incentives, 401(k) Savings Plan, stock incentive programs, paid time off, parental leave, adoption assistance and tuition assistance, plus other incentives, we’ve got you covered with our award\\-winning total rewards package. For part\\-timers, your coverage will vary as you may be eligible for some of these benefits depending on your individual circumstances.\nIf you are hired into a California, Colorado, Connecticut, Hawaii, Illinois, Maryland, Minnesota, Nevada, New York, Rhode Island, Washington or Washington, D.C. work location, the starting base pay rate for this position is $17\\.31/hour. This is a commission based position with the potential to earn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": null,
        "max_amount": null,
        "currency": "USD"
      },
      "date_posted": "2025-01-08",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-6a29093044055921",
      "title": "Retail Sales Associate",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=6a29093044055921",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1061795/retail-sales-associate/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Missoula",
        "state": "MT"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n\nAs a full\\-time Verizon Retail Sales Associate, you’ll have the opportunity to grow your career with a team focused on unlocking your full potential and sales success within one of our retail stores. Here's what you can expect:\n\n* Generate retail sales by using your passion for cutting\\-edge technology, and exceptional customer service to expand the Verizon network.\n* Learn and uncover customers' needs by creating connections and asking the right questions.\n* Position product insights and solution recommendations to provide customers with a complete top\\-down sales solution.\n* Close sales by using phenomenal communication skills to fulfill customer needs with simple and intuitive tech solutions.\n* Continuously develop yourself through ongoing training and up\\-skill in operational functions across merchandising and inventory.\n* Potential to grow your customer base by placing outbound calls and sending text messages to current Verizon customers who are interested in our products and services.\n* Opportunities to engage with the community outside of the store to expand your loyal customer base, including at off\\-site Verizon sponsored events.\n\n\nWe’re hiring immediately and this isn't your average entry\\-level position! Whether you're early in your career or an experienced sales professional, join today and earn from $49,000 to $59,000 a year, which includes base pay and target individual\\-based commission. Planning to go above and beyond? Our commission program allows unlimited opportunity which could allow top earners to make an extra $10,000 or more per year in addition to the compensation range quoted earlier. Compensation varies by geography and performance.\n\n\nOur comprehensive benefits (starting day one) and perks are designed to help you move forward in your career and in your life outside of Verizon. From health and well\\-being benefits to investment in your education and career, we've got you covered!\n\n* Best in class medical, dental, and vision\n* Verizon 401(k) plan with matching contributions up to 6% of eligible participant contributions to the plan, qualified student loan repayments, or a combination of both (effective January 1, 2024\\)\n* $2,500 stock grant per year, part of Verizon's Stock Together award program\n* Sales recognition programs that have, in the past, awarded top performers with all inclusive travel to domestic and international destinations, gifts, and other incentives\n* Five weeks of paid time off (vacation, holidays, personal days)\n* 8 weeks of paid parental leave for eligible new parents (for new moms, when paired with short\\-term disability, this benefit provides up to 16 weeks of paid time\\-off)\n* Up to $8K per year in tuition assistance\n* Discounts up to 50% off on Verizon products and services\n* Additional employee discounts on attractions, automotive, travel and more.\n\n***Join Verizon today and be elgible for a $2500 Sign on bonus! (subject tothe terms and conditions of the award)***\n\nToo good to be true? Hear from our Verizon Retail Team Members on what it's like to be part of a team that invests in you. From our in\\-person new hire experience and award\\-winning training programs to our inclusive culture of learning and amazing benefits, you'll be able to apply your skills while elevating your career.\n\n### **What we’re looking for...**\n\n\nYou’ll need to have:\n\n* High school diploma or GED.\n* One or more years of work experience.\n* Willingness to work evenings, weekends, and holidays (you'll know your schedule four weeks in advance).\n* Openness to pick up additional shifts and earn more income, typically during the summer months, November through December, and/or during peak vacation periods.\n\n\nEven better if you have one or more of the following:\n\n* Experience working in a commission\\-based environment.\n* Demonstrated sales experience communicating with customers to find solutions.\n* Customer service experience.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **After you apply…**\n\n\nYou may be required to take an assessment. It takes about 20 minutes to complete. If you’re selected to move forward, one of our recruiters will reach out to tell you more about the role and answer your questions.\n\n### **Where you’ll be working**\n\n\nIn this worksite\\-based role, you'll work onsite at a defined location(s).### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 49000.0,
        "max_amount": 59000.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-09",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-799829da426a2738",
      "title": "Associate Community Manager Brand Social",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=799829da426a2738",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1061366/associate-community-manager-brand-social/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "New York",
        "state": "NY"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n\nThe Associate Community Manager, Brand Social is part of a team that is responsible for tracking trends in the social media landscape to find opportunities, and cultivate the social media presence for Verizon. Working as part of the team, they concept, create, and operationally support the brand’s overall goals, and are always on the lookout for new ways to connect with our customer.\n\n\nThe team will be responsible for helping to shape our communication plans and execute them within the social landscape. They will help bring our brand closer to consumers through authentic content and engaging conversations. They will acquire and share deep knowledge of the industry, including the competitive landscape, category disruptors, platform best practices and key business issues that affect Verizon.\n\n### **What you'll be doing:**\n\n* Creating and maintaining content calendars for all social communities, including writing social posts, and managing image and video assets.\n* Interacting with users to foster a positive community experience.\n* Utilizing social media management tools like Sprinklr and TweetDeck to respond to user comments and posts.\n* Aiding our measurement and reporting team to understand what is driving brand sentiment and how the community is feeling.\n* Enforcing social media suidelines and monitoring user content across key social channels like Twitter, TikTok, Reddit, YouTube, and more.\n* Helping develop the strategic direction for social media content and driving alignment with overall business strategy.\n* Assisting in developing thorough and integrated social media strategies and briefs using data analysis and creativity, and presenting them to the CM team.\n* Collaborating with the creative, project management, and production teams to ensure that all content ladders up to approved strategies and briefs.\n* Intuitively adapting to the ever\\-changing landscape of social platforms/social content, and actively advising the team on how our content and/or presence on these platforms should reflect these changes.\n* Establishing self as a thought leader around social media.\n* Researching key stakeholders and their business needs to support creative social media strategy and informing the execution.\n* Assisting in providing strategic recommendations and content support for social media channels for ad hoc projects and campaigns, while ensuring consistency with internal content standards and best practices.\n\n### **What we're looking for:**\n\n### **You’ll need to have:**\n\n* Bachelor's degree or one or more years of work experience.\n* Experience in community management roles for similar brands.\n* Experience with social media measurement and publishing platforms, such as Sprinklr.\n\n### **Even better if you have one of more of the following:**\n\n* Bachelor’s degree.\n* Four or more years of relevant work experience.\n* Are creative, culturally\\-attuned, forward\\-thinking, and data\\-driven – possessing equal parts “creative brain” and “strategic brain”.\n* Strategic thinking skills with a passion for digital and social marketing.\n* Are up to date on the pulse of cultural trends, memes, and conversation topics – all the things that define and move culture in today’s world – and you track how it’s evolving over time.\n* Are a relentless advocate for the consumer and know how to put their voice at the center of all your work, in service of creating content that drives interest and engagement.\n* Are collaborative and willing to build strong relationships with both internal and external agency teams.\n* Understanding of new and emerging social trends as they are happening, and be willing to articulate if/what role Verizon can play in the moment.\n* Adaptibility in a space that requires immediate execution.\n* Experience briefing an in\\-house creative team and/or ad agency.\n* Experience in social media judgement (e.g., knowing what to post and when to post it; the nuances of what content resonates best on different channels).\n* Knowledge of optimizing content on specific social media platforms to drive engagement.\n* Willingness to craft strategic POVs on industry\\-related topics in an ever\\-changing media landscape, and deliver them clearly and concisely.\n* Willingness to accomplish work independently with minimal guidance.\n* Platform proficiency, competent in ad platforms including but not limited to paid social, programmatic display, search, remarketing.\n* Problem\\-solving skills and willingness to navigate difficult issues.\n* Strong analytical skills, understanding of KPI measurement and attribution.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.\n\n\nOur benefits are designed to help you move forward in your career, and in areas of your life outside of Verizon. From health and wellness benefits, short term incentives, 401(k) Savings Plan, stock incentive programs, paid time off, parental leave, adoption assistance and tuition assistance, plus other incentives, we’ve got you covered with our award\\-winning total rewards package. For part\\-timers, your coverage will vary as you may be eligible for some of these benefits depending on your individual circumstances.\nIf you are hired into a California, Colorado, Connecticut, Hawaii, Illinois, Maryland, Minnesota, Nevada, New York, Rhode Island, Washington or Washington, D.C. work location, the compensation range for this position is between $53,000\\.00 and $98,000\\.00 annually based on a full\\-time schedule. The salary will vary depending on your location and confirmed job\\-related skills and experience. This is an incentive based position with the potential to earn more. For part time roles, your compensation will be adjusted to reflect your hours.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "parttime",
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 53000.0,
        "max_amount": 98000.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-06",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-606b2059181ce391",
      "title": "Business Sales Account Manager",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=606b2059181ce391",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1061721/business-sales-account-manager/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Grand Rapids",
        "state": "MI"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n\nWith your sales experience, ability to efficiently manage your time, excellent customer relations skills, and excitement for technology, you'll deliver outstanding and innovative business solutions that support our technology evolution and change the way businesses connect. Whether you're continuously hunting and prospecting for new business or growing existing accounts, you'll consult with customers to identify their business challenges and recommend tailored solutions to solve them and ultimately deliver a powerful return for customers while improving their business and growing our revenue.\n\n* Identifying, developing and qualifying leads within respective territory to drive additional sales opportunities through cold\\-calling, partner\\-selling, lead\\-generation campaigns and modern social selling techniques.\n* Gaining new business and incremental revenue to meet sales targets.\n* Retaining, managing and growing the existing customer base.\n* Coordinating with support partners to educate and excite customers about how they can leverage innovative business solutions.\n* Proactively establishing, building and maintaining relationships with key decision makers.\n* Effectively presenting and creating multi product solution opportunities.\n* Confidently demonstrating a knowledgeable understanding of wireless and mobility products and groundbreaking integrated software solutions to be able to successfully promote and position products including: Cloud, Security, ISP, VoIP and Google platforms.\n* Tracking and reporting progress through the consistent use of a variety of sales force automation tools.\n\n\nWhether you're early in your career or a seasoned sales professional, join today and earn a competitive lucrative salary, which includes base pay and target individual\\-based commission. Planning to go above and beyond? Our commission program allows unlimited opportunity which could allow top earners to exceed compensation plans and compete for various sales incentives. Compensation varies by geography and performance and experience.\n\n\nThis position will support a wireless sales territory that will require travel in and around the **Muskegon, Grand Haven, Big Rapids MI** area. This position is hybrid and must be within a commutable distance to this area for in person meetings, customer site visits, etc. The territory may cover, but is not limited to **Muskegon, Grand Haven, Big Rapids MI** and other towns in and around those areas.\n\n\nThis role may be considered as part of the Department of Defense SkillBridge Program.\n\n\nOur comprehensive benefits (starting day one) and perks are designed to help you move forward in your career and in your life outside of Verizon. From health and well\\-being benefits to investment in your education and career, we've got you covered!\n\n* Best in class medical, dental and vision\n* Verizon 401(k) plan with matching contributions up to 6% of eligible participant contributions to the plan, qualified student loan repayments, or a combination of both.\n* $5,000 or more stock grant per year, part of Verizon's Stock Together award program\n* Engage your clients with Verizon's Velocity Selling methodology. Using AI and advanced CRM tools, the Velocity Selling methodology boosts efficiency, productivity, and decision\\-making through automation, predictive analysis, and personalized customer approach. Providing you with a competitive edge and leverage to boost your own success and career growth.\n* Sales recognition programs that have, in the past, awarded top performers with all inclusive travel to domestic and international destinations, gifts, and other incentives\n* Lucrative paid time off, five weeks of paid time off (vacation, holidays, and personal days)\n* 8 weeks of paid parental leave for eligible new parents (for new moms, when paired with short\\-term disability, this benefit provides up to 16 weeks of paid time\\-off)\n* Up to $8k per year in tuition assistance\n* Expand your knowledge through various industry certifications through Verizon’s Get Certified program\n* Discounts up to 50% off on Verizon products and services, Fios, high\\-speed home internet solutions to accessories and exclusive Verizon features, including 50% off Verizon wireless calling plans and much more.\n* From Employee discounts to pet insurance, we offer additional perks to ensure V\\-teamers and their loved ones are supported holistically\n\nToo good to be true? Come see for yourself! From our in\\-person new hire experience and award\\-winning training programs to our inclusive culture of learning and amazing benefits, you'll be able to apply your skills while elevating your career.\n\n### **What we’re looking for...**\n\n\nYou’re a self\\-motivated person who thrives on crafting the right solution to solve a client’s problems. And you are great at explaining how complex technology can solve everyday business problems in a language people understand. Cold\\-calling feels like a sport to you because meeting new people and discovering their needs is what you enjoy. People seek you out for advice and counsel. You seek to win and take the initiative to close deals and help others around you. You act with integrity. You know that when the team wins, we all win.\n\n  \n\nYou’ll need to have:\n\n* Bachelor’s degree or four or more years of work experience.\n* Four or more years of relevant work experience.\n* Experience in outside sales, prospecting and negotiation.\n* Willingness to work in a mobile working model with travel within your assigned geographic sales territory. Expected travel may be up to approximately 50% of the time.\n* Valid driver’s license.\n\n\nEven better if you have one or more of the following:\n\n* A degree \\- Associates or Bachelor's Degree or certifications/college courses.\n* Two or more years of business\\-to\\-business or outside sales experience, including business acquisition and prospecting/cold calling.\n* Technology sales and educational experience i.e. SaaS sales experience, CRM, SalesForce or other client management tools, social media, etc.\n* Strong presentation skills in a face to face and virtual environment.\n* Experience in building and maintaining business relationships with all levels of client organizations.\n* Ability to work in a fast\\-paced, self\\-directed, entrepreneurial environment.\n* Ability of managing time and prioritizing tasks to accomplish goals.\n* Ability to implement feedback and tailor your approach for success.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this mobile role, you'll primarily work from customer or field location(s), with occasional visits to a Verizon location for in\\-person training and meetings.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 75713.0,
        "max_amount": 95870.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-09",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-171d8b35dc89a798",
      "title": "Buildings Equipment Mechanic",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=171d8b35dc89a798",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1055595/buildings-equipment-mechanic/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Saugus",
        "state": "MA"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n\nYou’re an expert with HVAC, plumbing, electrical and even building mechanicals... and if there’s a maintenance problem with our building, you’ve got it covered! Your know\\-how and commitment to excellence will ensure that Verizon’s building systems always operate at maximum efficiency.\n\n  \n\nYour responsibilities will include, but are not limited to:\n\n* Starting, operating, repairing and maintaining various types of heating and air conditioning, plumbing, carpentry, locksmith, electrical and other building related systems equipment.\n* Performing major repairs and replacements of mechanical plant equipment.\n* Install, repair and calibrate various makes of pneumatic and/or electric controls required for the operation of equipment and the control of temperature and humidity.\n* Performing inspections and making repairs on equipment/systems as required by company practices and/or regulations/ordinances.\n* Reviewing and interpreting work order requests, operating instructions, diagrams, building plans and mechanical equipment drawings.\n* Climbing ladders, working aloft, and moving/lifting items generally not exceeding 100 lbs.\n* Working evenings, weekends, holidays and unscheduled shifts as determined by the needs of the business.\n* Work tour hours are 6am to 3pm, Monday through Friday (hours may vary). Overtime is as needed by the business.\n\n### **What we’re looking for...**\n\n  \n\nYou know HVAC and other building systems like the back of your hand, and are anxious to put your knowledge and skills to work for the Verizon Team. You like to be busy and well\\-organized to stay on top of things. You take pride in a job well done because you know better matters!\n\n\nYou’ll need to have:\n\n* Two (2\\) year Associate degree or equivalent certification from a technical or vocational school in ventilating, air conditioning, plumbing, electrical work and heating plant operations and maintenance.\n* Minimum of two (2\\) years’ experience in ventilating and air conditioning, plumbing, electrical work and heating plant operations and maintenance is desired.\n* Universal Technician Certification as designated by EPA regulations\\-40 CFR Part 82 Subpart H.\n* Valid state driver’s license with a satisfactory driving record.\n\n*The compensation for this position will be as high as $51/hour\\*. The salary will vary depending on your confirmed job\\-related skills and experience*\n\n### **Test(s) Required**\n\n\nBuilding Maintenance Qualification Test, Verizon Job Fit Test B\nTest Previews\n\n### **Where you’ll be working**\n\n\nIn this worksite\\-based role, you'll work onsite at a defined location(s).### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": null,
        "max_amount": null,
        "currency": "USD"
      },
      "date_posted": "2024-11-07",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-0fd307085aea23b3",
      "title": "Digital Marketing Senior Manager",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=0fd307085aea23b3",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1056385/digital-marketing-senior-manager/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Irving",
        "state": "TX"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n\nThe Digital Marketing organization has built a Marketing Automation practice aimed at transforming the way that Verizon creates and manages work across many organizations at a rapid pace. The future of modern marketing is data driven and places technology at the core. This program within Digital Marketing is focused on creating transformational experiences by equipping a variety of business units with the capabilities and functionalities that next\\-gen technologies have the ability to deliver.\n\n\nAs a Digital Marketing Senior Manager, you will be responsible for solutioning, governance and execution on transformational and foundational concepts, allowing us to extract maximum value in our Digital Marketing efforts. You will be using cutting edge tools and AI\\-driven platforms to address key gaps and pain points in the workflow management experience. You will support the workstream leads through building the necessary specifications and supplying operational assistance as needed. Additionally, the role will require the individual to apply a white\\-glove approach while interacting with our business stakeholders. You will help drive innovative, thought\\-provoking \\& scalable solutions that will ultimately propel us into a dominant position in the Marketing Automation space. You will also take the learning and results of each project and present them to leaders to determine the best potential solutions.\n\n\nResponsibilities include:\n\n* Creating, evaluating, and executing systems application governance, architectural and business process design, and developing standard operating procedures throughout the various marketing automation platforms.\n* Driving comparative analysis for feature and tool consideration including the creation of comparison measurement rubrics and tools for evaluation and scoring of software applications that include analyzing for system security alignment, user experience impact, feature and functionality appropriateness, and ability of tools to integrate with other applications in the marketing automation tech stack.\n* Designing and architecting enterprise level multi\\-application solutions that assist in the transformation of business operation workflows to achieve operational excellence.\n* Conducting tool and product demonstrations to various stakeholders including translating technical specifications and functionality to business stakeholders.\n* Building highly effective and mutually\\-rewarding relationships across internal and external stakeholders, able to effectively communicate and gain buy\\-in with stakeholders and executives; liaise seamlessly between technical and business teams.\n* Developing responsible and efficient business practices through delegation of responsibilities across a large variety of time differences.\n\n### **What we’re looking for...**\n\n\nYou’ll need to have:\n\n\n* Bachelor’s degree or four years or more work experience.\n* Six or more years of relevant experience required, demonstrated through one or a combination of work and/or military experience, or specialized training.\n* Experience with Adobe Workfront configuration and implementation.\n* Experience in software implementation and digital transformation.\n* Experience with integration platforms (iPaaS) tools, i.e. Workato, Fusion, Dell Boomi, etc.\n* Experience with tool ownership and platform governance.\n* Experience designing and implementing multi\\-application ecosystems.\n* Experience in creating and executing effective programs to improve design time, speed to market and work efficiencies.\n* Experience planning and implementing workflow management tools that enable significant gains in process velocity improvement.\n\n\nEven better if you have:\n\n* An MBA or Advanced degree in Digital Marketing and Media.\n* Strong data analytics and quantitative skills in financial and assessment of monetization models.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 139223.0,
        "max_amount": 176287.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-09",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-66fdc7176167e14b",
      "title": "Retail Sales Associate",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=66fdc7176167e14b",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1061850/retail-sales-associate/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Lihue",
        "state": "HI"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n\nAs a full\\-time Verizon Retail Sales Associate, you’ll have the opportunity to grow your career with a team focused on unlocking your full potential and sales success within one of our retail stores. Here's what you can expect:\n\n* Generate retail sales by using your passion for cutting\\-edge technology, and exceptional customer service to expand the Verizon network.\n* Learn and uncover customers' needs by creating connections and asking the right questions.\n* Position product insights and solution recommendations to provide customers with a complete top\\-down sales solution.\n* Close sales by using phenomenal communication skills to fulfill customer needs with simple and intuitive tech solutions.\n* Continuously develop yourself through ongoing training and up\\-skill in operational functions across merchandising and inventory.\n* Potential to grow your customer base by placing outbound calls and sending text messages to current Verizon customers who are interested in our products and services.\n* Opportunities to engage with the community outside of the store to expand your loyal customer base, including at off\\-site Verizon sponsored events.\n\n\nWe’re hiring immediately and this isn't your average entry\\-level position! Whether you're early in your career or an experienced sales professional, join today and earn from $49,000 to $59,000 a year, which includes base pay and target individual\\-based commission. Planning to go above and beyond? Our commission program allows unlimited opportunity which could allow top earners to make an extra $10,000 or more per year in addition to the compensation range quoted earlier. Compensation varies by geography and performance.\n\n\nThis position may be eligible for relocation assistance.\n\n\nOur comprehensive benefits (starting day one) and perks are designed to help you move forward in your career and in your life outside of Verizon. From health and well\\-being benefits to investment in your education and career, we've got you covered!\n\n* Best in class medical, dental, and vision\n* Verizon 401(k) plan with matching contributions up to 6% of eligible participant contributions to the plan, qualified student loan repayments, or a combination of both (effective January 1, 2024\\)\n* $2,500 stock grant per year, part of Verizon's Stock Together award program\n* Sales recognition programs that have, in the past, awarded top performers with all inclusive travel to domestic and international destinations, gifts, and other incentives\n* Five weeks of paid time off (vacation, holidays, personal days)\n* 8 weeks of paid parental leave for eligible new parents (for new moms, when paired with short\\-term disability, this benefit provides up to 16 weeks of paid time\\-off)\n* Up to $8K per year in tuition assistance\n* Discounts up to 50% off on Verizon products and services\n* Additional employee discounts on attractions, automotive, travel and more.\n\n**Join Verizon today and be eligible for a $2,500 sign\\-on bonus! (subject to the terms and conditions of the award)**\n\n\nToo good to be true? Hear from our Verizon Retail Team Members on what it's like to be part of a team that invests in you. From our in\\-person new hire experience and award\\-winning training programs to our inclusive culture of learning and amazing benefits, you'll be able to apply your skills while elevating your career.\n\n### **What we’re looking for...**\n\n\nYou’ll need to have:\n\n* High school diploma or GED.\n* One or more years of work experience.\n* Willingness to work evenings, weekends, and holidays (you'll know your schedule four weeks in advance).\n* Openness to pick up additional shifts and earn more income, typically during the summer months, November through December, and/or during peak vacation periods.\n\n\nEven better if you have one or more of the following:\n\n* Experience working in a commission\\-based environment.\n* Demonstrated sales experience communicating with customers to find solutions.\n* Customer service experience.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **After you apply…**\n\n\nYou may be required to take an assessment. It takes about 20 minutes to complete. If you’re selected to move forward, one of our recruiters will reach out to tell you more about the role and answer your questions.\n\n### **Where you’ll be working**\n\n\nIn this worksite\\-based role, you'll work onsite at a defined location(s).### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.\n\n\nOur benefits are designed to help you move forward in your career, and in areas of your life outside of Verizon. From health and wellness benefits, short term incentives, 401(k) Savings Plan, stock incentive programs, paid time off, parental leave, adoption assistance and tuition assistance, plus other incentives, we’ve got you covered with our award\\-winning total rewards package. For part\\-timers, your coverage will vary as you may be eligible for some of these benefits depending on your individual circumstances.\nIf you are hired into a California, Colorado, Connecticut, Hawaii, Illinois, Maryland, Minnesota, Nevada, New York, Rhode Island, Washington or Washington, D.C. work location, the starting base pay rate for this position is $18\\.27/hour. This is a commission based position with the potential to earn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "hourly",
        "min_amount": null,
        "max_amount": null,
        "currency": "USD"
      },
      "date_posted": "2025-01-09",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-6725e19cf1db2c7a",
      "title": "Senior Network Assurance Manager",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=6725e19cf1db2c7a",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1059712/senior-network-assurance-manager/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Cary",
        "state": "NC"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n\nAs a Senior Network Assurance Manager, you will lead teams of Managed Service Network and Security Engineers supporting incident management activities in a multi\\-customer service center in direct support of US Public Sector customers. You will manage a 24x7x365 network and security operations team responsible for ticket management, triage and restoration of issues related to Verizon’s security and network product suite.\n\n\nIn this role you will...\n\n* Have ownership of continuous review, identification, development, and implementation of improvements into the environment to increase efficiency, quality, and speed of delivered services.\n* Communicate and translate functional/operational goals into team/individual objectives, and manage the implementation of policies \\& procedures.\n* Carry out, inspect and validate management administration tasks, such as time management and productivity measurement, personnel development, etc.\n* Manage directly and proactively a team of highly technical, distributed engineers.\n* Provide support/review and escalation for the direct team.\n* Monitor, optimize and report on resource and workforce management.\n* Collaborate with service delivery, program management, network operation centers, account team and various internal and external delivery and support teams to manage the service assurance function.\n* Manage business expenses and revenue to ensure profitability.\n* Ensure protection of customer proprietary network information and Verizon information assets\n\n**Where you'll be working....**  \n\nIn this hybrid role you'll have a defined work location of Cary, North Carolina that includes work from home and assigned office days set by your manager\n\n### **What we’re looking for...**\n\n**You must have...**\n\n* Bachelor’s degree or four or more years of work experience.\n* Six or more years of relevant work experience.\n* Six or more years of experience managing a network or security operations team\n* Experience with communications products and networking technologies.\n* An active DoD Top Secret clearance or the ability to qualify and maintain a Top Secret clearance\n* Be located within commuting distance to the Cary, North Carolina office\n* The ability to work outside of normal office hours\n\n### **Even better if you have one or more of the following:**\n\n* A technical degree.\n* Knowledge of business processes (such as ITIL, Project Management) and the impact thereof on the technical environment.\n* Ability to understand technical issue escalations.\n* Skills to perform complex work for a functional area and general knowledge of other areas within the organization.\n* Experience in coding/scripting\n* Experience in a telecommunications or technology company.\n* Experience managing a network operations team in a managed services environment\n* Ability to think independently using and applying principles, theories, concepts and technologies.\n* Strong leadership and team\\-building capabilities through experience in leading teams or projects to successfully achieve measurable results.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 139744.0,
        "max_amount": 176947.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-09",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-f43c20e2563a1878",
      "title": "Senior Manager Program & Project Management",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=f43c20e2563a1878",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1053352/senior-manager-program-project-management/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Basking Ridge",
        "state": "NJ"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n\nAt our core, we are dedicated to enriching lives by bridging the gap between individuals and premium wireless experiences that not only meet but exceed expectations in value and quality. We believe that everyone deserves access to seamless, reliable, and affordable wireless solutions that enhance their day\\-to\\-day lives, connecting them to what matters most. By joining our team, you'll play a pivotal role in this mission, working towards delivering innovative, customer\\-focused solutions that open up a world of possibilities. We're not just in the business of technology; we're in the business of connecting people, empowering them to explore, share, and engage with the world around them in ways they never thought possible.\n\n  \n\nBuilding on our commitment to connect people with quality experiences that offer the best value in wireless, let's delve deeper into how we strategically position our diverse portfolio to cater to a broad spectrum of needs and preferences. Our portfolio, comprising 11 distinct brands, is meticulously organized into five families, each designed to address specific market segments and distribution channels to maximize reach and impact.\n\n* Total by Verizon \\& Verizon Prepaid: At the forefront, we have Total by Verizon and Verizon Prepaid, our flagship brands available at Verizon exclusive and/or national/retail stores. Verizon Prepaid continues to maintain a robust and loyal consumer base, while Total by Verizon is on a rapid ascent, capturing the hearts of more customers with its compelling offerings.\n* Straight Talk, TracFone, and Walmart Family Mobile: Straight Talk, Tracfone, and Walmart Family Mobile stand as giants in our brand portfolio, boasting significant presence in Walmart. Their extensive reach and solidified position in the market underscore our commitment to accessible, high\\-quality wireless solutions across diverse retail environments.\n* Visible: Visible, as a standalone brand family, caters to the digitally\\-savvy, single\\-line customers who prefer streamlined, online\\-first interactions. This brand is a testament to our adaptability, embracing the digital evolution of customer engagement.\n* Simple Mobile: Carving out a niche of its own, Simple Mobile shines as the premier choice among authorized resellers. Its consistent recognition as the most carried brand in Wave7 Research’s prepaid dealer survey for 36 consecutive quarters speaks volumes about its popularity and reliability.\n* SafeLink: SafeLink remains dedicated to serving customers through government subsidies. With a strategic pivot towards Lifeline in the absence of ACP, SafeLink continues to fulfill its mission of providing essential communication services to those in need.\n\n  \n\nJoin the team that connects people with quality experiences that give them the best value in wireless.\n\n**What you'll be doing ...**\n\n* Maintaining end\\-to\\-end ownership of multiple complex strategic initiatives/projects simultaneously and organize/prioritize them to meet the needs of VZC segments and deliver a customer centric experience.\n* Develop project plans and documentation that will be utilized to complete projects (e.g., stakeholders, resources, budget, and timelines) to track progress of key milestones and drive accountability to stipulated deliverables and deadlines.\n* Act as the point of contact for the participants involved in the projects, initiating and leading meetings with teams, communicating the status of the project, and reaching out to additional teams.\n* Hosting engaging and collaborative core team calls in accordance to project timelines/schedules and drive participant engagement to gain commitment, drive decision making, and complete deliverables that advance projects forward until completion.\n* Holding cross\\-organization and cross\\-BU teams accountable to delivery timelines and update executive leadership on a frequent basis to ensure project progression, feedback, and success.\n* Creating effective communication and collaboration vehicles to maintain consistent contact within cross\\-functional groups as well as teams impacted by ongoing projects and prioritize work based on the overall objectives.\n* Creating and maintaining executive level presentations for strategy, transformation and operational initiatives, business case development, capital, and go\\-to\\-market plans.\n* Presenting and communicating to all levels of the business.\n* Bias to action and operate with a strong sense of urgency, anticipate changes and proactively plan.\n\n\nThis role is a hybrid schedule in office that includes assigned office days (VCG in office days are Tuesday, Wednesday and Thursday).\n\n### **What we’re looking for...**\n\n\nYou’ll need to have:\n\n* Six or more years of relevant experience required, demonstrated through one or a combination of work and/or military experience, or specialized training.\n* Must be able to meet tight deadlines and have a strong customer focus.\n* Ability to multitask, prioritize, and collaborate effectively both within one’s own team and across other Verizon Value divisions.\n* Experience with the following tools: G suite, Asana, JIRA/Confluence.\n\n\nEven better if you have one or more of the following:\n\n* Six sigma green belt certification, PMP certification.\n* 3\\-5 years in process improvement or workflow management role.\n* Broad working knowledge of multiple functions within the business.\n* Demonstrated ability to manage and lead cross\\-functional teams.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.\n\n\nOur benefits are designed to help you move forward in your career, and in areas of your life outside of Verizon. From health and wellness benefits, short term incentives, 401(k) Savings Plan, stock incentive programs, paid time off, parental leave, adoption assistance and tuition assistance, plus other incentives, we’ve got you covered with our award\\-winning total rewards package. For part\\-timers, your coverage will vary as you may be eligible for some of these benefits depending on your individual circumstances.\nIf you are hired into a California, Colorado, Connecticut, Hawaii, Illinois, Maryland, Minnesota, Nevada, New York, Rhode Island, Washington or Washington, D.C. work location, the compensation range for this position is between $101,000\\.00 and $188,000\\.00 annually based on a full\\-time schedule. The salary will vary depending on your location and confirmed job\\-related skills and experience. This is an incentive based position with the potential to earn more. For part time roles, your compensation will be adjusted to reflect your hours.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "parttime",
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 101000.0,
        "max_amount": 188000.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-02",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-acc1a46a1ef1690d",
      "title": "Business Sales Account Manager",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=acc1a46a1ef1690d",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1061813/business-sales-account-manager/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Minneapolis",
        "state": "MN"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n\nWith your sales experience, ability to efficiently manage your time, excellent customer relations skills, and excitement for technology, you'll deliver outstanding and innovative business solutions that support our technology evolution and change the way businesses connect. Whether you're continuously hunting and prospecting for new business or growing existing accounts, you'll consult with customers to identify their business challenges and recommend tailored solutions to solve them and ultimately deliver a powerful return for customers while improving their business and growing our revenue.\n\n* Identifying, developing and qualifying leads within respective territory to drive additional sales opportunities through cold\\-calling, partner\\-selling, lead\\-generation campaigns and modern social selling techniques.\n* Gaining new business and incremental revenue to meet sales targets.\n* Retaining, managing and growing the existing customer base.\n* Coordinating with support partners to educate and excite customers about how they can leverage innovative business solutions.\n* Proactively establishing, building and maintaining relationships with key decision makers.\n* Effectively presenting and creating multi product solution opportunities.\n* Confidently demonstrating a knowledgeable understanding of wireless and mobility products and groundbreaking integrated software solutions to be able to successfully promote and position products including: Cloud, Security, ISP, VoIP and Google platforms.\n* Tracking and reporting progress through the consistent use of a variety of sales force automation tools.\n\n\nWhether you're early in your career or a seasoned sales professional, join today and earn a competitive lucrative salary, which includes base pay and target individual\\-based commission. Planning to go above and beyond? Our commission program allows unlimited opportunity which could allow top earners to exceed compensation plans and compete for various sales incentives. Compensation varies by geography and performance and experience.\n\n\nOur comprehensive benefits (starting day one) and perks are designed to help you move forward in your career and in your life outside of Verizon. From health and well\\-being benefits to investment in your education and career, we've got you covered!\n\n* Best in class medical, dental and vision\n* Verizon 401(k) plan with matching contributions up to 6% of eligible participant contributions to the plan, qualified student loan repayments, or a combination of both.\n* $5,000 or more stock grant per year, part of Verizon's Stock Together award program\n* Engage your clients with Verizon's Velocity Selling methodology. Using AI and advanced CRM tools, the Velocity Selling methodology boosts efficiency, productivity, and decision\\-making through automation, predictive analysis, and personalized customer approach. Providing you with a competitive edge and leverage to boost your own success and career growth.\n* Sales recognition programs that have, in the past, awarded top performers with all inclusive travel to domestic and international destinations, gifts, and other incentives\n* Lucrative paid time off, five weeks of paid time off (vacation, holidays, and personal days)\n* 8 weeks of paid parental leave for eligible new parents (for new moms, when paired with short\\-term disability, this benefit provides up to 16 weeks of paid time\\-off)\n* Up to $8k per year in tuition assistance\n* Expand your knowledge through various industry certifications through Verizon’s Get Certified program\n* Discounts up to 50% off on Verizon products and services, Fios, high\\-speed home internet solutions to accessories and exclusive Verizon features, including 50% off Verizon wireless calling plans and much more.\n* From Employee discounts to pet insurance, we offer additional perks to ensure V\\-teamers and their loved ones are supported holistically\n\nToo good to be true? Come see for yourself! From our in\\-person new hire experience and award\\-winning training programs to our inclusive culture of learning and amazing benefits, you'll be able to apply your skills while elevating your career.\n\n### **What we’re looking for...**\n\n\nYou’re a self\\-motivated person who thrives on crafting the right solution to solve a client’s problems. And you are great at explaining how complex technology can solve everyday business problems in a language people understand. Cold\\-calling feels like a sport to you because meeting new people and discovering their needs is what you enjoy. People seek you out for advice and counsel. You seek to win and take the initiative to close deals and help others around you. You act with integrity. You know that when the team wins, we all win.\n\n  \n\nYou’ll need to have:\n\n* Bachelor’s degree or four or more years of work experience.\n* Four or more years of relevant work experience.\n* Experience in outside sales, prospecting and negotiation.\n* Willingness to work in a mobile working model with travel within your assigned geographic sales territory. Expected travel may be up to approximately 50% of the time.\n* Valid driver’s license.\n\n\nEven better if you have one or more of the following:\n\n* A degree \\- Associates or Bachelor's Degree or certifications/college courses.\n* Two or more years of business\\-to\\-business or outside sales experience, including business acquisition and prospecting/cold calling.\n* Technology sales and educational experience i.e. SaaS sales experience, CRM, SalesForce or other client management tools, social media, etc.\n* Strong presentation skills in a face to face and virtual environment.\n* Experience in building and maintaining business relationships with all levels of client organizations.\n* Ability to work in a fast\\-paced, self\\-directed, entrepreneurial environment.\n* Ability of managing time and prioritizing tasks to accomplish goals.\n* Ability to implement feedback and tailor your approach for success.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this mobile role, you'll primarily work from customer or field location(s), with occasional visits to a Verizon location for in\\-person training and meetings.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.\n\n\nOur benefits are designed to help you move forward in your career, and in areas of your life outside of Verizon. From health and wellness benefits, short term incentives, 401(k) Savings Plan, stock incentive programs, paid time off, parental leave, adoption assistance and tuition assistance, plus other incentives, we’ve got you covered with our award\\-winning total rewards package. For part\\-timers, your coverage will vary as you may be eligible for some of these benefits depending on your individual circumstances.\nIf you are hired into a California, Colorado, Connecticut, Hawaii, Illinois, Maryland, Minnesota, Nevada, New York, Rhode Island, Washington or Washington, D.C. work location, the compensation range for this position is between $45,000\\.00 and $84,000\\.00 annually based on a full\\-time schedule. The salary will vary depending on your location and confirmed job\\-related skills and experience. This is a commission based position with the potential to earn more. For part time roles, your compensation will be adjusted to reflect your hours.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "parttime",
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 45000.0,
        "max_amount": 84000.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-09",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-1d4fae4ef0e4f346",
      "title": "Senior Client Executive New Business Saless-",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=1d4fae4ef0e4f346",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1060209/senior-client-executive-new-business-saless/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Rolling Meadows",
        "state": "IL"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n\nVerizon Connect is guiding a connected world on the go by automating, optimizing and revolutionizing the way people, vehicles and things move through the world. Our full suite of industry\\-defining solutions and services put innovation, automation and connected data to work for customers and help them be safer, more efficient and more productive. With more than 3,500 dedicated employees in 15 countries, we deliver leading mobile technology platforms and solutions.\n\n\nAs a SaaS leader, we know our talent is the most important component to our success. We hire top talent and empower them to do their best work. As a division of Verizon, we combine the fun and excitement of a start\\-up environment with the resources, operational excellence, and brand recognition of an established tech giant.\n\n\nFor this job, The Senior Client Executive for Mid\\-Market accounts will have responsibility to manage the complete sales cycle process in large customer engagements including: prospecting and qualifying opportunities, building a healthy pipeline for new business conducting initial sales calls, discovery sessions and evaluations; building a business case and defining ROI; responding to RFP’s; closing and negotiating contracts; and maintaining current opportunity status in CRM with accurate forecasts for sales management. Sales engineering support is provided with this position as well as product management and product marketing support.\n\n**Duties include:**\n\n* Drive revenue from new accounts.\n* Lead the entire sales process from organic generation through deal negotiation and closing.\n* Negotiate pricing and contractual agreement.\n* Implement creative sales strategies, performing extensive customer needs analyses, surveys, proposals, presentations and product demonstrations.\n* Be accountable for the sales process including account plans, Salesforce.com discipline, consistent and professional communication.\n\n**What we're looking for.**\n\n**You’ll need to have:**\n\n* Bachelor’s degree or four or more years of work experience.\n* Five or more years of relevant work experience.\n* Five or more years B2B field sales experience within the technology industry.\n* Valid driver's license.\n* Willingness to travel up to 50%.\n\n\nEven better if you have one or more of the following:\n\n* MBA.\n* Experience of exceeding quota.\n* Seven or more years of enterprise SaaS experience.\n* Experience selling to Fortune 1000 companies.\n* Ability to identify opportunities and sell solutions driven by customer ROI.\n* Strong communication, partnership and negotiating skills.\n* Knowledge of MS Office products, G Suite and Salesforce.com\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this mobile role, you'll primarily work from customer or field location(s), with occasional visits to a Verizon location for in\\-person training and meetings.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.\n\n\nOur benefits are designed to help you move forward in your career, and in areas of your life outside of Verizon. From health and wellness benefits, short term incentives, 401(k) Savings Plan, stock incentive programs, paid time off, parental leave, adoption assistance and tuition assistance, plus other incentives, we’ve got you covered with our award\\-winning total rewards package. For part\\-timers, your coverage will vary as you may be eligible for some of these benefits depending on your individual circumstances.\nIf you are hired into a California, Colorado, Connecticut, Hawaii, Illinois, Maryland, Minnesota, Nevada, New York, Rhode Island, Washington or Washington, D.C. work location, the compensation range for this position is between $92,000\\.00 and $172,000\\.00 annually based on a full\\-time schedule. The salary will vary depending on your location and confirmed job\\-related skills and experience. This is a commission based position with the potential to earn more. For part time roles, your compensation will be adjusted to reflect your hours.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "parttime",
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 92000.0,
        "max_amount": 172000.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-09",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-44605754a46e658c",
      "title": "Senior Analyst-Financial Planning and Analysis",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=44605754a46e658c",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1053960/senior-analyst-financial-planning-and-analysis/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Lake Mary",
        "state": "FL"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n**The Finance Organization**\n\n\nAt Verizon, we are building a world\\-class Financial Planning \\& Analysis (FP\\&A) organization. We have begun a comprehensive program to streamline processes, improve systems, realign the organization and add opportunities for personal skill\\-building and professional growth. We’re finding new ways to add value and provide strategic support. This is the kind of work we do. We want to build leading FP\\&A practices within Verizon, setting the stage to become the place any FP\\&A professional wants to work. You can become an impetus for change.\n\n**Financial Planning \\& Analytics Services (FPAS)**\n\n\nMove beyond compiling data and help tell the story behind the numbers. The Financial Planning \\& Analytics positions offer opportunities to drive better business partnering and insights, while developing your FP\\&A skill set and leadership as we continue to grow as a world class organization. You are a valuable business partner, finding new and better ways of working by leveraging digital capabilities. You’ll become involved in, but not limited to, planning, reporting, analyses, and initiatives that will impact important decisions around the growth and development of Verizon business.\n\n* Performing subject matter expertise \\& ad\\-hoc analysis, including identifying variance drivers, assisting with the development of the financial plan, and presenting results.\n* Ensuring timely and accurate delivering of financial planning, reporting \\& analyses for the business.\n* Liaison with cross\\-functional teams and business partners to build a network and acquire advanced business \\& technical acumen.\n* Identifying improvement opportunities and executing projects which may include leveraging digital tools for dashboards, automation tools, data workflow creation, and system integration.\n* Actively participating in the cultural and professional development of FPAS as a world class organization through Mentor/Mentee relationships and various activities offered.\n\n**What we’re looking for…**\n\n\nYou’ll need to have:\n\n* Bachelor’s degree or four or more years of work experience.\n* Three or more years of relevant work experience.\n* Experience with Microsoft Office Suite and Google Suite.\n* Experience or transferable skills leveraging digital tools such as Tableau, Qlik, Power BI, Looker, ThoughtSpot, Alteryx, Knime, Power Query, SQL, Python, or R.\n* Willingness to travel up to 25%.\n\n\nEven better if you have one or more of the following:\n\n* Master’s degree in Accounting, Finance, or Economics.\n* Understanding of corporate financial planning, reporting \\& analysis, and costing/profitability methodologies and processes.\n* Knowledge of common business \\& cost drivers, financial statement analysis, and descriptive \\& predictive analysis.\n* Excellent communication skills and ability to focus on the details.\n* Proficiency with Google Suite.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 90234.0,
        "max_amount": 114256.0,
        "currency": "USD"
      },
      "date_posted": "2024-10-27",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-7b5def37d64361e9",
      "title": "Network Operations Engineer",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=7b5def37d64361e9",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1061283/network-operations-engineer/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Los Angeles",
        "state": "CA"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n\nJoin Verizon as we continue to expand our industry\\-leading network to improve the ways people, businesses, and things connect. As a Network Operations Engineer, you will provide technical expertise on a critical role involving network transformation, network outages, service issues, network optimization, and maintenance. You will be responsible for providing support to keep things running smoothly and change the way that our customers live, work, and play. We are a 24x7 highly visible Operations environment that performs troubleshooting, configuration changes, drive issues to resolution, and related functions.\n\n* Performing optimization, troubleshooting, and maintenance of network systems and applications to identify overall system availability and performance.\n* Evaluating network coverage to find gaps, making recommendations to improve coverage, and helping to implement those recommendations.\n* Performing triage, fault isolation, and remediation of network events.\n* Generating, driving, and updating problem\\-tracking tickets via multiple systems and continuously improving business practices.\n* Escalating issues to the appropriate internal/external engineer teams for resolution.\n\n### **What we’re looking for...**\n\n\nBeing the first one to encounter and solve a problem is enjoyable to you. You’re great at following an established process or procedure to complete tasks. Experience navigating and working well at all levels in a fast\\-paced, ever\\-changing network environment. You are dependable and enjoy supporting the rotational needs of a technical environment.\n\n\nYou’ll need to have:\n\n* Associate’s degree or two or more years of work experience.\n* Three or more years of relevant work experience.\n* A valid drivers license.\n* Willingness to travel up to approximately 75% of the time.\n* Willingness to work rotating shifts including weekends, holidays and be on\\-call.\n\n\nEven better if you have one or more of the following:\n\n* A technical degree in Electronics, Telecommunications, Computer Science, Engineering, Business or a related discipline.\n* Knowledge of telecommunications equipment and technologies like Telephony Switching, Data Communications and Network Routers.\n* Computer support experience, including troubleshooting PC hardware and configurations.\n* Vendor management experience.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this worksite\\-based role, you'll work onsite at a defined location(s).### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.\n\n\nOur benefits are designed to help you move forward in your career, and in areas of your life outside of Verizon. From health and wellness benefits, short term incentives, 401(k) Savings Plan, stock incentive programs, paid time off, parental leave, adoption assistance and tuition assistance, plus other incentives, we’ve got you covered with our award\\-winning total rewards package. For part\\-timers, your coverage will vary as you may be eligible for some of these benefits depending on your individual circumstances.\nIf you are hired into a California, Colorado, Connecticut, Hawaii, Illinois, Maryland, Minnesota, Nevada, New York, Rhode Island, Washington or Washington, D.C. work location, the compensation range for this position is between $72,000\\.00 and $134,000\\.00 annually based on a full\\-time schedule. The salary will vary depending on your location and confirmed job\\-related skills and experience. This is an incentive based position with the potential to earn more. For part time roles, your compensation will be adjusted to reflect your hours.\nVerizon will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "parttime",
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 72000.0,
        "max_amount": 134000.0,
        "currency": "USD"
      },
      "date_posted": "2025-01-07",
      "emails": [],
      "is_remote": false,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-074b920d6fb89151",
      "title": "Principal Engineer - Mainframe Performance Capacity Planning",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=074b920d6fb89151",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1059868/principal-engineer-mainframe-performance-capacity-planning/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Basking Ridge",
        "state": "NJ"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing...**\n\n\nThe TSGI (Technology Strategy and Global Infrastructure) team is seeking a highly skilled and detail\\-oriented Mainframe Performance and Capacity Planning Specialist to join our IT team. In this role, you will be responsible for monitoring, analyzing, and optimizing the performance and capacity of our mainframe systems. Your expertise will ensure the reliability, efficiency, and scalability of our mainframe infrastructure to meet the evolving needs of our business. Key responsibilities include:\n\n* Monitoring mainframe performance using specialized tools and software. Analyzing performance metrics to identify bottlenecks and areas for improvement.\n* Developing and maintaining capacity planning models to forecast future resource requirements. Ensuring that system capacity meets current and anticipated business needs.\n* Discovering and prototyping new technology solutions for Systems of Engagement, Customer Experience Platforms, and Systems of Insights.\n* Diagnosing and resolving performance\\-related issues. Collaborating with other IT teams to address and resolve complex problems affecting system performance.\n* Generating regular performance and capacity reports. Providing insights and recommendations based on data analysis to senior management and other stakeholders.\n* Overseeing configuration changes and updates to ensure they do not adversely affect system performance. Maintaining documentation related to system configurations and changes.\n* Analyzing historical performance data to identify trends and making proactive recommendations for improvements or upgrades.\n* Working closely with application developers, system administrators, and other IT professionals to understand application demands and impact on mainframe performance.\n* Assisting in the development and testing of disaster recovery plans related to mainframe systems to ensure business continuity.\n* Ensuring all activities comply with organizational policies, industry standards, and regulatory requirements.\n\n  \n\n\n\n### **What we’re looking for...**\n\n* Bachelor's degree or four or more years of work experience\n* Six or more years of relevant experience required, demonstrated through one or a combination of work and/or military experience, or specialized training.\n* Experience in mainframe performance and capacity planning in large z/OS environments or related experience in Client\\-server, Mid\\-range, and Cloud environments.\n* Mainframe security experience: RACF, Security Compliance/Privacy Management concepts, Regulatory Standards/Policies (NIST/PCI/HIPAA/GDPR).\n* Experience working with a distributed architecture involving Client\\-Server, Mainframe technologies (on\\-prem, cloud)\n* Expert in capacity planning and performance tuning of mainframe systems.\n* Deep understanding of z/OS, SYSPLEX, CICS, MQ, DBMSs, and Networking.\n* Exposure to Observability, Cloud architecture, and Automation is a plus\n\n**Even better if you have one or more of the following:**\n\n* Bachelor’s degree in Computer Science, Information Technology, or a related field. Relevant certifications (e.g., IBM Certified Specialist) are a plus.\n* Strong analytical skills with the ability to interpret complex performance data.\n* Vulnerability scanning, Penetration testing, Certificate management and management of communication protocols like SSL/AT\\-TLS.\n* Knowledge of z16 architecture including zIIP and Coupling Facilities, and I/O subsystems and access methods.\n* Expertise in z/OS Sysplex management, WLM, RMF, MXG, and EXCEL.\n* Insight into SCRT reporting and IBM and other mainframe vendor software pricing structures.\n* Experience in using analytics and observability tools such as Grafana, Dynatrace, Kibana, NewRelic, Splunk, Prometheus, etc\n* Knowledge and experience with SRE practice. Experience in SRE, DevOps tooling, Automation, and Agile Development practices.\n* Knowledge of Cloud, Containerization, DevOps, Agile, Cassandra, and other emerging technologies.\n* Understanding of AWS, Kubernetes, JVM, Big data analytics, Node.JS, GIS Software, Microservices, 5G Network KPIs, and Frontend Technologies.\n* Knowledge and experience with SRE practice. Experience in SRE, DevOps tooling, Automation, and Agile Development practices.\n* Knowledge of Cloud, Containerization, DevOps, Agile, Cassandra, and other emerging technologies.\n* Understanding of AWS, Kubernetes, JVM, Big data analytics, Node.JS, GIS Software, Microservices, 5G Network KPIs, and Frontend Technologies.\n* Excellent problem\\-solving skills and attention to detail.\n* Effective communication skills and the ability to collaborate with cross\\-functional teams.\n* Ability to work under pressure and handle multiple priorities.\n* Proven ability to work with application teams to ensure efficient system use and optimal configuration planning.\n* Ability to stay current with industry trends and emerging technologies.\n* Able to explain complex technical requirements and considerations across varied technical and managerial levels.\n\n  \n\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 154712.0,
        "max_amount": 195900.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-13",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    },
    {
      "id": "in-73a1db1c5d591872",
      "title": "Employee Engagement Senior Manager",
      "company_name": "Verizon",
      "job_url": "https://www.indeed.com/viewjob?jk=73a1db1c5d591872",
      "job_url_direct": "https://mycareer.verizon.com/jobs/r-1059538/employee-engagement-senior-manager/?source=jb-indeed",
      "location": {
        "country": "US",
        "city": "Basking Ridge",
        "state": "NJ"
      },
      "description": "### **When you join Verizon**\n\n\nYou want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere \\& always. Want in? Join the V Team Life.\n\n### **What you’ll be doing …**\n\n\nThe Employee Engagement team at Verizon is looking for a senior communications strategist to improve how we reach and engage our V Teamers. As a key member of the Employee Engagement Center of Excellence, you will work closely with our communications team and partners to develop and implement effective communication strategies and tactics that elevate Verizon’s reputation as an employer of choice.\n\n\nThe Employee Engagement Senior Manager is responsible for managing the internal communication calendar, editorial reviews, content development, employee segmentation, project management, and traffic flow, as well as managing the effective delivery of communications across our key channels. This role will work closely with the Director of Employee Engagement, the Employee Engagement team, and other members of the Corporate Communications team. This leader will help ensure that all internal and external communications are aligned with the company's overall business objectives and delivered effectively and timely and that strategic objectives are being met through effective measurement and continuous improvement.\n\n\nAs an experienced and highly creative strategist, your responsibilities will include creating integrated communications strategies, plans, and assets for transformational programs. You must be willing to constantly innovate and seek out the best practices, latest trends, best technologies and most efficient processes. More than anything, you must be able to be a trusted, strategic counselor to senior leaders in Communications and beyond.\n\n\nResponsibilities include:\n\n* Supporting the Communications and HR leaders to translate their priorities into strategic and differentiated communication programs that deliver on Verizon’s priorities and overall strategy.\n* Providing strategic guidance on messaging and effective communications by helping subject matter experts translate complex information into easy\\-to\\-understand, actionable and compelling content that resonates with employees.\n* Developing and executing a comprehensive employee engagement strategy that aligns with the company's overall business goals.\n* Overseeing the development and implementation of internal and external communications campaigns.\n* Designing innovative and audience\\-centric ways of delivering engaging content across a mix of internal and external channels (i.e., executive communications, videos, articles, Slack, email, infographics and events).\n* Managing the editorial calendar and ensuring that all content is accurate, engaging, and timely.\n* Segmenting and targeting employee audiences to ensure that communications are delivered effectively and in compliance.\n* Monitoring and evaluating the effectiveness of employee engagement initiatives and building strategies to continuously improve effectiveness.\n* Staying up\\-to\\-date on the latest trends in employee engagement and communications.\n* Leveraging data to advance reputational goals across multiple internal and external audiences to showcase how Verizon is an employer of choice.\n* Identifying positive stories and storytellers, empowering employees to share their experiences, and preparing executives to tell the Verizon story through powerful and persuasive messaging, research, and data.\n\n### **What we're looking for...**\n\n\nYou’ll need to have:\n\n* Bachelor's degree or four or more years of work experience.\n* Six or more years of relevant experience required, demonstrated through one or a combination of work and/or military experience, or specialized training.\n* Experience in employee engagement and communications.\n* Strong understanding of editorial strategy and content development.\n* Excellent written and verbal communication skills with a proven ability to think strategically and develop creative solutions.\n* Up\\-to\\-date knowledge of the latest trends in employee engagement and communications.\n\n\nEven better if you have one or more of the following:\n\n* Ability to synthesize business issues into written communications and provide high\\-level strategic thinking that addresses challenges and celebrates key milestones.\n* Experience collaborating and interacting with leaders at multiple levels in varying businesses and geographies.\n* Demonstrated ability to influence, counsel, and guide leaders as a trusted advisor.\n* Extreme attention to detail; holds internal and external partners to the same high standards.\n* Understanding of the complexities of working within a global organization and its impact on deliverables (e.g., global processes, languages, time zones, cultural differences, etc.).\n* Ability to adapt quickly to changing priorities, pivot quickly, and respond with urgency.\n* Sound business judgment and experience “connecting the dots” across programs and topics.\n* Positive approach and commitment to collaboration with a shared purpose.\n* Superb critical thinking skills and the ability to take a concept from ideation and strategy to execution autonomously.\n* Tenacious content creation skills, constant curiosity, and a fascination for the world of technology and its broader societal impact.\n* Ability to thrive in a dynamic environment.\n* A love of learning and trying new things.\n* An excitement to grow at a fast\\-paced, Fortune 50 organization.\n* Project management certification.\n* Deep understanding of internal communication best practices.\n* Experience working in high\\-traffic media organizations.\n\n\nIf Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above.\n\n### **Where you’ll be working**\n\n\nIn this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager.### **Scheduled Weekly Hours**\n\n\n40### **Equal Employment Opportunity**\n\n\nWe’re proud to be an equal opportunity employer \\- and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.\n\n\nOur benefits are designed to help you move forward in your career, and in areas of your life outside of Verizon. From health and wellness benefits, short term incentives, 401(k) Savings Plan, stock incentive programs, paid time off, parental leave, adoption assistance and tuition assistance, plus other incentives, we’ve got you covered with our award\\-winning total rewards package. For part\\-timers, your coverage will vary as you may be eligible for some of these benefits depending on your individual circumstances.\nIf you are hired into a California, Colorado, Connecticut, Hawaii, Illinois, Maryland, Minnesota, Nevada, New York, Rhode Island, Washington or Washington, D.C. work location, the compensation range for this position is between $109,000\\.00 and $202,000\\.00 annually based on a full\\-time schedule. The salary will vary depending on your location and confirmed job\\-related skills and experience. This is an incentive based position with the potential to earn more. For part time roles, your compensation will be adjusted to reflect your hours.",
      "company_url": "https://www.indeed.com/cmp/Verizon",
      "company_url_direct": "https://mycareer.verizon.com/",
      "job_type": [
        "parttime",
        "fulltime"
      ],
      "compensation": {
        "interval": "yearly",
        "min_amount": 109000.0,
        "max_amount": 202000.0,
        "currency": "USD"
      },
      "date_posted": "2024-12-18",
      "emails": [],
      "is_remote": true,
      "listing_type": null,
      "job_level": null,
      "company_industry": null,
      "company_addresses": "New York, NY",
      "company_num_employees": "10,000+",
      "company_revenue": "more than $10B (USD)",
      "company_description": "Here, passion finds purpose and anyone who wants to make a difference can create impact. Dream it. Build it. Do it here.",
      "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a7fd0283b663dde1820c3af59be9831b",
      "banner_photo_url": null,
      "job_function": null
    }
  ]
}